{
  "papers": [
    {
      "id": "bibtex:Matias2025-px",
      "title": "How public involvement can improve the science of AI",
      "authors": [
        "Matias, J Nathan",
        "Price, Megan"
      ],
      "venue": "Proceedings of the National Academy of Sciences",
      "year": 2025,
      "abstract": "As AI systems from decision-making algorithms to generative AI are deployed more widely, computer scientists and social scientists alike are being called on to provide trustworthy quantitative evaluations of AI safety and reliability. These calls have included demands from affected parties to be given a seat at the table of AI evaluation. What, if anything, can public involvement add to the science of AI? In this perspective, we summarize the sociotechnical challenge of evaluating AI systems, wh...",
      "tags": [
        "evaluation",
        "policy",
        "Article",
        "citizen science",
        "participatory research",
        "Proc. Natl. Acad. Sci. U. S. A.",
        "AI"
      ],
      "dateAdded": "2025-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Proceedings of the National Academy of Sciences",
      "type": "article"
    },
    {
      "id": "bibtex:Gardam2025-er",
      "title": "Multimodal narratives of climate denial: A novel, visual-first methodology for analysing conspiracy theory discourse on Instagram",
      "authors": [
        "Gardam, Caroline",
        "Riedlinger, Michelle",
        "Angus, Daniel",
        "(Jane) Tan, Xue Ying"
      ],
      "venue": "Elsevier BV",
      "year": 2025,
      "abstract": "Published in Discourse Context \\& Media | Year: 2025 | Authors: Gardam, Caroline, Riedlinger, Michelle, Angus, Daniel, (Jane) Tan, Xue Ying",
      "tags": [
        "Article",
        "Discourse Context \\& Media"
      ],
      "dateAdded": "2025-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Elsevier BV",
      "type": "article"
    },
    {
      "id": "bibtex:Lin2025-xp",
      "title": "Persuading voters using human–artificial intelligence dialogues",
      "authors": [
        "Lin, Hause",
        "Czarnek, Gabriela",
        "Lewis, Benjamin",
        "White, Joshua P",
        "Berinsky, Adam J",
        "Costello, Thomas",
        "Pennycook, Gordon",
        "Rand, David G"
      ],
      "venue": "Springer Science and Business Media LLC",
      "year": 2025,
      "abstract": "There is great public concern about the potential use of generative artificial intelligence (AI) for political persuasion and the resulting impacts on elections and democracy1–6. We inform these concerns using pre-registered experiments to assess the ability of large language models to influence voter attitudes. In the context of the 2024 US presidential election, the 2025 Canadian federal election and the 2025 Polish presidential election, we assigned participants randomly to have a conversatio...",
      "tags": [
        "Article",
        "Nature"
      ],
      "dateAdded": "2025-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Springer Science and Business Media LLC",
      "type": "article"
    },
    {
      "id": "bibtex:Song2025-yh",
      "title": "The spread of pro- and anti-vaccine views by coordinated communities on facebook during COVID-19 pandemic",
      "authors": [
        "Song, Yunya",
        "Zhang, Yin",
        "Zou, Sheng",
        "Yang, Xian",
        "Huang, Qintao"
      ],
      "venue": "Springer Science and Business Media LLC",
      "year": 2025,
      "abstract": "Abstract The widespread dissemination of problematic vaccine-related content during the COVID-19 pandemic has posed serious challenges to public health and eroded institutional trust. This study investigates the interplay between manipulative social media actors, coordinated behaviors, and misleading information by analyzing coordinated link sharing behavior (CLSB) on Facebook in the United Kingdom and the United States. Drawing on a dataset of 3,469,719 public Facebook posts, we examine whether...",
      "tags": [
        "Article",
        "J. Comput. Soc. Sci."
      ],
      "dateAdded": "2025-11-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Springer Science and Business Media LLC",
      "type": "article"
    },
    {
      "id": "bibtex:Triedman2025-uy",
      "title": "What did Elon change? A comprehensive analysis of Grokipedia",
      "authors": [
        "Triedman, Harold",
        "Mantzarlis, Alexios"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Elon Musk released Grokipedia on 27 October 2025 to provide an alternative to Wikipedia, the crowdsourced online encyclopedia. In this paper, we provide the first comprehensive analysis of Grokipedia and compare it to a dump of Wikipedia, with a focus on article similarity and citation practices. Although Grokipedia articles are much longer than their corresponding English Wikipedia articles, we find that much of Grokipedia's content (including both articles with and without Creative Commons lic...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2025-11-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Allen2025-ot",
      "title": "Platform-independent experiments on social media",
      "authors": [
        "Allen, Jennifer",
        "Tucker, Joshua A"
      ],
      "venue": "American Association for the Advancement of Science (AAAS)",
      "year": 2025,
      "abstract": "Changing algorithms with artificial intelligence tools can influence partisan animosity.",
      "tags": [
        "Article",
        "Science"
      ],
      "dateAdded": "2025-11-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "American Association for the Advancement of Science (AAAS)",
      "type": "article"
    },
    {
      "id": "bibtex:FitzGerald2025-nv",
      "title": "The persistence of informational manipulation and the appropriation of emerging events",
      "authors": [
        "FitzGerald, Katherine M",
        "Whelan-Shamy, Daniel",
        "Graham, Timothy"
      ],
      "venue": "Routledge",
      "year": 2025,
      "abstract": "Year: 2025 | Authors: FitzGerald, Katherine M, Whelan-Shamy, Daniel, Graham, Timothy",
      "tags": [
        "Incollection"
      ],
      "dateAdded": "2025-11-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Routledge",
      "type": "incollection"
    },
    {
      "id": "bibtex:Frischlich2025-vn",
      "title": "The complexity of misinformation extends beyond virus and warfare analogies",
      "authors": [
        "Frischlich, Lena",
        "Olsson, Henrik",
        "Roy, Abhishek",
        "Schulze, Heidi",
        "Rhodes, Stan",
        "Mansheim, Alison"
      ],
      "venue": "Springer Science and Business Media LLC",
      "year": 2025,
      "abstract": "Abstract Debates about misinformation and countermeasures are often driven by dramatic analogies, such as “infodemic” or “information warfare”. While useful shortcuts to interference, these analogies obscure the complex system through which misinformation propagates, leaving perceptual gaps where solutions lie unseen. We present a new framework of the complex multilevel system through which misinformation propagates and show how popular analogies fail to account for this complexity. We discuss i...",
      "tags": [
        "Article",
        "Npj Complex."
      ],
      "dateAdded": "2025-10-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Springer Science and Business Media LLC",
      "type": "article"
    },
    {
      "id": "bibtex:Bak-Coleman2025-pm",
      "title": "The risks of industry influence in tech research",
      "authors": [
        "Bak-Coleman, Joseph",
        "O'connor, Cailin",
        "Bergstrom, Carl",
        "West, Jevin"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Emerging information technologies like social media, search engines, and AI can have a broad impact on public health, political institutions, social dynamics, and the natural world. It is critical to develop a scientific understanding of these impacts to inform evidence-based technology policy that minimizes harm and maximizes benefits. Unlike most other global-scale scientific challenges, however, the data necessary for scientific progress are generated and controlled by the same industry that ...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2025-10-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Prochaska2025-ef",
      "title": "Deep storytelling: Collective sensemaking and layers of meaning in U.s. elections",
      "authors": [
        "Prochaska, Stephen",
        "Vera, Julie",
        "Lew Tan, Douglas",
        "Yamron, Ben",
        "Venuto, Sylvie",
        "Kejriwal, Amaya",
        "Chu, Sarah",
        "Starbird, Kate"
      ],
      "venue": "Association for Computing Machinery (ACM)",
      "year": 2025,
      "abstract": "Misinformation and disinformation about elections remain pressing concerns for researchers, policymakers, and the public. Critics, however, argue that fears surrounding these issues are exaggerated due to a lack of evidence of impact. This debate highlights the challenges inherent in assessing the impacts of misinformation, as the drivers of false and misleading content often exist in the context of a specific claim. To address this issue, we examined false and misleading information surrounding...",
      "tags": [
        "Article",
        "Proc. ACM Hum. Comput. Interact."
      ],
      "dateAdded": "2025-10-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Association for Computing Machinery (ACM)",
      "type": "article"
    },
    {
      "id": "bibtex:Starbird2025-jj",
      "title": "What is going on? An evidence-frame framework for analyzing online rumors about election integrity",
      "authors": [
        "Starbird, Kate",
        "Prochaska, Stephen",
        "Yamron, Ben"
      ],
      "venue": "Association for Computing Machinery (ACM)",
      "year": 2025,
      "abstract": "Pervasive falsehoods that erode trust in election processes are of increasing concern to democracies around the world. Misleading claims like these are often understood as simply ''getting the facts wrong''. Using a grounded, interpretative, mixed-method approach to study Twitter activity during the 2022 U.S. Midterm Election in Arizona, our work paints a more nuanced picture. We adapt Klein's data-frame theory of collective sensemaking to online rumors, demonstrating how misleading claims about...",
      "tags": [
        "Article",
        "Proc. ACM Hum. Comput. Interact."
      ],
      "dateAdded": "2025-10-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Association for Computing Machinery (ACM)",
      "type": "article"
    },
    {
      "id": "bibtex:Orlando2025-ul",
      "title": "Emergent coordinated behaviors in networked LLM agents: Modeling the strategic dynamics of information operations",
      "authors": [
        "Orlando, Gian Marco",
        "Ye, Jinyi",
        "La Gatta, Valerio",
        "Saeedi, Mahdi",
        "Moscato, Vincenzo",
        "Ferrara, Emilio",
        "Luceri, Luca"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Generative agents are rapidly advancing in sophistication, raising urgent questions about how they might coordinate when deployed in online ecosystems. This is particularly consequential in information operations (IOs), influence campaigns that aim to manipulate public opinion on social media. While traditional IOs have been orchestrated by human operators and relied on manually crafted tactics, agentic AI promises to make campaigns more automated, adaptive, and difficult to detect. This work pr...",
      "tags": [
        "Article",
        "arXiv [cs.MA]"
      ],
      "dateAdded": "2025-10-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Murtfeldt2025-wu",
      "title": "RIP Twitter API: A eulogy to its vast research contributions",
      "authors": [
        "Murtfeldt, Ryan",
        "Paik, Sejin",
        "Alterman, Naomi",
        "Kahveci, Ihsan",
        "West, Jevin D"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Since 2006, Twitter's APIs have been rich sources of data for researchers studying social phenomena such as misinformation, public communication, crisis response, and political behavior. However, in 2023, Twitter began heavily restricting data access, dismantling its academic access program, and setting the Enterprise API price at \\$42,000 per month. Lacking funds to pay this fee, academics are scrambling to continue their research. This study systematically tabulates the number of studies, cita...",
      "tags": [
        "Article",
        "arXiv [cs.CY]"
      ],
      "dateAdded": "2025-10-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Donovan2025-ws",
      "title": "EXPRESS: A short history of misinformation-at-scale and efforts to mitigate it",
      "authors": [
        "Donovan, Joan"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "This article traces the social construction of misinformation-at-scale by charting the diverse content moderation methods adopted by social media companies between 2016-2021, when perceptions about social media harming public health and political outcomes became a major public issue. The concept of “misinformation” refers to false or inaccurate information. Misinformation-at scale occurs when false information is amplified online and shared by politicians, journalists, public figures, or other d...",
      "tags": [
        "Article",
        "J. Public Policy Mark."
      ],
      "dateAdded": "2025-09-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Rodriguez_Farres2025-sg",
      "title": "Real time detection of coordinated bots on Bluesky",
      "authors": [
        "Rodríguez Farrés, Pol",
        "Masali, Athina",
        "Cerquides, Jesus"
      ],
      "venue": "IOS Press",
      "year": 2025,
      "abstract": "The growing popularity of social media platforms such as X, Instagram, TikTok, and, more recently, Bluesky, has led to an increase in fake data and misinformation. Although fact checking is essential, misinformation is often perceived as true when a post goes viral. Viralization is frequently driven by coordinated activity. While organic coordination can exist, the presence of coordinated bot networks poses a significant threat to information integrity. This paper focuses on real time detection ...",
      "tags": [
        "Incollection"
      ],
      "dateAdded": "2025-09-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "IOS Press",
      "type": "incollection"
    },
    {
      "id": "bibtex:Arminio2025-tw",
      "title": "Leveraging VLLMs for visual clustering: Image-to-text mapping shows increased semantic capabilities and interpretability",
      "authors": [
        "Arminio, Luigi",
        "Magnani, Matteo",
        "Piqueras, Matías",
        "Rossi, Luca",
        "Segerberg, Alexandra"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "As visual content becomes increasingly prominent on social media, automated image categorization is vital for computational social science efforts to identify emerging visual themes and narratives in online debates. However, the methods based on convolutional neural networks (CNNs) currently used in the field are unable to fully capture the connotative meaning of images, and struggle to produce easily interpretable clusters. In response to these challenges, we test an approach that leverages the...",
      "tags": [
        "Article",
        "Soc. Sci. Comput. Rev."
      ],
      "dateAdded": "2025-09-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Oprea2025-lf",
      "title": "Behind the screen: The use of Facebook accounts with inauthentic behavior during European elections",
      "authors": [
        "Oprea, Bogdan",
        "Pașnicu, Paula",
        "Niculae, Alexandru-Ninel",
        "Bonciu, Constantin-Cozmin",
        "Tudorașcu-Dobre, Dragoș"
      ],
      "venue": "Cogitatio",
      "year": 2025,
      "abstract": "Technology has reshaped political communication, allowing fake engagement to drive real influence in the democratic process. Hyperactive social media users, who are over-proportionally active in relation to the mean, are the new political activists, spreading partisan content at scale on social media platforms. Using The Authenticity Matrix tool, this study revealed Facebook accounts of hyperactive users exhibiting inauthentic behaviour that were used during the electoral campaign (May 10, 2024,...",
      "tags": [
        "election campaign",
        "political communication",
        "Media Commun.",
        "social media",
        "fake accounts",
        "Article",
        "inauthentic behavior",
        "Facebook",
        "manipulation",
        "Meta"
      ],
      "dateAdded": "2025-09-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Cogitatio",
      "type": "article"
    },
    {
      "id": "bibtex:Tonneau2025-bv",
      "title": "Language Disparities in Moderation Workforce Allocation by Social Media Platforms",
      "authors": [
        "Tonneau, Manuel",
        "Liu, Diyi",
        "McGrady, Ryan",
        "Zheng, Kevin",
        "Schroeder, Ralph",
        "Zuckerman, Ethan",
        "Hale, Scott"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Year: 2025 | Authors: Tonneau, Manuel, Liu, Diyi, McGrady, Ryan, Zheng, Kevin, Schroeder, Ralph, Zuckerman, Ethan, Hale, S...",
      "tags": [
        "Article"
      ],
      "dateAdded": "2025-08-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Marwick2025-ov",
      "title": "Shapeshifters and starseeds: Populist knowledge production, generous epistemology, and disinformation on U.s. conspiracy TikTok",
      "authors": [
        "Marwick, Alice",
        "Pippert, Courtlyn",
        "Furl, Katherine",
        "Schnabel, Elaine"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "This article investigates the intersection of identity, power, and knowledge production on U.S. ConspiracyTok, a genre of TikTok videos promoting conspiracy theories ranging from harmless speculation to harmful disinformation. Drawing on qualitative content analysis of 202 highly viewed videos, we examine how identity markers such as race and gender shape who is empowered or undermined in conspiratorial narratives, and how creators construct and circulate “evidence” to support their claims. We f...",
      "tags": [
        "Article",
        "Soc. Media Soc."
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Zhao2025-ny",
      "title": "Demystifying hashtag hijacking in the public opinion game: attention, narratives, and social bots",
      "authors": [
        "Zhao, Bei",
        "Ren, Wujiong",
        "He, Yuan",
        "Zhang, Hongzhong"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "Published in Inf. Commun. Soc. | Year: 2025 | Authors: Zhao, Bei, Ren, Wujiong, He, Yuan, Zhang, Hongzhong",
      "tags": [
        "Article",
        "Inf. Commun. Soc."
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Meher2025-qb",
      "title": "ConflLlama: Domain-specific adaptation of large language models for conflict event classification",
      "authors": [
        "Meher, Shreyas",
        "Brandt, Patrick T"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "We present ConflLlama, demonstrating how efficient fine-tuning of large language models can advance automated classification tasks in political science research. While classification of political events has traditionally relied on manual coding or rigid rule-based systems, modern language models offer the potential for more nuanced, context-aware analysis. However, deploying these models requires overcoming significant technical and resource barriers. We demonstrate how to adapt open-source lang...",
      "tags": [
        "Article",
        "Res. Politics"
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Mannocci2025-ig",
      "title": "Multimodal coordinated online behavior: Trade-offs and strategies",
      "authors": [
        "Mannocci, Lorenzo",
        "Cresci, Stefano",
        "Magnani, Matteo",
        "Monreale, Anna",
        "Tesconi, Maurizio"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Coordinated online behavior, which spans from beneficial collective actions to harmful manipulation such as disinformation campaigns, has become a key focus in digital ecosystem analysis. Traditional methods often rely on monomodal approaches, focusing on single types of interactions like co-retweets or co-hashtags, or consider multiple modalities independently of each other. However, these approaches may overlook the complex dynamics inherent in multimodal coordination. This study compares diff...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Fan2025-ut",
      "title": "The medium is not the message: Deconfounding text embeddings via linear concept erasure",
      "authors": [
        "Fan, Yu",
        "Tian, Yang",
        "Ravfogel, Shauli",
        "Sachan, Mrinmaya",
        "Ash, Elliott",
        "Hoyle, Alexander"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Embedding-based similarity metrics between text sequences can be influenced not just by the content dimensions we most care about, but can also be biased by spurious attributes like the text's source or language. These document confounders cause problems for many applications, but especially those that need to pool texts from different corpora. This paper shows that a debiasing algorithm that removes information about observed confounders from the encoder representations substantially reduces th...",
      "tags": [
        "Article",
        "arXiv [cs.CL]"
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Sadler2025-vu",
      "title": "Suspicious stories: taking narrative seriously in disinformation research",
      "authors": [
        "Sadler, Neil"
      ],
      "venue": "Oxford University Press (OUP)",
      "year": 2025,
      "abstract": "Abstract The concept of narrative has been widely employed in the disinformation literature. Nonetheless, its use has been dominated by loose intuitions of what narratives are and do alongside vague accounts of specific stories. Theorized more carefully, thinking in terms of narrative has much to offer disinformation studies by helping to better define what constitutes disinformation and providing sophisticated frameworks for assessing specific content. To enable a nuanced view of narrative trut...",
      "tags": [
        "Article",
        "Commun. Theory"
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Oxford University Press (OUP)",
      "type": "article"
    },
    {
      "id": "bibtex:Jurg2025-ur",
      "title": "Ranking authority: A critical audit of YouTube’s content moderation",
      "authors": [
        "Jurg, Daniel",
        "Romano, Salvatore",
        "Rieder, Bernhard"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "This chapter examines YouTube’s content moderation practices during the 2024 European Parliamentary elections. Using search results from the Netherlands, Germany, and France, plus an API sample, it explores YouTube’s pledge to raise authoritative sources and remove harmful content. Findings suggest the search algorithm favors legacy media and Public Service Media (PSM). While many PSM carry a publisher context label, deployment seems patchy and absent in European languages such as Basque, Catala...",
      "tags": [
        "Article"
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Kuznetsova2025-nu",
      "title": "Amplifying the regime: identifying coordinated activity of pro-government Telegram channels in Russia and Belarus",
      "authors": [
        "Kuznetsova, Daria"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "Published in J. Inf. Technol. Politics | Year: 2025 | Authors: Kuznetsova, Daria",
      "tags": [
        "Article",
        "J. Inf. Technol. Politics"
      ],
      "dateAdded": "2025-07-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Rieder2025-ju",
      "title": "Forgetful by design? A critical audit of YouTube's search API for academic research",
      "authors": [
        "Rieder, Bernhard",
        "Padilla, Adrian",
        "Coromina, Oscar"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "This paper critically audits the search endpoint of YouTube's Data API (v3), a common tool for academic research. Through systematic weekly searches over six months using eleven queries, we identify major limitations regarding completeness, representativeness, consistency, and bias. Our findings reveal substantial differences between ranking parameters like relevance and date in terms of video recall and precision, with relevance often retrieving numerous off-topic videos. We also find severe te...",
      "tags": [
        "Article",
        "arXiv [cs.IR]"
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Waight2025-al",
      "title": "Quantifying narrative similarity across languages",
      "authors": [
        "Waight, Hannah",
        "Messing, Solomon",
        "Shirikov, Anton",
        "Roberts, Margaret E",
        "Nagler, Jonathan",
        "Greenfield, Jason",
        "Brown, Megan A",
        "Aslett, Kevin",
        "Tucker, Joshua A"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "How can one understand the spread of ideas across text data? This is a key measurement problem in sociological inquiry, from the study of how interest groups shape media discourse, to the spread of policy across institutions, to the diffusion of organizational structures and institution themselves. To study how ideas and narratives diffuse across text, we must first develop a method to identify whether texts share the same information and narratives, rather than the same broad themes or exact fe...",
      "tags": [
        "Article",
        "Sociol. Methods Res."
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Renault2025-uh",
      "title": "Republicans are flagged more often than Democrats for sharing misinformation on X’s Community Notes",
      "authors": [
        "Renault, Thomas",
        "Mosleh, Mohsen",
        "Rand, David G"
      ],
      "venue": "Proceedings of the National Academy of Sciences",
      "year": 2025,
      "abstract": "We use crowd-sourced assessments from X’s Community Notes program to examine whether there are partisan differences in the sharing of misleading information. Unlike previous studies, misleadingness here is determined by agreement across a diverse community of platform users, rather than by fact-checkers. We find that 2.3 times more posts by Republicans are flagged as misleading compared to posts by Democrats. These results are not base rate artifacts, as we find no meaningful overrepresentation ...",
      "tags": [
        "Article",
        "Proc. Natl. Acad. Sci. U. S. A."
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Proceedings of the National Academy of Sciences",
      "type": "article"
    },
    {
      "id": "bibtex:Goel2025-iq",
      "title": "Using co-sharing to identify use of mainstream news for promoting potentially misleading narratives",
      "authors": [
        "Goel, Pranav",
        "Green, Jon",
        "Lazer, David",
        "Resnik, Philip S"
      ],
      "venue": "Nature Publishing Group",
      "year": 2025,
      "abstract": "Much of the research quantifying volume and spread of online misinformation measures the construct at the source level, identifying a set of specific unreliable domains that account for a relatively small share of news consumption. This source-level dichotomy obscures the potential for users to repurpose factually true information from reliable sources to advance misleading narratives. We demonstrate this potentially far more prevalent form of misinformation by identifying articles from reliable...",
      "tags": [
        "Article",
        "Nat. Hum. Behav."
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Nature Publishing Group",
      "type": "article"
    },
    {
      "id": "bibtex:Paci2025-ag",
      "title": "They want to pretend not to understand: The Limits of Current LLMs in Interpreting Implicit Content of Political Discourse",
      "authors": [
        "Paci, Walter",
        "Panunzi, Alessandro",
        "Pezzelle, Sandro"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Implicit content plays a crucial role in political discourse, where speakers systematically employ pragmatic strategies such as implicatures and presuppositions to influence their audiences. Large Language Models (LLMs) have demonstrated strong performance in tasks requiring complex semantic and pragmatic understanding, highlighting their potential for detecting and explaining the meaning of implicit content. However, their ability to do this within political discourse remains largely underexplo...",
      "tags": [
        "Article",
        "arXiv [cs.CL]"
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Kansaon2025-id",
      "title": "From fake news to real protests: WhatsApp’s role in Brazilian political coordination",
      "authors": [
        "Kansaon, Daniel",
        "Melo, Philipe de Freitas",
        "Zannettou, Savvas",
        "Benevenuto, Fabricio"
      ],
      "venue": "Association for the Advancement of Artificial Intelligence (AAAI)",
      "year": 2025,
      "abstract": "The growth of social networks has raised concerns about the misuse of these platforms by disinformation campaigns, social bots, and coordinated activities. Among these platforms, WhatsApp has become a focal point for this abuse, particularly in Brazil, one of the countries with the highest use of the platform. Despite acknowledging the presence of coordinated campaigns and implementing restrictions on the number of messages forwarded per user, the platform continues to be abused. Due to its priv...",
      "tags": [
        "Article",
        "Proceedings of the International AAAI Conference on Web and Social Media"
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Association for the Advancement of Artificial Intelligence (AAAI)",
      "type": "article"
    },
    {
      "id": "bibtex:Marwick2025-vx",
      "title": "True costs of misinformation| mountains of evidence: Processual “redpilling” as a Socio-technical effect of disinformation",
      "authors": [
        "Marwick, Alice E",
        "Furl, Katherine"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "How do people come to believe Far-Right, extremist, and conspiratorial ideas they encounter online? This article examines how participants in primarily U.S.-based Far-Right online communities describe their adoption of “redpill” beliefs and the role of disinformation in these accounts. Applying the socio-technical theory of media effects, we conduct a qualitative content analysis of “redpilling narratives” gathered from Reddit, Gab, and Discord. While many users frame redpilling as a moment of c...",
      "tags": [
        "redpill",
        "Far-Right",
        "Int. J. Commun.",
        "extremism",
        "Article",
        "disinformation",
        "evidence",
        "online radicalization"
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Ventura2025-sw",
      "title": "Misinformation beyond traditional feeds: Evidence from a WhatsApp deactivation experiment in Brazil",
      "authors": [
        "Ventura, Tiago",
        "Majumdar, Rajeshwari",
        "Nagler, Jonathan",
        "Tucker, Joshua"
      ],
      "venue": "University of Chicago Press",
      "year": 2025,
      "abstract": "Published in J. Polit. | Year: 2025 | Authors: Ventura, Tiago, Majumdar, Rajeshwari, Nagler, Jonathan, Tucker, Joshua",
      "tags": [
        "Article",
        "J. Polit."
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "University of Chicago Press",
      "type": "article"
    },
    {
      "id": "bibtex:Entrena-Serrano2025-gw",
      "title": "TikTok's Research API: Problems Without Explanations",
      "authors": [
        "Entrena-Serrano, Carlos",
        "Degeling, Martin",
        "Romano, Salvatore",
        "Çetin, Raziye Buse"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Following the Digital Services Act of 2023, which requires Very Large Online Platforms (VLOPs) and Very Large Online Search Engines (VLOSEs) to facilitate data accessibility for independent research, TikTok augmented its Research API access within Europe in July 2023. This action was intended to ensure compliance with the DSA, bolster transparency, and address systemic risks. Nonetheless, research findings reveal that despite this expansion, notable limitations and inconsistencies persist within...",
      "tags": [
        "Article",
        "arXiv [cs.CY]"
      ],
      "dateAdded": "2025-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Allcott2025-jb",
      "title": "The effects of political advertising on Facebook and Instagram before the 2020 US election",
      "authors": [
        "Allcott, Hunt",
        "Gentzkow, Matthew",
        "Levy, Ro'ee",
        "Crespo-Tenorio, Adriana",
        "Dumas, Natasha",
        "Mason, Winter",
        "Moehler, Devra",
        "Barbera, Pablo",
        "Brown, Taylor",
        "Cisneros, Juan Carlos",
        "Dimmery, Drew",
        "Freelon, Deen",
        "González-Bailón, Sandra",
        "Guess, Andrew",
        "Kim, Young Mie",
        "Lazer, David",
        "Malhotra, Neil",
        "Nair-Desai, Sameer",
        "Nyhan, Brendan",
        "de Queiroz, Ana Carolina Paixao",
        "Pan, Jennifer",
        "Settle, Jaime",
        "Thorson, Emily",
        "Tromble, Rebekah",
        "Rivera, Carlos Velasco",
        "Wittenbrink, Benjamin",
        "Wojcieszak, Magdalena",
        "Yang, Shiqi",
        "Zahedian, Saam",
        "Franco, Annie",
        "de Jonge, Chad Kiewiet",
        "Stroud, Natalie Jomini",
        "Tucker, Joshua"
      ],
      "venue": "National Bureau of Economic Research",
      "year": 2025,
      "abstract": "We study the effects of social media political advertising by randomizing subsets of 36,906 Facebook users and 25,925 Instagram users to have political ads removed from their news feeds for six weeks before the 2020 US presidential election. We show that most presidential ads were targeted toward parties’ own supporters and that fundraising ads were most common. On both Facebook and Instagram, we found no detectable effects of removing political ads on political knowledge, polarization, perceive...",
      "tags": [
        "Techreport"
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "National Bureau of Economic Research",
      "type": "techreport"
    },
    {
      "id": "bibtex:Luceri2025-tr",
      "title": "Coordinated inauthentic behavior on TikTok: Challenges and opportunities for detection in a video-first ecosystem",
      "authors": [
        "Luceri, Luca",
        "Salkar, Tanishq Vijay",
        "Balasubramanian, Ashwin",
        "Pinto, Gabriela",
        "Sun, Chenning",
        "Ferrara, Emilio"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Detecting coordinated inauthentic behavior (CIB) is central to the study of online influence operations. However, most methods focus on text-centric platforms, leaving video-first ecosystems like TikTok largely unexplored. To address this gap, we develop and evaluate a computational framework for detecting CIB on TikTok, leveraging a network-based approach adapted to the platform's unique content and interaction structures. Building on existing approaches, we construct user similarity networks b...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Gaisbauer2025-by",
      "title": "A political cartography of news sharing: Capturing story, outlet and content level of news circulation on Twitter",
      "authors": [
        "Gaisbauer, Felix",
        "Pournaki, Armin",
        "Ohme, Jakob"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "News sharing on digital platforms shapes the digital spaces millions of users navigate. Trace data from these platforms also enables researchers to study online news circulation. In this context, research on the types of news shared by users of differential political leaning has received considerable attention. We argue that most existing approaches (i) rely on an overly simplified measurement of political leaning, (ii) consider only the outlet level in their analyses, and/or (iii) study news ci...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Yang2025-iv",
      "title": "Coordinated link sharing on Facebook",
      "authors": [
        "Yang, Yunkang",
        "Paudel, Ramesh",
        "McShan, Jordan",
        "Hindman, Matthew",
        "Huang, H Howie",
        "Broniatowski, David"
      ],
      "venue": "Springer Science and Business Media LLC",
      "year": 2025,
      "abstract": "Malicious actors regularly attempt to manipulate social media using coordinated posting. Many existing methods for detecting this coordination, though, have relied primarily on post-timing, which is trivially easy to change. In this paper, we make a significant methodological advancement in coordination detection, leveraging highly regular statistical patterns in the speed and frequency of sharing. We apply and validate this approach on Facebook, using 11.2 million link posts from a list of 16,1...",
      "tags": [
        "Social media",
        "Coordination",
        "Article",
        "Facebook",
        "Sci. Rep."
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Springer Science and Business Media LLC",
      "type": "article"
    },
    {
      "id": "bibtex:Hartmann2025-px",
      "title": "A systematic review of echo chamber research: comparative analysis of conceptualizations, operationalizations, and varying outcomes",
      "authors": [
        "Hartmann, David",
        "Wang, Sonja Mei",
        "Pohlmann, Lena",
        "Berendt, Bettina"
      ],
      "venue": "Springer Science and Business Media LLC",
      "year": 2025,
      "abstract": "Abstract This systematic review synthesizes research on echo chambers and filter bubbles to explore the reasons behind dissent regarding their existence, antecedents, and effects. It provides a taxonomy of conceptualizations and operationalizations, analyzing how measurement approaches and contextual factors influence outcomes. The review of 129 studies identifies variations in measurement approaches, as well as regional, political, cultural, and platform-specific biases, as key factors contribu...",
      "tags": [
        "Article",
        "J. Comput. Soc. Sci."
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Springer Science and Business Media LLC",
      "type": "article"
    },
    {
      "id": "bibtex:Votta2025-xz",
      "title": "The cost of reach: Testing the role of ad delivery algorithms in online political campaigns",
      "authors": [
        "Votta, Fabio",
        "Dobber, Tom",
        "Guinaudeau, Benjamin",
        "Helberger, Natali",
        "de Vreese, Claes"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "Published in Polit. Commun. | Year: 2025 | Authors: Votta, Fabio, Dobber, Tom, Guinaudeau, Benjamin, Helberger, Natali, de Vreese, Claes",
      "tags": [
        "Article",
        "Polit. Commun."
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Di-Marco2025-aa",
      "title": "Post-hoc evaluation of nodes influence in information cascades: The case of coordinated accounts",
      "authors": [
        "Di Marco, Niccolò",
        "Brunetti, Sara",
        "Cinelli, Matteo",
        "Quattrociocchi, Walter"
      ],
      "venue": "Association for Computing Machinery (ACM)",
      "year": 2025,
      "abstract": "In the last few years, social media has gained an unprecedented amount of attention, playing a pivotal role in shaping the contemporary landscape of communication and connection. However, Coordinated inauthentic Behaviour (CIB), defined as orchestrated efforts by entities to deceive or mislead users about their identity and intentions, has emerged as a tactic to exploit the online discourse. In this study, we quantify the efficacy of CIB tactics by defining a general framework for evaluating the...",
      "tags": [
        "Article",
        "ACM Trans. Web"
      ],
      "dateAdded": "2025-05-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Association for Computing Machinery (ACM)",
      "type": "article"
    },
    {
      "id": "bibtex:Bruns2025-fz",
      "title": "Untangling the furball: A practice mapping approach to the analysis of multimodal interactions in social networks",
      "authors": [
        "Bruns, Axel",
        "Kasianenko, Kateryna",
        "Suresh, Vish Padinjaredath",
        "Dehghan, Ehsan",
        "Vodden, Laura"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "This article introduces the analytical approach of practice mapping , using vector embeddings of network actions and interactions to map commonalities and disjunctures in the practices of social media users, as a framework for methodological advancement beyond the limitations of conventional network analysis and visualization. In particular, the methodological framework we outline here has the potential to incorporate multiple distinct modes of interaction into a single practice map; can be furt...",
      "tags": [
        "Article",
        "Soc. Media Soc."
      ],
      "dateAdded": "2025-04-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Esau2025-tf",
      "title": "The quality of connections: Deliberative reciprocity and inclusive listening as antidote to destructive polarization online",
      "authors": [
        "Esau, Katharina"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "Conflict and disagreement are integral to healthy democracies, but the extreme polarization observed on many social media platforms poses a serious risk to the core functions of public communication. This theoretical article draws on the concept of connective democracy, further theorizing it to bridge the gap between empirical online deliberation and polarization research. It introduces and refines the concept of destructive polarization and its symptoms—manifested in user-generated content on s...",
      "tags": [
        "Article",
        "Soc. Media Soc."
      ],
      "dateAdded": "2025-04-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Gattermann2025-yx",
      "title": "The role of far-right party performance in shaping disinformation concerns of European voters: evidence from the 2024 European Parliament elections",
      "authors": [
        "Gattermann, Katjana",
        "van den Hoogen, Elske",
        "de Vreese, Claes"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "Published in J. Eur. Public Policy | Year: 2025 | Authors: Gattermann, Katjana, van den Hoogen, Elske, de Vreese, Claes",
      "tags": [
        "Article",
        "J. Eur. Public Policy"
      ],
      "dateAdded": "2025-04-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Bastos2025-ya",
      "title": "So long twitter, and thanks for all the tweets",
      "authors": [
        "Bastos, Marco T"
      ],
      "venue": "Routledge",
      "year": 2025,
      "abstract": "This chapter reviews the historical contribution of Twitter before it was rebranded as X in July 2023. Twitter was an open platform for social sciences research, particularly political communication, a source of social data so prevalent in the early 21st century that researchers referred to this scholarship as ‘Twitter studies.’ We revisit the many Application Programming Interfaces that Twitter offered to developers and researchers, including the REST, Search, Streaming, Academic, and Complianc...",
      "tags": [
        "Article",
        "SSRN Electron. J."
      ],
      "dateAdded": "2025-04-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Routledge",
      "type": "article"
    },
    {
      "id": "bibtex:Smith2025-kc",
      "title": "Emergent structures of attention on social media are driven by amplification and triad transitivity",
      "authors": [
        "Smith, Alyssa H",
        "Green, Jon",
        "F Welles, Brooke",
        "Lazer, David"
      ],
      "venue": "Oxford University Press (OUP)",
      "year": 2025,
      "abstract": "As they evolve, social networks tend to form transitive triads more often than random chance and structural constraints would suggest. However, the mechanisms by which triads in these networks become transitive are largely unexplored. We leverage a unique combination of data and methods to demonstrate a causal link between amplification and triad transitivity in a directed social network. Additionally, we develop the concept of the ``attention broker,'' an extension of the previously theorized t...",
      "tags": [
        "PNAS Nexus",
        "triad transitivity",
        "social media",
        "tertius iungens",
        "social networks",
        "amplification",
        "Article"
      ],
      "dateAdded": "2025-04-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Oxford University Press (OUP)",
      "type": "article"
    },
    {
      "id": "bibtex:Moran2025-qn",
      "title": "The end of trust and safety?: Examining the future of content moderation and upheavals in professional online safety efforts",
      "authors": [
        "Moran, Rachel Elizabeth",
        "Schafer, Joseph",
        "Bayar, Mert",
        "Starbird, Kate"
      ],
      "venue": "ACM",
      "year": 2025,
      "abstract": "Year: 2025 | Authors: Moran, Rachel Elizabeth, Schafer, Joseph, Bayar, Mert, Starbird, Kate",
      "tags": [
        "Inproceedings"
      ],
      "dateAdded": "2025-04-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "ACM",
      "type": "inproceedings"
    },
    {
      "id": "bibtex:Gaw2025-ru",
      "title": "Influence operations as brokerage: Political-economic infrastructures of manipulation in the 2022 Philippine elections",
      "authors": [
        "Gaw, Fatima",
        "Agonos, Mariam Jayne",
        "Ruijgrok, Kris",
        "Suarez, Gerard Martin"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "This study conceptualizes influence operations (IOs), an enterprise that orchestrates manipulative and inauthentic activities to achieve political advantage, as a contemporary form of brokerage during elections. It investigates the empirical case of IOs engaged in covert political campaigning in the 2022 Philippine General Elections through qualitative field research. Drawing from 22 in-depth interviews with IO leads and staff, we define IOs’ broker attributes, their brokerage processes, and the...",
      "tags": [
        "Philippines",
        "computational propaganda",
        "brokerage",
        "Int. J. Commun.",
        "Article",
        "disinformation",
        "influence operations",
        "trolls",
        "elections"
      ],
      "dateAdded": "2025-03-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Arora2025-tx",
      "title": "Multi-Modal Framing Analysis of News",
      "authors": [
        "Arora, Arnav",
        "Yadav, Srishti",
        "Antoniak, Maria",
        "Belongie, Serge",
        "Augenstein, Isabelle"
      ],
      "venue": "arXiv",
      "year": 2025,
      "abstract": "Automated frame analysis of political communication is a popular task in computational social science that is used to study how authors select aspects of a topic to frame its reception. So far, such studies have been narrow, in that they use a fixed set of pre-defined frames and focus only on the text, ignoring the visual contexts in which those texts appear. Especially for framing in the news, this leaves out valuable information about editorial choices, which include not just the written artic...",
      "tags": [
        "Machine Learning (cs.LG)",
        "arXiv [cs.CL]",
        "Computation and Language (cs.CL)",
        "FOS: Computer and information sciences",
        "Computers and Society (cs.CY)",
        "Misc"
      ],
      "dateAdded": "2025-03-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "arXiv",
      "type": "misc"
    },
    {
      "id": "bibtex:Humprecht2025-ml",
      "title": "Advancing the study of political misinformation across countries and platforms—introduction to the special issue",
      "authors": [
        "Humprecht, Edda",
        "Valenzuela, Sebastián",
        "Esser, Frank",
        "Tandoc, Edson"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "The global spread of political misinformation poses serious challenges to democracies, eroding trust and distorting public discourse. However, research has largely focused on WEIRD countries—Western, Educated, Industrialized, Rich, and Democratic—limiting our understanding of how misinformation operates across diverse political, cultural, and technological contexts. This special issue addresses these gaps through comparative, cross-platform, and interdisciplinary perspectives. The articles explo...",
      "tags": [
        "Article",
        "Int. J. Press Polit."
      ],
      "dateAdded": "2025-03-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Bennett2025-xs",
      "title": "Platforms, politics, and the crisis of democracy: Connective action and the rise of illiberalism",
      "authors": [
        "Bennett, W Lance",
        "Livingston, Steven"
      ],
      "venue": "Cambridge University Press (CUP)",
      "year": 2025,
      "abstract": "Democratic backsliding, the slow erosion of institutions, processes, and norms, has become more pronounced in many nations. Most scholars point to the role of parties, leaders, and institutional changes, along with the pursuit of voters through what Daniel Ziblatt has characterized as alliances with more extremist party surrogate organizations. Although insightful, the institutionalist literature offers little reflection about the growing role of social technologies in organizing and mobilizing ...",
      "tags": [
        "Article",
        "Perspect. Politics"
      ],
      "dateAdded": "2025-03-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Cambridge University Press (CUP)",
      "type": "article"
    },
    {
      "id": "bibtex:Brown2025-jk",
      "title": "Evaluating how LLM annotations represent diverse views on contentious topics",
      "authors": [
        "Brown, Megan A",
        "Atreja, Shubham",
        "Hemphill, Libby",
        "Wu, Patrick Y"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Researchers have proposed the use of generative large language models (LLMs) to label data for research and applied settings. This literature emphasizes the improved performance of these models relative to other natural language models, noting that generative LLMs typically outperform other models and even humans across several metrics. Previous literature has examined bias across many applications and contexts, but less work has focused specifically on bias in generative LLMs' responses to subj...",
      "tags": [
        "Article",
        "arXiv [cs.CL]"
      ],
      "dateAdded": "2025-03-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Pante2025-pq",
      "title": "Beyond interaction patterns: Assessing claims of coordinated inter-state information operations on twitter/X",
      "authors": [
        "Pantè, Valeria",
        "Axelrod, David",
        "Flammini, Alessandro",
        "Menczer, Filippo",
        "Ferrara, Emilio",
        "Luceri, Luca"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Social media platforms have become key tools for coordinated influence operations, enabling state actors to manipulate public opinion through strategic, collective actions. While previous research has suggested collaboration between states, such research failed to leverage state-of-the-art coordination indicators or control datasets. In this study, we investigate inter-state coordination by analyzing multiple online behavioral traces and using sophisticated coordination detection models. By inco...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2025-02-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Hurcombe2025-cs",
      "title": "The discursive function of Meta’s Newsroom: How Meta frames the problem of problematic online content",
      "authors": [
        "Hurcombe, Edward",
        "Dehghan, Ehsan",
        "Vodden, Laura",
        "Angus, Daniel"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "This article examines the social technology company Meta’s public communication on problematic content, via their official ‘Meta Newsroom’, within the context of growing regulatory scrutiny. For nearly a decade, the Meta Newsroom has been a major outlet for Meta company announcements, and since 2016, the Newsroom has increasingly become a key source for company responses to concerns regarding mis/disinformation and other kinds of problematic content on Meta’s platforms. Using a mixed-methods app...",
      "tags": [
        "Article",
        "Converg. Int. J. Res. New Media Technol."
      ],
      "dateAdded": "2025-02-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Bastos2025-ol",
      "title": "Visual identities in troll farms: The Twitter Moderation Research Consortium",
      "authors": [
        "Bastos, Marco"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "The Twitter Moderation Research Consortium is a database of network propaganda and influence operations that includes 115,474 unique Twitter accounts, millions of tweets, and over one terabyte of media removed from the platform between 2017 and 2022. We probe this database using Google’s Vision API and Keras with TensorFlow to test whether foreign influence operations can be identified based on the visual presentation of fake user profiles emphasizing gender, race, camera angle, sensuality, and ...",
      "tags": [
        "Article",
        "Soc. Media Soc."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Sarmiento2025-as",
      "title": "Unsupervised framing analysis for social media discourse in polarizing events",
      "authors": [
        "Sarmiento, Hernan",
        "Córdova, Ricardo",
        "Ortiz, Jorge",
        "Bravo-Marquez, Felipe",
        "Santos, Marcelo",
        "Valenzuela, Sebastián"
      ],
      "venue": "Association for Computing Machinery (ACM)",
      "year": 2025,
      "abstract": "This study investigates the concept of frames in the realm of online polarization, with a focus on social media platforms. The research extends the understanding of how frames—emerging, complex, and often subtle concepts—become prominent in online conversations that are polarized. The study proposes a comprehensive methodology for identifying and characterizing these frames, integrating machine learning techniques, network analysis algorithms, and natural language processing tools. This method a...",
      "tags": [
        "Article",
        "ACM Trans. Web"
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Association for Computing Machinery (ACM)",
      "type": "article"
    },
    {
      "id": "bibtex:Graham2025-gp",
      "title": "How propaganda exploits the infrastructure of truth: A case study of \\#IStandWithPutin",
      "authors": [
        "Graham, Timothy"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "Published in Crit. Stud. Media Commun. | Year: 2025 | Authors: Graham, Timothy",
      "tags": [
        "Article",
        "Crit. Stud. Media Commun."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Xue2025-bp",
      "title": "Facts or feelings? Leveraging emotionality as a fact-checking strategy on social media in the United States",
      "authors": [
        "Xue, Haoning",
        "Zhang, Jingwen",
        "Zhang, Xinzhi"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "Emotionality is a well-established strategy for boosting audience engagement on social media. While fact-checking is positioned to provide objective information, fact-checking posts on social media often involve heightened emotionality. How much emotionality is present and how emotionality influences audience engagement and public sentiment toward fact-checked targets remain largely understudied. Informed by social psychological frameworks explicating message-level factors influencing public eng...",
      "tags": [
        "Article",
        "Soc. Media Soc."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Luhring2025-od",
      "title": "Best practices for source-based research on misinformation and news trustworthiness using NewsGuard",
      "authors": [
        "Lühring, Jula",
        "Metzler, Hannah",
        "Lazzaroni, Ruggero",
        "Shetty, Apeksha",
        "Lasser, Jana"
      ],
      "venue": "Journal of Quantitative Description: Digital Media",
      "year": 2025,
      "abstract": "Researchers need reliable and valid tools to identify cases of untrustworthy information when studying the spread of misinformation on digital platforms. A common approach is to assess the trustworthiness of sources rather than individual pieces of content. One of the most widely used and comprehensive databases for source trustworthiness ratings is provided by NewsGuard. Since creating the database in 2019, NewsGuard has continually added new sources and reassessed existing ones. While NewsGuar...",
      "tags": [
        "Article",
        "J. Quant. Descr. Digit. Media"
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Journal of Quantitative Description: Digital Media",
      "type": "article"
    },
    {
      "id": "bibtex:Simeone2025-vo",
      "title": "Network ripple effects: How Twitter deplatforming flipped authority structure and discourse of the Arizona Election Review community",
      "authors": [
        "Simeone, Michael",
        "Corman, Steven R"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "Content moderation decisions can have variable impacts on the events and discourses they aim to regulate. This study analyzes Twitter data from before and after the removal of key Arizona Election Audit Twitter accounts in March of 2021. After collecting tweets that refer to the election audit in Arizona in this designated timeframe, a before/after comparison examines the structure of the networks, the volume of the participating population, and the themes of their discourse. Several significant...",
      "tags": [
        "Article",
        "SAGE Open"
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Le-Mens2025-qz",
      "title": "Positioning political texts with large language models by asking and averaging",
      "authors": [
        "Le Mens, Gaël",
        "Gallego, Aina"
      ],
      "venue": "Cambridge University Press (CUP)",
      "year": 2025,
      "abstract": "Abstract We use instruction-tuned large language models (LLMs) like GPT-4, Llama 3, MiXtral, or Aya to position political texts within policy and ideological spaces. We ask an LLM where a tweet or a sentence of a political text stands on the focal dimension and take the average of the LLM responses to position political actors such as US Senators, or longer texts such as UK party manifestos or EU policy speeches given in 10 different languages. The correlations between the position estimates obt...",
      "tags": [
        "Article",
        "Polit. Anal."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Cambridge University Press (CUP)",
      "type": "article"
    },
    {
      "id": "bibtex:DiGiuseppe2025-es",
      "title": "Scaling open-ended survey responses using LLM-paired comparisons",
      "authors": [
        "DiGiuseppe, Matthew",
        "Flynn, Michael E"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Survey researchers rely heavily on closed-ended questions to measure latent respondent characteristics like knowledge, policy positions, emotions, ideology, and various other traits. While closed-ended questions ease analysis and data collection, they necessarily limit the depth and variability of responses. Open-ended responses allow for greater depth and variability in responses but are labor-intensive to code. Large Language Models (LLMs) can solve some of these problems, but existing approac...",
      "tags": [
        "Article",
        "SocArXiv"
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Nenno2025-xa",
      "title": "All the (fake) news that’s fit to share? News values in perceived misinformation across twenty-four countries",
      "authors": [
        "Nenno, Sami",
        "Puschmann, Cornelius"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "While there is a strong scholarly interest surrounding the content of political misinformation online, much of this research concerns misinformation in Western, Educated, Industrialized, Rich and Democratic (WEIRD) countries. Although such research has investigated the topical and stylistic characteristics of misinformation, its findings are frequently not interpreted systematically in relation to properties that journalists rely on to capture the attention of audiences, that is, in relation to ...",
      "tags": [
        "Article",
        "Int. J. Press Polit."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Green2025-ap",
      "title": "Curation bubbles",
      "authors": [
        "Green, Jon",
        "Mccabe, Stefan",
        "Shugars, Sarah",
        "Chwe, Hanyu",
        "Horgan, Luke",
        "Cao, Shuyang",
        "Lazer, David"
      ],
      "venue": "Cambridge University Press (CUP)",
      "year": 2025,
      "abstract": "Information on social media is characterized by networked curation processes in which users select other users from whom to receive information, and those users in turn share information that promotes their identities and interests. We argue this allows for partisan “curation bubbles” of users who share and consume content with consistent appeal drawn from a variety of sources. Yet, research concerning the extent of filter bubbles, echo chambers, or other forms of politically segregated informat...",
      "tags": [
        "Article",
        "Am. Polit. Sci. Rev."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Cambridge University Press (CUP)",
      "type": "article"
    },
    {
      "id": "bibtex:Tornberg2025-ir",
      "title": "When do parties lie? Misinformation and radical-right populism across 26 countries",
      "authors": [
        "Törnberg, Petter",
        "Chueri, Juliana"
      ],
      "venue": "SAGE Publications",
      "year": 2025,
      "abstract": "The spread of misinformation has emerged as a global concern. Academic attention has recently shifted to emphasize the role of political elites as drivers of misinformation. Yet, little is known of the relationship between party politics and the spread of misinformation—in part due to a dearth of cross-national empirical data needed for comparative study. This article examines which parties are more likely to spread misinformation, by drawing on a comprehensive database of 32M tweets from parlia...",
      "tags": [
        "Article",
        "Int. J. Press Polit."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:McNally2025-dn",
      "title": "The news feed is not a black box: A longitudinal study of Facebook’s algorithmic treatment of news",
      "authors": [
        "McNally, Naoise",
        "Bastos, Marco"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "This study examines the effects of a series of significant algorithm changes within Facebook’s News Feed on user engagement with news content on the platform between 2011-2020. By tracking public announcements, industry research, and leaks to the press, we constructed a timeline of algorithm changes and collected data on 1 million news articles from The Guardian over the 10-year period, alongside their associated Facebook engagement metrics (likes, comments, shares, etc.) using the CrowdTangle A...",
      "tags": [
        "Article",
        "Digit. Journal."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Munger2025-cz",
      "title": "What did we learn about political communication from the Meta2020 partnership?",
      "authors": [
        "Munger, Kevin"
      ],
      "venue": "Informa UK Limited",
      "year": 2025,
      "abstract": "Published in Polit. Commun. | Year: 2025 | Authors: Munger, Kevin",
      "tags": [
        "Article",
        "Polit. Commun."
      ],
      "dateAdded": "2025-01-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Informa UK Limited",
      "type": "article"
    },
    {
      "id": "bibtex:Unknown2025-qj",
      "title": "Red-Teaming in the Public Interest",
      "authors": [],
      "venue": null,
      "year": 2025,
      "abstract": "This report offers a vision for red-teaming in the public interest: a process that goes beyond system-centric testing of already built systems to consider the full range of ways the public can be involved in evaluating genAI harms.",
      "tags": [
        "Techreport"
      ],
      "dateAdded": "2025-01-01T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "techreport"
    },
    {
      "id": "bibtex:Kristensen2025-ni",
      "title": "Platform polarization. Do alternative platforms drive discursive polarization?",
      "authors": [
        "Kristensen, Jakob Bæk",
        "Kristensen, Jakob Bæk"
      ],
      "venue": null,
      "year": 2025,
      "abstract": "Published in Comun. Politica | Year: 2025 | Authors: Kristensen, Jakob Bæk, Kristensen, Jakob Bæk",
      "tags": [
        "Article",
        "Comun. Politica"
      ],
      "dateAdded": "2025-01-01T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Minici2024-tf",
      "title": "IOHunter: Graph foundation model to uncover online information operations",
      "authors": [
        "Minici, Marco",
        "Luceri, Luca",
        "Fabbri, Francesco",
        "Ferrara, Emilio"
      ],
      "venue": null,
      "year": 2024,
      "abstract": "Social media platforms have become vital spaces for public discourse, serving as modern agoràs where a wide range of voices influence societal narratives. However, their open nature also makes them vulnerable to exploitation by malicious actors, including state-sponsored entities, who can conduct information operations (IOs) to manipulate public opinion. The spread of misinformation, false news, and misleading claims threatens democratic processes and societal cohesion, making it crucial to deve...",
      "tags": [
        "Article",
        "arXiv [cs.SI]"
      ],
      "dateAdded": "2024-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Gonzalez-Bailon2024-rq",
      "title": "The diffusion and reach of (mis)information on Facebook during the U.s. 2020 election",
      "authors": [
        "González-Bailón, Sandra",
        "Lazer, David",
        "Barberá, Pablo",
        "Godel, William",
        "Allcott, Hunt",
        "Brown, Taylor",
        "Crespo-Tenorio, Adriana",
        "Freelon, Deen",
        "Gentzkow, Matthew",
        "Guess, Andrew",
        "Iyengar, Shanto",
        "Kim, Young",
        "Malhotra, Neil",
        "Moehler, Devra",
        "Nyhan, Brendan",
        "Pan, Jennifer",
        "Rivera, Carlos",
        "Settle, Jaime",
        "Thorson, Emily",
        "Tromble, Rebekah",
        "Wilkins, Arjun",
        "Wojcieszak, Magdalena",
        "Kiewiet de Jonge, Chad",
        "Franco, Annie",
        "Mason, Winter",
        "Stroud, Natalie",
        "Tucker, Joshua"
      ],
      "venue": "Society for Sociological Science",
      "year": 2024,
      "abstract": "Social media creates the possibility for rapid, viral spread of content, but how many posts actually reach millions? And is misinformation special in how it propagates? We answer these questions by analyzing the virality of and exposure to information on Facebook during the U.S. 2020 presidential election. We examine the diffusion trees of the approximately 1 B posts that were re-shared at least once by U.S.-based adults from July 1, 2020, to February 1, 2021. We differentiate misinformation fro...",
      "tags": [
        "Article",
        "Sociol. Sci."
      ],
      "dateAdded": "2024-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Society for Sociological Science",
      "type": "article"
    },
    {
      "id": "bibtex:Mosleh2024-op",
      "title": "Divergent patterns of engagement with partisan and low-quality news across seven social media platforms",
      "authors": [
        "Mosleh, Mohsen",
        "Allen, Jennifer Nancy Lee",
        "Rand, David Gertler"
      ],
      "venue": null,
      "year": 2024,
      "abstract": "In recent years, social media has become increasingly fragmented, as platforms evolve and new alternatives emerge. Yet most research studies a single platform—typically Twitter/X, or occasionally Facebook—leaving little known about the broader social media landscape. Here we shed new light on patterns of cross-platform variation in the high-stakes context of news sharing. We examine the relationship between user engagement and news domains’ political orientation and quality across seven platform...",
      "tags": [
        "Article",
        "PsyArXiv"
      ],
      "dateAdded": "2024-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Cabbuag2024-me",
      "title": "TikTok ‘dogshows’ and the amplification of online incivility among Gen Z influencers in the Philippines",
      "authors": [
        "Cabbuag, Samuel I",
        "Abidin, Crystal"
      ],
      "venue": "SAGE Publications",
      "year": 2024,
      "abstract": "Studies on digital platforms and online incivility have established that uses of humour can lean towards cyberbullying and hate speech. Focusing on TikTok's affordances and cultures of online incivility, this paper studies how TikTok influencers and their audiences manoeuvre legal-but-harmful humour. Specifically, we study how online incivility has become an accepted and negotiated practice in the Filipino context through the phenomenon of ‘dogshows’, where users throw jabs at individuals using ...",
      "tags": [
        "Article",
        "Int. J. Cult. Stud."
      ],
      "dateAdded": "2024-12-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Gagrcin2024-dl",
      "title": "Algorithmic media use and algorithm literacy: An integrative literature review",
      "authors": [
        "Gagrčin, Emilija",
        "Naab, Teresa K",
        "Grub, Maria F"
      ],
      "venue": "SAGE Publications",
      "year": 2024,
      "abstract": "Algorithms profoundly shape user experiences on digital platforms, raising concerns about their negative impacts and highlighting the importance of algorithm literacy. Research on individuals’ understanding of algorithms and their effects is expanding rapidly but lacks a cohesive framework. We conducted a systematic integrative literature review across social sciences and humanities (n = 169), addressing algorithm literacy in terms of its key conceptualizations and the endogenous, exogenous, and...",
      "tags": [
        "Article",
        "New Media Soc."
      ],
      "dateAdded": "2024-11-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Ulloa2024-jm",
      "title": "Beyond time delays: How web scraping distorts measures of online news consumption",
      "authors": [
        "Ulloa, Roberto",
        "Mangold, Frank",
        "Schmidt, Felix",
        "Gilsbach, Judith",
        "Stier, Sebastian"
      ],
      "venue": null,
      "year": 2024,
      "abstract": "As the exploration of digital behavioral data revolutionizes communication research, understanding the nuances of data collection methodologies becomes increasingly pertinent. This study focuses on one prominent data collection approach, web scraping, and more specifically, its application in the growing field of research relying on web browsing data. We investigate discrepancies between content obtained directly during user interaction with a website (in-situ) and content scraped using the URLs...",
      "tags": [
        "Article",
        "arXiv [cs.CY]"
      ],
      "dateAdded": "2024-11-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "article"
    },
    {
      "id": "bibtex:Bosch2024-hj",
      "title": "The sound of disinformation: TikTok, computational propaganda, and the invasion of Ukraine",
      "authors": [
        "Bösch, Marcus",
        "Divon, Tom"
      ],
      "venue": "SAGE Publications",
      "year": 2024,
      "abstract": "TikTok has emerged as a powerful platform for the dissemination of mis- and disinformation about the war in Ukraine. During the initial three months after the Russian invasion in February 2022, videos under the hashtag \\#Ukraine garnered 36.9 billion views, with individual videos scaling up to 88 million views. Beyond the traditional methods of spreading misleading information through images and text, the medium of sound has emerged as a novel, platform-specific audiovisual technique. Our analys...",
      "tags": [
        "Article",
        "New Media Soc."
      ],
      "dateAdded": "2024-09-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "SAGE Publications",
      "type": "article"
    },
    {
      "id": "bibtex:Costello2024-kp",
      "title": "Durably reducing conspiracy beliefs through dialogues with AI",
      "authors": [
        "Costello, Thomas H",
        "Pennycook, Gordon",
        "Rand, David G"
      ],
      "venue": "American Association for the Advancement of Science (AAAS)",
      "year": 2024,
      "abstract": "Conspiracy theory beliefs are notoriously persistent. Influential hypotheses propose that they fulfill important psychological needs, thus resisting counterevidence. Yet previous failures in correcting conspiracy beliefs may be due to counterevidence being insufficiently compelling and tailored. To evaluate this possibility, we leveraged developments in generative artificial intelligence and engaged 2190 conspiracy believers in personalized evidence-based dialogues with GPT-4 Turbo. The interven...",
      "tags": [
        "Article",
        "Science"
      ],
      "dateAdded": "2024-09-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "American Association for the Advancement of Science (AAAS)",
      "type": "article"
    },
    {
      "id": "bibtex:Budak2024-ef",
      "title": "Misunderstanding the harms of online misinformation",
      "authors": [
        "Budak, Ceren",
        "Nyhan, Brendan",
        "Rothschild, David M",
        "Thorson, Emily",
        "Watts, Duncan J"
      ],
      "venue": "Springer Science and Business Media LLC",
      "year": 2024,
      "abstract": "The controversy over online misinformation and social media has opened a gap between public discourse and scientific research. Public intellectuals and journalists frequently make sweeping claims about the effects of exposure to false content online that are inconsistent with much of the current empirical evidence. Here we identify three common misperceptions: that average exposure to problematic content is high, that algorithms are largely responsible for this exposure and that social media is ...",
      "tags": [
        "Article",
        "Nature"
      ],
      "dateAdded": "2024-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Springer Science and Business Media LLC",
      "type": "article"
    },
    {
      "id": "bibtex:Lai2024-to",
      "title": "Estimating the ideology of political YouTube videos",
      "authors": [
        "Lai, Angela",
        "Brown, Megan A",
        "Bisbee, James",
        "Tucker, Joshua A",
        "Nagler, Jonathan",
        "Bonneau, Richard"
      ],
      "venue": "Cambridge University Press (CUP)",
      "year": 2024,
      "abstract": "Abstract We present a method for estimating the ideology of political YouTube videos. The subfield of estimating ideology as a latent variable has often focused on traditional actors such as legislators, while more recent work has used social media data to estimate the ideology of ordinary users, political elites, and media sources. We build on this work to estimate the ideology of a political YouTube video. First, we start with a matrix of political Reddit posts linking to YouTube videos and ap...",
      "tags": [
        "Article",
        "Polit. Anal."
      ],
      "dateAdded": "2024-02-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "Cambridge University Press (CUP)",
      "type": "article"
    },
    {
      "id": "bibtex:Bakshy2015-rn",
      "title": "Political science. Exposure to ideologically diverse news and opinion on Facebook",
      "authors": [
        "Bakshy, Eytan",
        "Messing, Solomon",
        "Adamic, Lada A"
      ],
      "venue": "American Association for the Advancement of Science (AAAS)",
      "year": 2015,
      "abstract": "Exposure to news, opinion, and civic information increasingly occurs through social media. How do these online networks influence exposure to perspectives that cut across ideological lines? Using deidentified data, we examined how 10.1 million U.S. Facebook users interact with socially shared news. We directly measured ideological homophily in friend networks and examined the extent to which heterogeneous friends could potentially expose individuals to cross-cutting content. We then quantified t...",
      "tags": [
        "Science",
        "facebook",
        "news",
        "Article",
        "newsfeed",
        "homophily"
      ],
      "dateAdded": "2015-06-15T00:00:00Z",
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "publisher": "American Association for the Advancement of Science (AAAS)",
      "type": "article"
    },
    {
      "id": "bibtex:noauthor_undated-bz",
      "title": "Untitled",
      "authors": [],
      "venue": null,
      "year": null,
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S2468696425000424",
      "abstract": null,
      "tags": [
        "Misc"
      ],
      "dateAdded": null,
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "misc"
    },
    {
      "id": "bibtex:noauthor_undated-zb",
      "title": "Untitled",
      "authors": [],
      "venue": null,
      "year": null,
      "url": "https://academic.oup.com/pnasnexus/article/4/11/pgaf325/8285733",
      "abstract": null,
      "tags": [
        "Misc"
      ],
      "dateAdded": null,
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "misc"
    },
    {
      "id": "bibtex:noauthor_undated-ue",
      "title": "Untitled",
      "authors": [],
      "venue": null,
      "year": null,
      "url": "https://datasociety.net/library/scam-gpt/",
      "abstract": null,
      "tags": [
        "Misc"
      ],
      "dateAdded": null,
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "misc"
    },
    {
      "id": "bibtex:noauthor_undated-qm",
      "title": "Large language models for data annotation: A survey",
      "authors": [],
      "venue": null,
      "year": null,
      "url": "https://share.google/aHRz5TZgI9RVsnDT7",
      "abstract": null,
      "tags": [
        "Misc"
      ],
      "dateAdded": null,
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "misc"
    },
    {
      "id": "bibtex:noauthor_undated-fm",
      "title": "Volume 7 issue 2 article 4",
      "authors": [],
      "venue": null,
      "year": null,
      "url": "https://www.joctec.net/all-issues/volume-7/volume-7-issue-2/volume-7-issue-2-article-4",
      "abstract": "The Journal of Communication Technology (JoCTEC) is an official journal of the Communication Technology division of the Association for Education in Journalism and Mass Communication (AEJMC). ***This is the official journal site. The older site (joctec.org) is no longer updated. ***",
      "tags": [
        "Misc"
      ],
      "dateAdded": null,
      "status": "to-read",
      "citationCount": 0,
      "referenceCount": 0,
      "type": "misc"
    }
  ],
  "metadata": {
    "totalPapers": 86,
    "toRead": 86,
    "inProgress": 0,
    "completed": 0,
    "feedInfo": {
      "title": "To Read - Research Papers",
      "description": "Academic papers from Paperpile enriched with metadata"
    }
  },
  "lastUpdated": "2025-12-08T06:33:19.844Z",
  "source": "https://github.com/fabiogiglietto/toread"
}