[
  {
    "title": "Meet the speakers! - EUDTP 2025 - EuroTech Universities Alliance",
    "snippet": "Fabio Giglietto is listed as a Professor of Internet Studies at University of Urbino Carlo Bo and a speaker at the EUDTP 2025 conference in Brussels. His research on disinformation dynamics and media manipulation is highlighted, noting his work provides insights into identifying and countering harmful information operations. He will be speaking about implementation challenges and opportunities under DSA",
    "url": "https://eurotech-universities.eu/news-and-events/news/eudtp-digital-technologies-and-policy-conference-2025-meet-the-speakers/",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This webpage announces Fabio Giglietto as a speaker at the EUDTP 2025 conference, highlighting his expertise in disinformation dynamics and media manipulation and his upcoming talk on implementation challenges under the DSA.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Reports on Fabio Giglietto's participation in two conferences in Brazil in October 2025, where he presented research on using large language models to analyze political discourse in hyperpartisan Facebook groups. He also moderated a roundtable discussion on data access in the DSA era.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Reports on Fabio Giglietto's participation in two conferences in Brazil in October 2025, where he presented research on using large language models to analyze political discourse in hyperpartisan Facebook groups and moderated a roundtable discussion on data access.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Mapping Italian News Research Program - Uniurb",
    "snippet": "This page from the University of Urbino website mentions Fabio Giglietto as part of the Mapping Italian News Research Program. It highlights a white paper co-authored by him and Massimo Terenzi on the DSA and data access, and also mentions his role in the vera.ai project.",
    "url": "https://mine.uniurb.it/news",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page from the University of Urbino details Fabio Giglietto's involvement in the Mapping Italian News Research Program, highlighting his work on the DSA and data access, and his role in the vera.ai project. The content aligns with his expertise in social media research and disinformation studies.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA | AoIR Selected Papers of Internet Research",
    "snippet": "Fabio Giglietto co-authored a study investigating the dynamics of misinformation campaigns on Facebook in Brazil, focusing on the period from the 2022 elections to the aftermath of the attempted coup on January 8, 2023.",
    "url": "https://spir.aoir.org/ojs/index.php/spir/article/view/13999",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The selected paper from AoIR discusses a study co-authored by Fabio Giglietto that investigates the dynamics of political information campaigns on Facebook in Brazil, specifically focusing on the period surrounding the 2022 elections and the January 8, 2023, attempted coup.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017",
    "snippet": "This ResearchGate entry (dated 2025-08-07) references Giglietto's work on coordinated disinformation since 2017, noting a network including Pages known for spreading harmful false stories since 2017, referencing Giglietto et al., 2021. It also mentions coordinated link-sharing behavior (CLSB) before the 2018 and 2019 Italian elections, a topic he has researched extensively.",
    "url": "https://www.researchgate.net/publication/349059207_Coordinated_Hateful_Disinformation_on_Italian_Politics_and_Social_Issues_since_2017",
    "date": "2025-12-30",
    "source": "researchgate.net",
    "description": "This ResearchGate entry references Fabio Giglietto's work on coordinated disinformation campaigns since 2017. It discusses research related to coordinated link-sharing behavior before the 2018 and 2019 Italian elections, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  }
]