[
  {
    "title": "SICSS-Bologna - Summer Institute in Computational Social Science",
    "snippet": "Fabio Giglietto is listed as an Associate Professor at the University of Urbino Carlo Bo. His research focuses on the interplay between digital media and societal transformations, particularly on how digital platforms influence public opinion and democratic processes. He is described as a prominent figure in Internet Studies, known for his innovative use of advanced methodologies to study political communication on social media platforms.",
    "url": "https://sicss.io/2024/bologna/people",
    "date": "2026-01-17",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as an Associate Professor at the University of Urbino Carlo Bo at the Summer Institute in Computational Social Science (SICSS) Bologna, highlighting his expertise in digital media, public opinion, and democratic processes.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA | AoIR Selected Papers of Internet Research",
    "snippet": "A study co-authored by Fabio Giglietto investigates the dynamics of misinformation campaigns on Facebook in Brazil, from the 2022 elections to the aftermath of the attempted coup. It reveals a bipartisan battlefield of political discourse and divergence in accounts' political alignment.",
    "url": "https://spir.aoir.org/ojs/index.php/spir/article/view/13999",
    "date": "2026-01-17",
    "source": "vertexaisearch.cloud.google.com",
    "description": "A study co-authored by Fabio Giglietto investigates misinformation campaigns on Facebook in Brazil following the 2022 elections, examining the dynamics of political discourse.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Mapping Italian News Research Program - Uniurb",
    "snippet": "Mentions a white paper titled \"The State of Social Media Research APIs & Tools in the Digital Services Act Era,\" co-authored by Fabio Giglietto and Massimo Terenzi from the University of Urbino Carlo Bo, which explores how the Digital Services Act (DSA) is transforming data access for platform research.",
    "url": "https://mine.uniurb.it/news",
    "date": "2026-01-17",
    "source": "uniurb.it",
    "description": "This Uniurb webpage highlights a white paper co-authored by Fabio Giglietto and Massimo Terenzi regarding the impact of the Digital Services Act (DSA) on data access for platform research, demonstrating his ongoing contributions to social media research.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Facebook, troppa visibilità a estremisti e complottisti: ecco come impatta Meta sulle elezioni",
    "snippet": "A study by Professor Fabio Giglietto analyzed over 2.5 million posts on the platform between 2021 and 2025 and found that Meta's algorithmic choices in distributing political content favored extremist and anti-European Union voices while penalizing institutional politics.",
    "url": "https://www.ansa.it/amp/pressrelease/sardegna/2026/01/09/facebook-troppa-visibilita-a-estremisti-e-complottisti-ecco-come-impatta-meta-sulle-elezioni_2432ca84-2d59-41c5-bd7a-9556c09c9f1a.html",
    "date": "2026-01-09",
    "source": "ansa.it",
    "description": "The press release discusses a study by Professor Fabio Giglietto analyzing over 2.5 million Facebook posts to determine Meta's impact on elections, specifically focusing on the amplification of extremist and anti-EU voices.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Il Premio Rimini Mundi a sette ambasciatori del congressuale - lapiazzarimini.it",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSXlscW55aHBKdlR2VVZrX2kyRXVWZnVKNWFHZllpb1VOdVNOMVRKdFdJeUR2eWNCN3QtWXFzOTFIZngxcFUyV1NwXy1WYjdNa0RvbDBEUFpSeG96ME81dXl0UmxHaC1NYkFsMER0MENWbzlvS2JoYWNuSW1WRkxoM21xR3I4SHNuWnhYWXhLVXBCT1c4OFdV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-11-30",
    "source": "lapiazzarimini.it",
    "description": "News article from lapiazzarimini.it",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Il movimento religioso cinese che si è infiltrato in un gruppo Facebook urbinate - il Ducato",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRlVLVTNqUkVuTUkzZ3p2N1BQZHhmQWhQR3czSk9vQjAzYk93STZnT0w3WTJyeG1vcEJtQW5QS3o3R0ROM0hBOUNkZGc0SGNpbTQ2SVhtQ3BhMnl1MTFVR1dOVUVYajRPMXFvRzJUNm5hdFFNbWpyaHFGdkdlMFM5blQ4Y2Q2VkxjR19WUkY4SFgxeDdGRFdSX0VOckxZbzRnUEsySTU1MlJLOS1iSWc0aW9GeF9aSEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2024-12-17",
    "source": "il Ducato",
    "description": "News article from il Ducato",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "The persistence and resilience of misinformation in the face of fact checking - Vera.ai",
    "snippet": "Reports on a project by vera.ai, entitled “The Persistence and Resilience of Misinformation in the Face of Fact Checking”, was facilitated by Fabio Giglietto and Massimo Terenzi (University of Urbino Carlo Bo) and Richard Rogers (University of Amsterdam) at the Digital Media Initiative (DMI) Winter School at the University of Amsterdam. ",
    "url": "https://www.veraai.eu/posts/the-persistence-and-resilience-of-misinformation-in-the-face-of-fact-checking",
    "date": "2024-01-12",
    "source": "vera.ai",
    "description": "This vera.ai report mentions Fabio Giglietto's facilitation of a Winter School project at the University of Amsterdam, focused on the persistence of misinformation. The project aligns with his expertise in disinformation studies and social media research.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Who is behind vera.ai? Meet the people and teams that make up the vera.ai project. #8 Team of University of Urbino Carlo Bo",
    "snippet": "This article is structured as an interview with Fabio Giglietto and his team at the University of Urbino Carlo Bo, who are involved in the vera.ai project. He discusses the challenges and trends in disinformation analysis, including the threat of LLMs generating customized problematic content, and the importance of collaborative efforts to counter disinformation. He also expresses concern about the potential for a dystopian future where information is controlled and freedom of speech is limited.",
    "url": "https://www.veraai.eu/posts/who-is-behind-veraai-uniurb",
    "date": "2023-05-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article features an interview with Fabio Giglietto and his team at the University of Urbino Carlo Bo about their involvement in the vera.ai project, discussing challenges and trends in disinformation analysis and concerns about the future of information control.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  }
]