[
  {
    "title": "White Paper: The State of Social Media Research APIs & Tool in the DSA Era",
    "snippet": "Fabio Giglietto co-authored a white paper with Massimo Terenzi on how the Digital Services Act (DSA) is transforming data access for platform research. The white paper explores the implementation of Article 40.12, which mandates Very Large Online Platforms (VLOPs) to provide access to “publicly available data.”",
    "url": "https://www.vera.ai/news/white-paper-the-state-of-social-media-research-apis-tool-in-the-dsa-era",
    "date": "2026-01-19",
    "source": "vera.ai",
    "description": "The white paper, co-authored by Fabio Giglietto, examines the impact of the Digital Services Act (DSA) on data access for platform research, specifically focusing on the implementation of Article 40.12 concerning publicly available data.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Mapping Italian News Research Program",
    "snippet": "The MINE (Mapping Italian News) Research Program, where Fabio Giglietto is involved, published a white paper titled 'The State of Social Media Research APIs & Tools in the Digital Services Act Era,' co-authored by Fabio Giglietto and Massimo Terenzi. The program also has presentations and research related to coordinated link sharing behavior on Facebook by Fabio Giglietto, Nicola Righetti, Luca Rossi and Giada Marino.",
    "url": "https://mappingnews.uniurb.it/",
    "date": "2026-01-19",
    "source": "mappingnews.uniurb.it",
    "description": "The MINE Research Program mentions Fabio Giglietto's involvement and co-authorship of a white paper on social media research APIs and tools, and his contributions to research on coordinated link sharing behavior on Facebook. It's related to his expertise in social media analysis and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Fabio Giglietto's research works",
    "snippet": "Lists Fabio Giglietto's research publications, including a preprint on Meta's political content reduction policy and its impact on Italian parliamentarians' Facebook visibility. The study examines the effects of Meta's policy using a dataset of over 2.5 million Facebook posts and identifies breakpoints that reveal policy effects.",
    "url": "https://www.researchgate.net/scientific-contributions/Fabio-Giglietto-2335302945",
    "date": "2026-01-19",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate page lists Fabio Giglietto's research publications, including a preprint about Meta's content policies' impact on Italian parliamentarians. It highlights his work on social media analysis and policy impacts.",
    "relevanceScore": 0.8,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Il Premio Rimini Mundi a sette ambasciatori del congressuale - lapiazzarimini.it",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSXlscW55aHBKdlR2VVZrX2kyRXVWZnVKNWFHZllpb1VOdVNOMVRKdFdJeUR2eWNCN3QtWXFzOTFIZngxcFUyV1NwXy1WYjdNa0RvbDBEUFpSeG96ME81dXl0UmxHaC1NYkFsMER0MENWbzlvS2JoYWNuSW1WRkxoM21xR3I4SHNuWnhYWXhLVXBCT1c4OFdV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-11-30",
    "source": "lapiazzarimini.it",
    "description": "News article from lapiazzarimini.it",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Il movimento religioso cinese che si è infiltrato in un gruppo Facebook urbinate - il Ducato",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRlVLVTNqUkVuTUkzZ3p2N1BQZHhmQWhQR3czSk9vQjAzYk93STZnT0w3WTJyeG1vcEJtQW5QS3o3R0ROM0hBOUNkZGc0SGNpbTQ2SVhtQ3BhMnl1MTFVR1dOVUVYajRPMXFvRzJUNm5hdFFNbWpyaHFGdkdlMFM5blQ4Y2Q2VkxjR19WUkY4SFgxeDdGRFdSX0VOckxZbzRnUEsySTU1MlJLOS1iSWc0aW9GeF9aSEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2024-12-17",
    "source": "il Ducato",
    "description": "News article from il Ducato",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Who is behind vera.ai? Meet the people and teams that make up the vera.ai project. #8 Team of University of Urbino Carlo Bo",
    "snippet": "This article introduces the University of Urbino Carlo Bo team working on the vera.ai project, including Fabio Giglietto as the team lead. It discusses their work on detecting problematic content and coordinated sharing behavior using social media analysis and network science methods. It was published after July 2025.",
    "url": "https://www.veraai.eu/posts/who-is-behind-veraai-uniurb",
    "date": "2023-05-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The article introduces the University of Urbino Carlo Bo team working on the vera.ai project, led by Fabio Giglietto. It focuses on their research on detecting problematic content and coordinated sharing behavior using social media analysis, which aligns with Fabio Giglietto's expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  }
]