[
  {
    "title": "Home | Professor of Internet Studies",
    "snippet": "This is a bio page for Fabio Giglietto, PhD, a Professor of Internet Studies at the University of Urbino Carlo Bo. It highlights his research interests in disinformation, social media analysis, computational social science, and political communication. It mentions his work on coordinated link-sharing behavior during the Italian elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFB4gX-HWFwD7dAR52ds6tmqEUpeNkKzcgJXJnNAqm9IN_bIJkxyykGSsQyjVe3QcYxOB_fm-WPk_GqRFXAKqLJaX8VR_Se-Od6LZIY4fGyOjClrjNRyz111ERG0A==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This is a bio page for Fabio Giglietto, a Professor of Internet Studies at the University of Urbino Carlo Bo, highlighting his research interests in disinformation, social media analysis, and political communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017 | Request PDF - ResearchGate",
    "snippet": "This ResearchGate entry references Fabio Giglietto's work (Giglietto et al., 2021) on disinformation in the context of COVID-19. It mentions his research on coordinated disinformation campaigns and the use of social media to influence political behavior, particularly concerning Facebook activity before the 2018 and 2019 Italian elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH9Hww06Gcz3pO9Cjro7gI0OJdkKiG6YfGaeA8gY5f_5ycLrZB7s8PV3gl_9k7g6hRO6xACGvKwhzjytA0fH06HuzjnmaTOcFNtlVotBR7d3ZfZVZNmorjgZxpAVM2fpcpysrO8cIg3j_3suFMVRJCDzTFPtOGh0bHUAky156SHfG9F5Dt6BEFyg8M8YZgKvyrnp5Eo7uYJ6ULW_YkwRCl3tF6t13rqn4nreQ_If8djYaH9p34o06O9COJK9AEAHMiOlQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate entry mentions Fabio Giglietto's research on disinformation related to COVID-19 and Italian elections, specifically referencing his 2021 publication. It discusses his work on coordinated disinformation campaigns and the impact of social media on political behavior.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Detection and Characterization of Coordinated Online Behavior: A Survey - arXiv",
    "snippet": "This survey paper cites Fabio Giglietto's work on coordinated online behavior, specifically mentioning his 2023 paper with Marino, Mincigrucci, and Stanziano on detecting and monitoring coordinated social media accounts during the 2022 Italian election, as well as Giglietto et al. [2020a].",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEdVZ26dW1qV3n5iQnSrtDZL1jDebV1ymbK_1jnnWCyui6uE_o5QziQnVIZyeAklqL-1fbQpSZO1wbX5jAbujHhgEeCsqeQt4oArSi6hehtW-ZbvftgthUX2x00yrIA",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This survey paper cites Fabio Giglietto's research on coordinated online behavior, specifically referencing his 2023 paper on the Italian election and a 2020 paper. It demonstrates the influence of his work within the field of social media analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "'Fake news' is the invention of a liar: How false information circulates within the hybrid news system - IRIS",
    "snippet": "This entry references Fabio Giglietto's work on 'fake news' and how false information circulates within the hybrid news system. Co-authors include Laura Iannelli, Augusto Valeriani, and Luca Rossi.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6L1xaziQpAoAoEY1rV-4-yFJo-ln0AlM5jzOK_extutg23skhcxytRd7O8HfaVmIgs1F859eUGRAGYVsdwrOGXOhVF2tXAxYw43YAlvfnkvAtHyu5tAk62Ohxvu8diORDY79HwQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The entry references Fabio Giglietto's research on 'fake news' and its circulation within the hybrid news system, indicating a third-party mention of his academic work. The co-authors also suggest this is a legitimate research project.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Coordinated Link Sharing Behavior as a Signal to Surface Sources of Problematic Information on Facebook | Request PDF - ResearchGate",
    "snippet": "This ResearchGate entry discusses Fabio Giglietto's work (Giglietto et al. 2020) on coordinated link-sharing behavior (CLSB) as a signal to surface sources of problematic information on Facebook. It highlights how coordinated networks manipulate visibility and media narratives and how CLSB is associated with higher risks of encountering problematic news sources.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHa4FCbbt7yzjzUFpAFUU83FrYlHClhztCsBSlN6Ikj_D2iUerhuomH18H4aoyc2QMFPJGTvKmd2qnLALDK4mAl1lE5ARVzkkunC6-7acdMvoqlon1WJXUxiR7tNM78SlQf3RCIiU4E3kQkL2FCS6gpTiVvbZLiKRV-hzEtAMnzen1I98a6r9n8-8LR-rKJ8lf80hmpqJoBc_tdS0sd0SbLfBJ7U_2ve4vrdFSeJRXs8eEOO3xHHKBTzb54hiW9vGMiOl_SRl6YiaXaD2Ua3TTHNSesiiKT",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate entry references Fabio Giglietto's 2020 work on coordinated link-sharing behavior (CLSB) and its connection to the spread of problematic information on Facebook.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "POLITICAL ADVERTISEMENT AND COORDINATED BEHAVIOR ON SOCIAL MEDIA IN THE LEAD-UP TO THE 2021 GERMAN FEDERAL ELECTIONS - Landesanstalt für Medien NRW",
    "snippet": "This study references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) and coordinated networks on Facebook, specifically citing 'Giglietto, Righetti, Rossi, & Marino, 2020'. It discusses the use of CLSB to spread anti-establishment narratives and disinformation during elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE7ZXixd7XTfU5udkC4ucfE_bym_qeDcx6l1prS6rpkmmpw51CAml_7SfzBtdGk3gLucv59-wegh3x6YCk314MH9rq38gV-O5sJTBtmhxV9COVdqOUxm-Lkg_WrfQLb5_N2GXeMgHvJArgwtZqYJ6Ynj8bRhO3aTmdICrZnhz4WWEWVdu8bkvLJERP2zCTMyWBoYbLZsEPtTq3Fi98RZGFUqdFDy2FYEkZDPMb-CMGkMzCh",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This study on political advertisement and coordinated behavior during the 2021 German Federal Elections references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) and its use in spreading disinformation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Fabio Giglietto",
    "snippet": "Fabio Giglietto, PhD, is a distinguished Professor of Internet Studies at the Department of Communication Sciences, Humanities, and International Studies at the University of Urbino Carlo Bo. His research focuses on social media analysis, computational social science, and the detection and analysis of disinformation campaigns, particularly in the context of political communication.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQESPK3gn1IwE97Ib4xKFqRUEm0A8xamgiewo2hsXQiaPPWDQNUt2WC7xucH3t1em27p9s8HqZyzmoeFP5PcMTOpHiYukdXLVWi6YwOjlJgMFNWpPcVdBNJBu7UbpA==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content explicitly mentions Fabio Giglietto as a Professor of Internet Studies at the University of Urbino Carlo Bo, detailing his research focus on social media analysis, computational social science, and disinformation campaigns, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Fabio Giglietto",
    "snippet": "Mentions Fabio Giglietto's presentation at the XX ISA World Congress of Sociology: 'Understanding Political Crises in the 2020s - a Sociocybernetics Approach' and 'Unintentional Exposure to Political News on Facebook's Religious Pages during the 2022 Italian Election Campaign.'",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGQ86rJQvqdnOf0_jxL_Zy44mx1QfzOpCq-GiiVgmATM0Wk9fg2dNyvU02jApoFUlLfkuX0tgXIe15btFNRUQfpfzt0ilCiVUD8sZY-O0YDe2aSjrFcj8OUmXL0jg-yagvR7SOBalL4gFJODuP7sSxjL0RI0tRurgMP8zymFL1k",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content mentions Fabio Giglietto's presentation at the XX ISA World Congress of Sociology on topics related to political crises, news exposure on Facebook's religious pages during the 2022 Italian election campaign, aligning with his expertise in social media and political communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Meet the speakers! - EUDTP 2025 - EuroTech Universities Alliance",
    "snippet": "Fabio Giglietto is a speaker at the EU Digital Technologies and Policies (EUDTP) conference in Brussels on May 14 and 15, 2025. He will be discussing implementation challenges and opportunities under the Digital Services Act (DSA).",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFjuV3m4LhZREUUfTXg1dWWHYw9lCPUM4A0XGB8iiVi7dLsCYHJBL7WcE2tW34zNlnzag6dlpf7V_0bmbC0QZUkBkuJUuUd-JRZ6EEcltk2U6B_D0fABAwsJPorw17WIojr_A8HhnRMcmc152DoFQWYR8wS9I2EMrXbwDEW6tbMTibuYRDFWIxVrgF3CRl88CAr8wK-3wXjVpXEWExC9wH-yJ2RuX_OwvqmUxoeA9Zmqq_bufHGw5QyNw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is a speaker at the EuroTech Universities Alliance EU Digital Technologies and Policies conference in Brussels, discussing the Digital Services Act.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Conference Schedule - International Conference on Social Media & Society",
    "snippet": "Fabio Giglietto participated in a panel discussion titled \"Topic Modelling for Research on Social Media Platforms\" at the International Conference on Social Media & Society, July 15, 2024.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEOa3yf2FYDIKlj_A2FC8hfR2jWNX1OhMjY6-aGSJmcsdXadfGQGspDqzTfuuIhkOkJoDel-gLGo-0cEVwOK_vKsm6vun9_ZAupncaij-_p3OqM-ZSzjhOMcHjVMbmLqLto2HscbYH9571VbbSmxoaH7IwpSLcB",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto participated in a panel discussion on topic modelling for social media research at the International Conference on Social Media & Society in July 2024, indicating his expertise in social media analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  }
]