{
  "publications": [
    {
      "doi": "10.1111/jcom.12085",
      "title": "Second Screen and Participation: A Content Analysis on a Full Season Dataset of Tweets",
      "authors": "Giglietto, Fabio; Selva, Donatella",
      "venue": "Journal of Communication",
      "year": 2014,
      "type": "journal-article",
      "url": "https://doi.org/10.1111/jcom.12085",
      "crossref_type": "journal-article",
      "publisher": "Oxford University Press (OUP)",
      "container_title": "Journal of Communication",
      "page": "260-277",
      "volume": "64",
      "issue": "2",
      "issn": "0021-9916",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [
        "http://doi.wiley.com/10.1002/tdm_license_1.1"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/15228835.2012.743797",
      "title": "The Open Laboratory: Limits and Possibilities of Using Facebook, Twitter, and YouTube as a Research Data Source",
      "authors": "Giglietto, Fabio; Rossi, Luca; Bennato, Davide",
      "venue": "Journal of Technology in Human Services",
      "year": 2012,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/15228835.2012.743797",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Journal of Technology in Human Services",
      "page": "145-159",
      "volume": "30",
      "issue": "3-4",
      "issn": "1522-8835",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1177/0011392119837536",
      "title": "‘Fake news’ is the invention of a liar: How false information circulates within the hybrid news system",
      "authors": "Giglietto, Fabio; Iannelli, Laura; Valeriani, Augusto; Rossi, Luca",
      "venue": "Current Sociology",
      "year": 2019,
      "type": "journal-article",
      "url": "https://doi.org/10.1177/0011392119837536",
      "crossref_type": "journal-article",
      "publisher": "SAGE Publications",
      "container_title": "Current Sociology",
      "page": "625-642",
      "volume": "67",
      "issue": "4",
      "issn": "0011-3921",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>Alarmed by the oversimplifications related to the ‘fake news’ buzzword, researchers have started to unpack the concept, defining diverse types and forms of misleading news. Most of the existing works in the area consider crucial the intent of the content creator in order to differentiate among different types of problematic information. This article argues for a change of perspective that, by leveraging the conceptual framework of sociocybernetics, shifts from exclusive attention to creators of misleading information to a broader approach that focuses on propagators and, as a result, on the dynamics of the propagation processes. The analytical implications of this perspective are discussed at a micro level (criteria to judge the falsehood of news and to decide to spread it), at a meso level (four possible relations between individual judgements and decisions), and at a macro level (global circulation cascades). The authors apply this theoretical gaze to analyse ‘fake news’ stories that challenge existing models.</jats:p>",
      "license": [
        "http://journals.sagepub.com/page/policies/text-and-data-mining-license"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.31219/osf.io/2j9ed",
      "title": "Evaluating Embedding Models for Clustering Italian Political News: A Comparative Study of Text-Embedding-3-Large and UmBERTo",
      "authors": "Giglietto, Fabio",
      "venue": "Center for Open Science",
      "year": 2024,
      "type": "posted-content",
      "url": "https://doi.org/10.31219/osf.io/2j9ed",
      "crossref_type": "posted-content",
      "publisher": "Center for Open Science",
      "issn": null,
      "isbn": null,
      "subject": [],
      "abstract": "<p>In an era where social media platforms have become the battleground for shaping political narratives, understanding the nuances of disseminated political news content is crucial. Reliable unsupervised clustering of datasets containing excerpts from news stories circulated on social media is a central piece of the puzzle. Despite advancements in Natural Language Processing (NLP) techniques, studies led by social scientists that apply fully unsupervised techniques to Italian language content remain rare. While large language models promise to be game-changers, a proper comparison with previously available unsupervised NLP techniques is lacking. This study helps to fill this gap by comparing the performance of OpenAI's text-embedding-3-large model against the BERT-based UmBERTo model. The comparison utilizes two distinct datasets of political news stories circulated on Facebook before the 2018 and 2022 Italian elections. Using K-means and HDBSCAN, we find that text-embedding-3-large consistently outperforms UmBERTo in producing semantically coherent clusters.</p>",
      "license": [
        "https://creativecommons.org/licenses/by/4.0/legalcode"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3389/fsoc.2024.1379265",
      "title": "Facebook reactions in the context of politics and social issues: a systematic literature review",
      "authors": "Anwar, Sawood; Giglietto, Fabio",
      "venue": "Frontiers in Sociology",
      "year": 2024,
      "type": "journal-article",
      "url": "https://doi.org/10.3389/fsoc.2024.1379265",
      "crossref_type": "journal-article",
      "publisher": "Frontiers Media SA",
      "container_title": "Frontiers in Sociology",
      "volume": "9",
      "issn": "2297-7775",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>In February 2016, Facebook expanded the original “Like” button by introducing five additional “Reactions”—Love, Haha, Wow, Sad, and Angry—using modified versions of Unicode emojis. These reactions enable users to express more nuanced emotions towards posts. This literature review investigates scholarly research on user behavior in response to these reactions, with a focus on a broad spectrum of socioeconomic and psychological issues. We conducted a systematic search across databases including Scopus and Google Scholar, using keywords such as “Facebook” and “Reaction,” combined with various key phrases and Boolean operators. Our review synthesizes sixty-four articles published from 2016 to 2023, exploring diverse topics such as political news, far-right and extremist parties, racism, and hate speech during the COVID-19 pandemic. We organized these articles by theme and publication date. Our meta-analysis reveals that lifestyle and entertainment posts predominantly receive positive reactions, while sociopolitical content tends to elicit a broader spectrum of emotions, including negative sentiments. Furthermore, emotionally charged content consistently attracts higher volumes of reactions, regardless of sentiment. This research highlights the intricate relationship between user reactions and content characteristics, providing deeper insights into the dynamics of online engagement. By understanding these interaction patterns, we gain a better grasp of emotional responses and engagement levels, which ultimately shape online discourse and user interactions.</jats:p>",
      "license": [
        "https://creativecommons.org/licenses/by/4.0/"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.5210/spir.v2024i0.13999",
      "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA",
      "authors": "Marino, Giada; Almeida Paroni, Bruna; Giglietto, Fabio",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2025,
      "type": "journal-article",
      "url": "https://doi.org/10.5210/spir.v2024i0.13999",
      "crossref_type": "journal-article",
      "publisher": "University of Illinois Libraries",
      "container_title": "AoIR Selected Papers of Internet Research",
      "issn": "2162-3317",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>The 2022 Brazilian presidential elections and subsequent events highlight a significant period of political polarization and misinformation, particularly on social media platforms like Facebook. This study investigates the dynamics of misinformation campaigns on Facebook in the context of Brazil's political shifts, focusing on the period from the 2022 elections to the aftermath of the attempted coup on January 8, 2023. Utilizing a mixed methods approach and an innovative news alert system, we analyzed three months of links shared in a coordinated fashion leading up to the first anniversary of the attempted coup.\n\nOur findings reveal a bipartisan battlefield of political discourse, with a scenario characterized by divergence in accounts’ political alignment. We, in fact, identified two primary networks of political Facebook accounts: one supporting former President Jair Bolsonaro and another backing President Lula. Interestingly, we observed Lula supporters repeatedly share content criticizing or mocking Bolsonaro, his family members, and his supporters within pro-Bolsonaro groups. Moreover, these posts often receive a substantial number of comments and minor reactions and shares.\n\nFuture research will expand on these findings by examining a year's worth of Facebook posts from these networks to explore changes in topics and strategies over time.\n\nThe presentation will thus discuss the study's advancement outcomes in-depth, contributing to understanding how Brazilian political factions’ supporters utilize social media to influence public opinion and the implications for democracy in the digital age.</jats:p>",
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1177/20563051231196866",
      "title": "A Workflow to Detect, Monitor, and Update Lists of Coordinated Social Media Accounts Across Time: The Case of the 2022 Italian Election",
      "authors": "Giglietto, Fabio; Marino, Giada; Mincigrucci, Roberto; Stanziano, Anna",
      "venue": "Social Media + Society",
      "year": 2023,
      "type": "journal-article",
      "url": "https://doi.org/10.1177/20563051231196866",
      "crossref_type": "journal-article",
      "publisher": "SAGE Publications",
      "container_title": "Social Media + Society",
      "volume": "9",
      "issue": "3",
      "issn": "2056-3051",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p> Information operations that target public opinion often exploit breaking news, crises, and elections by using coordinated social media actors to disseminate problematic content. These events often reveal the relationships between actors, prompting the creation of lists of malicious actors and news sources. However, relying on outdated lists may underestimate the prevalence and impact of such operations. This article presents a novel workflow to detect, monitor, and update lists of coordinated social media actors during and beyond peak activity periods. Using this approach, known problematic actors are constantly monitored, allowing the detection of new actors and the update of the monitored pool. The workflow was applied to the 2022 Italian snap election, leveraging previous research on coordinated inauthentic behavior during the 2018 and 2019 Italian elections. The initial list of 435 coordinated accounts was monitored, surfacing 1,022 overly shared or commented political posts, 272 coordinated links, and detecting 66 political and 554 generic coordinated accounts not previously listed. Three case studies were identified: one politically motivated, one click-economy driven, and one religiously motivated operation. The article discusses the implications of this approach, its limitations, and potential future work. </jats:p>",
      "license": [
        "https://creativecommons.org/licenses/by-nc/4.0/"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.31235/osf.io/4cyfu",
      "title": "Political polarization in the frequency British newspapers mention scientists with different views on COVID-19",
      "authors": "Ghezzi, Pietro; Giglietto, Fabio; Martinisi, Alessandro",
      "venue": "Center for Open Science",
      "year": 2023,
      "type": "posted-content",
      "url": "https://doi.org/10.31235/osf.io/4cyfu",
      "crossref_type": "posted-content",
      "publisher": "Center for Open Science",
      "issn": null,
      "isbn": null,
      "subject": [],
      "abstract": "<p>Background. Measures against the COVID-19 pandemics have been subject of political polarization also in the United Kingdom. While this has been studied in the broader context of misinformation, the debate around non-pharmacological interventions (NPI) , the and the political implications of different views of their risks and benefits, has not been taken into account with sufficient depth Research question. Our research question was: Are politically-oriented UK newspapers more likely to promote a more, or less, precautionary views toward the use of NPIs?Methods. We used the Mediacloud database to search the names of scientists with different precautionary views (i.e.: signatories of the Great Barrington Declaration and of the John Snow Memorandum) and analyze the frequency with which they are mentioned in newspapers with different political orientation.Results. Scientists with more precautionary positions are more likely to be mentioned in left-leaning newspapers, whereas those with less precautionary views on right-leaning ones. The two groups segregated also in terms of co-authorship of academic papers.Conclusions. Scientists with different opinions in relation to  NPIs are mentioned by UK newspapers in a way that is dependent on the political orientation of the newspaper.</p>",
      "license": [
        "https://creativecommons.org/licenses/by/4.0/legalcode"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.51685/jqd.2023.020",
      "title": "Cracking Open the European Newsfeed",
      "authors": "Rossi, Luca; Giglietto, Fabio; Marino, Giada",
      "venue": "Journal of Quantitative Description: Digital Media",
      "year": 2023,
      "type": "journal-article",
      "url": "https://doi.org/10.51685/jqd.2023.020",
      "crossref_type": "journal-article",
      "publisher": "Journal of Quantitative Description: Digital Media",
      "container_title": "Journal of Quantitative Description: Digital Media",
      "volume": "3",
      "issn": "2673-8813",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>This paper contributes to the ongoing effort to describe and quantify the quality of information that is shared on large social media platforms. We do this by complementing existing research that provided a first quantitative assessment of the quality of the information circulating on Facebook among US users. Leveraging an updated version of the same data source — Meta's URL Shares Dataset — and replicating much of the methodology, we quantify the trustworthy and untrustworthy links to external websites that have been shared on Facebook in the period between 2019 and 2022 in three major European countries (Germany, France, and Italy). We observe a clear decline in the number of URLs present in the dataset and an increase in the URLs from untrustworthy domains as a percentage of the total URLs shared in a year. This increase seems to be higher in electoral years (in Germany and in Italy) but it does not translate into an increase of Views received from untrustworthy sources.</jats:p>",
      "license": [
        "https://creativecommons.org/licenses/by-nc-nd/4.0"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1007/978-3-031-29298-9_4",
      "title": "Citizens’ Engagement with the ‘Seaside Campaign’ on Instagram and Facebook",
      "authors": "Boccia Artieri, Giovanni; Giglietto, Fabio; Stanziano, Anna",
      "venue": "Italy at the Polls 2022",
      "year": 2023,
      "type": "book-chapter",
      "url": "https://doi.org/10.1007/978-3-031-29298-9_4",
      "crossref_type": "book-chapter",
      "publisher": "Springer Nature Switzerland",
      "container_title": "Italy at the Polls 2022",
      "page": "79-103",
      "issn": null,
      "isbn": "9783031292972",
      "subject": [],
      "abstract": null,
      "license": [
        "https://www.springernature.com/gp/researchers/text-and-data-mining",
        "https://www.springernature.com/gp/researchers/text-and-data-mining"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.31235/osf.io/2p7ws",
      "title": "Unexpected consequences of a simple threshold: the effect of the 100 public shares on Meta’s URL Shares Dataset",
      "authors": "Giglietto, Fabio; Rossi, Luca; Righetti, Nicola",
      "venue": "Center for Open Science",
      "year": 2022,
      "type": "posted-content",
      "url": "https://doi.org/10.31235/osf.io/2p7ws",
      "crossref_type": "posted-content",
      "publisher": "Center for Open Science",
      "issn": null,
      "isbn": null,
      "subject": [],
      "abstract": "<p>In February 2018 Facebook released an unprecedented dataset designed to enable academic researchers to study the exposure of links circulated on the platform while preserving users’ privacy. Understanding exposure is a key step to addressing questions on the prevalence and effects of mis/disinformation. One of the strategies employed in this dataset to avoid users’ re-identification was censoring links with less than 100 public shares. The dataset thus contains a fraction of the links circulated on Facebook between 2017 and 2020. Previous studies have already pointed out possible representativeness distortions brought by this choice. We add to this stream by revealing the remarkable similarity between the monthly trends of links attributed to 46 countries. Despite the different events that happened over four years in such a range of very different countries, the similarity of these trends points to an underlying platform-wide force that affected the likelihood of a link passing the 100 public share threshold worldwide.</p>",
      "license": [
        "https://creativecommons.org/licenses/by-nc-sa/4.0/legalcode"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.31235/osf.io/6umqs",
      "title": "Mapping Nefarious Social Media Actors to Speed-up Covid-19 Fact-checking",
      "authors": "Giglietto, Fabio; Farci, Manolo; Marino, Giada; Mottola, Serena; Radicioni, Tommaso; Terenzi, Massimo",
      "venue": "Center for Open Science",
      "year": 2022,
      "type": "posted-content",
      "url": "https://doi.org/10.31235/osf.io/6umqs",
      "crossref_type": "posted-content",
      "publisher": "Center for Open Science",
      "issn": null,
      "isbn": null,
      "subject": [],
      "abstract": "<p>This report presents the outcomes of a project aimed at developing and testing a prototype tool that supports and speeds-up the work of fact-checkers and de-bunkers by surfacing and ranking potentially problematic information circulated on social media with a content-agnostic approach. The tool itself is the result of a multi-year research activity carried on within the Mapping Italian News Research Program of the University of Urbino Carlo Bo to study the strategies, tactics and goals of influence operations aimed at manipulating the Italian public opinion by exploiting the vulnerabilities of the contemporary media ecosystem. This research activity led to developing original studies, public reports, new methods, maps and tools employed to study the activity of Italian nefarious social media actors aimed at amplifying the reach and impact of problematic information by coordinating their efforts. Tracking these actors proved instrumental to observe the “infodemic” unraveling during the early days of COVID-19 outbreak in Italy. Combining this existing knowledge with a range of original tools and data sources provided by Meta’s Facebook Open Research Initiative (Fort) and by The International Fact-Checking Network (IFCN) at Poynter, the report: documents those early days by highlighting a list of widely viewed and interacted links circulated on Facebook; traces the establishment, growth and evolution of Italian covid-skeptic coordinated networks on Facebook; presents a comprehensive and updated map of the activities performed by these networks of nefarious social media actors; unveils a set of original tactics and strategies employed by these actors to adjust their operations to the mitigation efforts adopted by social media platforms to reduce the spread of problematic information; describes the circulation of three specific piece of problematic information; provides an overview of the outcomes of the testing phase (carried out in collaboration with Facta.news) of a prototype tool that surfaces and ranks potentially problematic information circulated on social media with a content-agnostic approach.</p>",
      "license": [
        "https://creativecommons.org/licenses/by/4.0/legalcode"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.4162030",
      "title": "Blowing on the Fire: An Analysis of Low Quality and Hyper Partisan News Sources Circulated by Coordinated Link Sharing Networks in Nigeria",
      "authors": "Giglietto, Fabio; Olaniran, Samuel; Mincigrucci, Roberto; Marino, Giada; Mottola, Serena; Terenzi, Massimo",
      "venue": "SSRN Electronic Journal",
      "year": 2022,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.4162030",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.4337/9781800374263.coordinated.inauthentic.behavior",
      "title": "Coordinated inauthentic behavior",
      "authors": "Giglietto, Fabio",
      "venue": "Elgar Encyclopedia of Technology and Politics",
      "year": 2022,
      "type": "book-chapter",
      "url": "https://doi.org/10.4337/9781800374263.coordinated.inauthentic.behavior",
      "crossref_type": "book-chapter",
      "publisher": "Edward Elgar Publishing",
      "container_title": "Elgar Encyclopedia of Technology and Politics",
      "page": "280-283",
      "issn": null,
      "isbn": "9781800374263",
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.4135/9781529601886",
      "title": "Using Facebook’s Advertising Platform for Recruiting Online Survey Respondents",
      "authors": "Marino, Giada; Giglietto, Fabio; Iannelli, Laura",
      "venue": "SAGE Publications, Ltd.",
      "year": 2021,
      "type": "book",
      "url": "https://doi.org/10.4135/9781529601886",
      "crossref_type": "book",
      "publisher": "SAGE Publications, Ltd.",
      "issn": null,
      "isbn": "9781529601886",
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.5210/spir.v2021i0.12170",
      "title": "COORNET: AN INTEGRATED APPROACH TO SURFACE PROBLEMATIC CONTENT,\n        MALICIOUS ACTORS, AND COORDINATED NETWORKS",
      "authors": "Giglietto, Fabio; Righetti, Nicola; Rossi, Luca; Marino, Giada",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2021,
      "type": "journal-article",
      "url": "https://doi.org/10.5210/spir.v2021i0.12170",
      "crossref_type": "journal-article",
      "publisher": "University of Illinois Libraries",
      "container_title": "AoIR Selected Papers of Internet Research",
      "issn": "2162-3317",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>As much as the field of mis/disinformation studies flourished during\n        the last few years, the efforts to measure its prevalence and effects are often hindered or\n        significantly limited by the fuzziness of the phenomenon under study. Differently from\n        approaches based on sole content or actors detection, the authors implement an integrated\n        approach to understand the interplay between manipulative actors, deceptive behavior, and\n        harmful content. To do so, the authors present a study on patterns of coordinated activity\n        on Facebook (named “Coordinated Link Sharing Behavior”) during the first and second waves of\n        the COVID-19 pandemic in Italy. Coordinated Link Sharing Behavior” (CLSB) refers to the\n        coordinated shares of the same news article in a very short timeframe by networks of pages,\n        groups, and verified public profiles. CLSB is a strategy used to boost the reach of content\n        by gaming algorithms that govern the distribution of posts. Additionally, this coordinated\n        activity has been proven to be consistently associated with the spread of problematic\n        information before the 2018 and 2019 Italian elections. In this paper, the authors devote\n        specific attention to discuss the methodology and tool employed in the context of existing\n        literature on mis/disinformation as well as to present the results of the case\n        study.</jats:p>",
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/ses2021-002014",
      "title": "Ciarlatani. Post-verità, contropubblici online e nuove articolazioni della fiducia nel sistema della medicina",
      "authors": "Gemini, Laura; Boccia Artieri, Giovanni; Giglietto, Fabio; Farci, Manolo; Brilli, Stefano; Zurovac, Elisabetta",
      "venue": "SALUTE E SOCIETÀ",
      "year": 2021,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/ses2021-002014",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SALUTE E SOCIETÀ",
      "page": "201-222",
      "issue": "2",
      "issn": "1723-9427",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.3777263",
      "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017",
      "authors": "Giglietto, Fabio; Marino, Giada; Terenzi, Massimo; Righetti, Nicola; Rossi, Luca",
      "venue": "SSRN Electronic Journal",
      "year": 2021,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.3777263",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/1369118x.2020.1739732",
      "title": "It takes a village to manipulate the media: coordinated link sharing behavior during 2018 and 2019 Italian elections",
      "authors": "Giglietto, Fabio; Righetti, Nicola; Rossi, Luca; Marino, Giada",
      "venue": "Information, Communication &amp; Society",
      "year": 2020,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/1369118x.2020.1739732",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Information, Communication &amp; Society",
      "page": "867-891",
      "volume": "23",
      "issue": "6",
      "issn": "1369-118X",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [
        {
          "DOI": "10.13039/100001345",
          "name": "Social Science Research Council",
          "doi-asserted-by": "publisher",
          "award": [
            "SSRC-030"
          ],
          "id": [
            {
              "id": "10.13039/100001345",
              "id-type": "DOI",
              "asserted-by": "publisher"
            }
          ]
        }
      ],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.3775469",
      "title": "Adapting to Mitigation Efforts: Evolving Strategies of Coordinated Link Sharing on Facebook",
      "authors": "Giglietto, Fabio; Terenzi, Massimo; Marino, Giada; Righetti, Nicola; Rossi, Luca",
      "venue": "SSRN Electronic Journal",
      "year": 2021,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.3775469",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.3743531",
      "title": "An Italian Network of Memes, News, Spam Pages, and Dietary Supplements",
      "authors": "Giglietto, Fabio; Terenzi, Massimo; Marino, Giada; Righetti, Nicola; Rossi, Luca",
      "venue": "SSRN Electronic Journal",
      "year": 2021,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.3743531",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1145/3400806.3400817",
      "title": "Coordinated Link Sharing Behavior as a Signal to Surface Sources of Problematic Information on Facebook",
      "authors": "Giglietto, Fabio; Righetti, Nicola; Rossi, Luca; Marino, Giada",
      "venue": "International Conference on Social Media and Society",
      "year": 2020,
      "type": "proceedings-article",
      "url": "https://doi.org/10.1145/3400806.3400817",
      "crossref_type": "proceedings-article",
      "publisher": "ACM",
      "container_title": "International Conference on Social Media and Society",
      "page": "85-91",
      "issn": null,
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [
        {
          "DOI": "10.13039/501100000155",
          "name": "Social Science Research Council",
          "doi-asserted-by": "publisher",
          "award": [
            "SSRC-030"
          ],
          "id": [
            {
              "id": "10.13039/501100000155",
              "id-type": "DOI",
              "asserted-by": "publisher"
            }
          ]
        }
      ],
      "crossref_score": 1
    },
    {
      "doi": "10.5210/spir.v2020i0.11219",
      "title": "DETECTING COORDINATED LINK SHARING BEHAVIOR ON FACEBOOK DURING THE\t\t\tITALIAN CORONAVIRUS OUTBREAK",
      "authors": "Giglietto, Fabio; Righetti, Nicola; Marino, Giada",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2020,
      "type": "journal-article",
      "url": "https://doi.org/10.5210/spir.v2020i0.11219",
      "crossref_type": "journal-article",
      "publisher": "University of Illinois Libraries",
      "container_title": "AoIR Selected Papers of Internet Research",
      "issn": "2162-3317",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>Social media, as many scholars have shown, can be used to influence political behavior through coordinated disinformation campaigns in which participants pretend to be ordinary citizens. With a specific reference to Facebook, a recent study has spotlighted patterns of coordinated activity aimed at fueling online circulation of specific news stories before the 2018 and 2019 Italian elections, an activity called by the authors “Coordinated Link Sharing Behavior” (CLSB). More precisely, CLSB refers to the coordinated shares of the same news articles in a very short time by networks of entities composed by Facebook pages, groups and verified public profiles. The uncertainty related to the coronavirus outbreak is a unique chance for malicious actors to leverage the anxiety of online publics to reach their goals, filling the information void with problematic content. Considering the association between coordination, media manipulation, and problematic information, the entities involved in coordinated online activities represent a privileged perspective on these phenomena. Thus, against the backdrop of the literature and the already conducted studies, this proposal will discuss Coordinated Link Sharing Behavior in the context of the coronavirus outbreak informational void, analyzing network mutations over time and the content strategies used to exploit the ambiguity associated with the topic.</jats:p>",
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.31235/osf.io/3jteh",
      "title": "Understanding Coordinated and Inauthentic Link Sharing Behavior on Facebook in the Run-up to 2018 General Election and 2019 European Election in Italy",
      "authors": "Giglietto, Fabio; Righetti, Nicola; Marino, Giada",
      "venue": "Center for Open Science",
      "year": 2019,
      "type": "posted-content",
      "url": "https://doi.org/10.31235/osf.io/3jteh",
      "crossref_type": "posted-content",
      "publisher": "Center for Open Science",
      "issn": null,
      "isbn": null,
      "subject": [],
      "abstract": "<p>The year 2016 marked a turning point in the history of relations between the Internet, social media, public opinion, and politics. Online practices of grassroots participation, which used to be considered the prerogative of democratizing forces fighting established powers, turned out to be an effective platform for far-right extremists. In the attempt to make sense of what happened and develop workable solutions, stakeholders rapidly moved through the different stages of grief, ranging from denial to anger and acceptance.As a case in point, we trace the path through these stages which moved from an initial denial of the problem to concern over “fake news” and hoaxes, to finally focusing on the behavior of certain actors on the platform. Starting from the current phase, we analyze “coordinated inauthentic behavior”, a concept only briefly defined in Facebook public statements which, nevertheless, is useful to frame future studies insofar as both the idea of coordination and authenticity have been studied in the literature. Leveraging these works, we suggest a definition that is at once framed in this literature and easy to operationalize.Using this definition and an unprecedented combination of CrowdTangle API (a tool for accessing Facebook and other social media data) and two datasets of Italian political news stories published in the run-up to the 2018 Italian general election and 2019 European election, we developed a method that led to the identification of several networks of pages/groups/verified public profiles (“entities”) that shared the same political news stories on Facebook within a very short period of time (10 in 2018, composed of 28 entities, and 50 in 2019, composed of 143 entities). We call this behavior “coordinated link sharing”. By analyzing the social media profiles of such coordinated entities, we observed that while some of them were clearly political, others presented themselves as entertainment venues, despite sharing political content too. Since the political news stories shared by these non-political entities can reach a broad audience which is largely unguarded against attempts to influence, we describe their behavior as “inauthentic”.Further analyses showed that the news shared by the coordinated networks received a Facebook engagement higher than other news included in our dataset, that much news boosted anti-immigration and far-right propaganda and that several of the news outlets shared by these networks were already blacklisted by fact-checkers.</p>",
      "license": [
        "https://creativecommons.org/licenses/by/4.0/legalcode"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/1369118x.2019.1629692",
      "title": "Diverging patterns of interaction around news on social media: insularity and partisanship during the 2018 Italian election campaign",
      "authors": "Giglietto, Fabio; Valeriani, Augusto; Righetti, Nicola; Marino, Giada",
      "venue": "Information, Communication &amp; Society",
      "year": 2019,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/1369118x.2019.1629692",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Information, Communication &amp; Society",
      "page": "1610-1629",
      "volume": "22",
      "issue": "11",
      "issn": "1369-118X",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [
        {
          "DOI": "10.13039/100006640",
          "name": "Foundation Open Society Institute",
          "doi-asserted-by": "publisher",
          "id": [
            {
              "id": "10.13039/100006640",
              "id-type": "DOI",
              "asserted-by": "publisher"
            }
          ]
        },
        {
          "DOI": "10.13039/100000919",
          "name": "Information Program of the Open Society Foundations",
          "doi-asserted-by": "publisher",
          "award": [
            "OR2017-38824"
          ],
          "id": [
            {
              "id": "10.13039/100000919",
              "id-type": "DOI",
              "asserted-by": "publisher"
            }
          ]
        }
      ],
      "crossref_score": 1
    },
    {
      "doi": "10.1177/0011392119837573",
      "title": "Steering the world from where we are: An introduction to the sociocybernetics perspective",
      "authors": "Almaguer-Kalixto, Patricia Eugenia; Giglietto, Fabio",
      "venue": "Current Sociology",
      "year": 2019,
      "type": "journal-article",
      "url": "https://doi.org/10.1177/0011392119837573",
      "crossref_type": "journal-article",
      "publisher": "SAGE Publications",
      "container_title": "Current Sociology",
      "page": "479-494",
      "volume": "67",
      "issue": "4",
      "issn": "0011-3921",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p> The concept of sociocybernetics has been shaped over the past 40 years at the intersection between first- and second-order cybernetics, constructive epistemology and systems science. This has produced a common language to bridge these different disciplines and a common basis for research analysing complex social problems. Sociocybernetics applies second-order cybernetics concepts to the study of societies, communities and groups in which first- and second-order reflexivity may play an important part, but it is not only a theoretical perspective in the abstract; it is also an approach that is applied to the analysis of cross-disciplinary issues such as systemic violence, the role of technology in society, environmental challenges, urban planning, community development, social identity and media representation, among many others. This article provides an introduction and a general conceptual description of second-order cybernetics in the broader context of cybernetics and systems sciences. It also presents the sociocybernetics debate as it stands today, after the 20-year anniversary of the Research Committee on Sociocybernetics’ (RC51) activities within the International Sociological Association (ISA) and its contributions to understanding and acting upon an increasingly complex social world. Sociocybernetics is the science of turbulent societies that somehow continue to adapt themselves, despite the complexities they are confronted with. The articles in this monograph introduce some of the current work of the research committee and showcase the extensive potential for sociocybernetics’ interaction with other areas of sociology and contemporary debate. </jats:p>",
      "license": [
        "http://journals.sagepub.com/page/policies/text-and-data-mining-license"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/sc2019-057010",
      "title": "Il patchwork mediale",
      "authors": "Giglietto, Fabio",
      "venue": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "year": 2019,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/sc2019-057010",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "page": "120-123",
      "issue": "57",
      "issn": "1121-1733",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1177/0894439318816638",
      "title": "Facebook Digital Traces for Survey Research: Assessing the Efficiency and Effectiveness of a Facebook Ad–Based Procedure for Recruiting Online Survey Respondents in Niche and Difficult-to-Reach Populations",
      "authors": "Iannelli, Laura; Giglietto, Fabio; Rossi, Luca; Zurovac, Elisabetta",
      "venue": "Social Science Computer Review",
      "year": 2020,
      "type": "journal-article",
      "url": "https://doi.org/10.1177/0894439318816638",
      "crossref_type": "journal-article",
      "publisher": "SAGE Publications",
      "container_title": "Social Science Computer Review",
      "page": "462-476",
      "volume": "38",
      "issue": "4",
      "issn": "0894-4393",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p> Survey-based studies are increasingly experimenting with strategies that employ digital footprints left by users on social media as entry points for recruiting participants and complementary data sources. In this perspective, the Facebook advertising platform provides unique opportunities and challenges through its marketing tools that target advertisements based on users’ demographics, behaviors, and interests. This article presents a procedure that employed the most recent developments in Facebook marketing tools to evaluate the efficiency and effectiveness of an innovative method for recruiting niche and traditionally hard-to-reach respondents. Although the multiple innovations introduced in the method hinder a proper comparison with previous studies, the survey provides evidence concerning the efficacy of the procedure and offers scholars a set of implementations to design future comparable Facebook ad–based surveys. Challenges, opportunities, and results for effectiveness are discussed in light of a previous survey on Italian adults carried out with a panel-based computer-assisted web interviewing method. </jats:p>",
      "license": [
        "https://journals.sagepub.com/page/policies/text-and-data-mining-license"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1177/2056305116686992",
      "title": "A Hashtag Worth a Thousand Words: Discursive Strategies Around #JeNeSuisPasCharlie After the 2015 <i>Charlie Hebdo</i> Shooting",
      "authors": "Giglietto, Fabio; Lee, Yenn",
      "venue": "Social Media + Society",
      "year": 2017,
      "type": "journal-article",
      "url": "https://doi.org/10.1177/2056305116686992",
      "crossref_type": "journal-article",
      "publisher": "SAGE Publications",
      "container_title": "Social Media + Society",
      "volume": "3",
      "issue": "1",
      "issn": "2056-3051",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p> Following a shooting attack by two self-proclaimed Islamist gunmen at the offices of French satirical weekly Charlie Hebdo on 7 January 2015, there emerged the hashtag #JeSuisCharlie on Twitter as an expression of solidarity and support for the magazine’s right to free speech. Almost simultaneously, however, there was also #JeNeSuisPasCharlie explicitly countering the former, affirmative hashtag. Based on a multimethod analysis of 74,047 tweets containing #JeNeSuisPasCharlie posted between 7 and 11 January, this article reveals that users of the hashtag under study employed various discursive strategies and tactics to challenge the mainstream framing of the shooting as the universal value of freedom of expression being threatened by religious extremism, while protecting themselves from the risk of being viewed as disrespecting victims or endorsing the violence committed. The significance of this study is twofold. First, it extends the literature on strategic speech acts by examining how such acts take place in a social media context. Second, it highlights the need for a multidimensional and reflective methodology when dealing with data mined from social media. </jats:p>",
      "license": [
        "https://journals.sagepub.com/page/policies/text-and-data-mining-license"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/1369118x.2016.1203970",
      "title": "Networked intimacy. Intimacy and friendship among Italian Facebook users",
      "authors": "Farci, Manolo; Rossi, Luca; Boccia Artieri, Giovanni; Giglietto, Fabio",
      "venue": "Information, Communication &amp; Society",
      "year": 2017,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/1369118x.2016.1203970",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Information, Communication &amp; Society",
      "page": "784-801",
      "volume": "20",
      "issue": "5",
      "issn": "1369-118X",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [
        {
          "name": "Ministero dell\\'Istruzione, dell\\'Università e della Ricerca",
          "award": [
            "PRIN 2009SRXSW5 Relazioni sociali ed identita' in"
          ]
        }
      ],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/08838151.2016.1164162",
      "title": "Twitter Use During TV: A Full-Season Analysis of #serviziopubblico Hashtag",
      "authors": "Rossi, Luca; Giglietto, Fabio",
      "venue": "Journal of Broadcasting &amp; Electronic Media",
      "year": 2016,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/08838151.2016.1164162",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Journal of Broadcasting &amp; Electronic Media",
      "page": "331-346",
      "volume": "60",
      "issue": "2",
      "issn": "0883-8151",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/sc2015-049002",
      "title": "Limiti e possibilità degli online social data",
      "authors": "Giglietto, Fabio; Rossi, Luca",
      "venue": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "year": 2015,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/sc2015-049002",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "page": "9-18",
      "issue": "49",
      "issn": "1121-1733",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/1369118x.2015.1006658",
      "title": "Hybrid spaces of politics: the 2013 general elections in Italy, between talk shows and Twitter",
      "authors": "Iannelli, Laura; Giglietto, Fabio",
      "venue": "Information, Communication &amp; Society",
      "year": 2015,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/1369118x.2015.1006658",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Information, Communication &amp; Society",
      "page": "1006-1021",
      "volume": "18",
      "issue": "9",
      "issn": "1369-118X",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/sc2013-046005",
      "title": "Social tv: audience engagement e auto-rappresentazione dell'identità in rete",
      "authors": "Giglietto, Fabio; Selva, Donatella",
      "venue": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "year": 2014,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/sc2013-046005",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "page": "51-73",
      "issue": "46",
      "issn": "1121-1733",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/sc2014-048002",
      "title": "Il fascicolo sanitario elettronico fra micro e macro",
      "authors": "Giglietto, Fabio; Mazzoli, Lella",
      "venue": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "year": 2014,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/sc2014-048002",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "page": "9-25",
      "issue": "48",
      "issn": "1121-1733",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.4256/mio.2012.003",
      "title": "Ethics and Interdisciplinarity in Computational Social Science",
      "authors": "Giglietto, Fabio; Rossi, Luca",
      "venue": "Methodological Innovations Online",
      "year": 2012,
      "type": "journal-article",
      "url": "https://doi.org/10.4256/mio.2012.003",
      "crossref_type": "journal-article",
      "publisher": "SAGE Publications",
      "container_title": "Methodological Innovations Online",
      "page": "25-36",
      "volume": "7",
      "issue": "1",
      "issn": "1748-0612",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p> During the last few years a growing amount of content produced by Internet users has become publicly available online. These data come from a variety of places, including popular social web services like Facebook and Twitter, consumer services like Amazon or weblogs. </jats:p><jats:p> The research opportunities opened up by this socio-technological innovation are, as shown by the growing literature on the topic, huge. At the same time new challenges for social scientists arise. In this paper we will focus on two of the main challenges posed to the growth of the so-called computational social science: interdisciplinarity and ethics. While the searchability and persistence of this information make it ideal for sociological research, a quantitative approach is still challenging because of the size and complexity of the data. </jats:p><jats:p> Collecting, storing and analyzing these data often require technical skills beyond the traditional curricula of social scientists. These projects require, in fact, collaboration with computer scientists. Nevertheless developing a common interdisciplinary project is often challenging because of the different backgrounds of the researchers. </jats:p><jats:p> At the same time the availability of this content poses a challenge concerning privacy and research ethics. Due to the amount of data and the fact that the real identity of the author is often hidden behind a nickname, it is often impossible to ask the subject involved to consent to the use of their data. On the other hand, especially in the first wave of web 2.0, this information has been – intentionally or not – publicly shared by the users. While a technique of dis-embedding the identity of the user from the content analyzed is often the solution used to bypass this issue, an even more important privacy-related challenge for computational social science is emerging. Due to the wide adoption of social network sites such Facebook or Google+, where a user may decide to share his content with his/her group of friends only, the amount of public data will change and decrease in the future. We will discuss this issue by enumerating a number of possible future scenarios. </jats:p>",
      "license": [
        "https://journals.sagepub.com/page/policies/text-and-data-mining-license"
      ],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.1982736",
      "title": "If Likes Were Votes: An Empirical Study on the 2011 Italian Administrative Elections",
      "authors": "Giglietto, Fabio",
      "venue": "SSRN Electronic Journal",
      "year": 2012,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.1982736",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1145/2317307.2317316",
      "title": "Moving towards a socially-driven internet architectural design",
      "authors": "Sofia, Rute; Mendes, Paulo; Damásio, Manuel José; Henriques, Sara; Giglietto, Fabio; Giambitto, Erica; Bogliolo, Alessandro",
      "venue": "ACM SIGCOMM Computer Communication Review",
      "year": 2012,
      "type": "journal-article",
      "url": "https://doi.org/10.1145/2317307.2317316",
      "crossref_type": "journal-article",
      "publisher": "Association for Computing Machinery (ACM)",
      "container_title": "ACM SIGCOMM Computer Communication Review",
      "page": "39-46",
      "volume": "42",
      "issue": "3",
      "issn": "0146-4833",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>This paper provides an interdisciplinary perspective concerning the role of prosumers on future Internet design based on the current trend of Internet user empowerment. The paper debates the prosumer role, and addresses models to develop a symmetric Internet architecture and supply-chain based on the integration of social capital aspects. It has as goal to ignite the discussion concerning a socially-driven Internet architectural design.</jats:p>",
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1080/1369118x.2010.516760",
      "title": "Hanging Out, Messing Around, and Geeking Out: Kids Living and Learning with New Media (John D. and Catherine T. MacArthur Foundation Series on Digital Media and Learning)",
      "authors": "Giglietto, Fabio",
      "venue": "Information, Communication &amp; Society",
      "year": 2011,
      "type": "journal-article",
      "url": "https://doi.org/10.1080/1369118x.2010.516760",
      "crossref_type": "journal-article",
      "publisher": "Informa UK Limited",
      "container_title": "Information, Communication &amp; Society",
      "page": "172-174",
      "volume": "14",
      "issue": "1",
      "issn": "1369-118X",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/sc2009-040002",
      "title": "Modernity 2.0: dove sociocibernetica e Internet Studies si incontrano",
      "authors": "Giglietto, Fabio",
      "venue": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "year": 2010,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/sc2009-040002",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "page": "9-11",
      "issue": "40",
      "issn": "1121-1733",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>La gran parte degli internet studies č oggi dedicata a riflettere sull'impatto dei cosiddetti social media. Al contrario, questo fenomeno č stato a lungo un tema marginale nella comunitŕ scientifica che si richiama alla tradizione di Norbert Wiener, von Bertalanffy e Heinz von Foerster. Anche le applicazioni piů strettamente sociologiche della cibernetica, ispirate alle teorie sviluppate da Talcott Parsons e Niklas Luhmann, sono raramente dedicate allo studio dei media o di internet e quasi mai a quello dei social media. Ciň nonostante, e questa č l'ipotesi sulla quale si č basato l'intero impianto della conferenza Modernity 2.0, gli strumenti teorici resi disponibili dalla sociocibernetica, disciplina che affonda le sue radici proprio nello studio dei primi sistemi uomo-macchina in grado di auto-regolarsi, possono rivelarsi uno strumento utile a supporto degli internet studies.</jats:p>",
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.3280/sc2009-039004",
      "title": "La semantica dei sistemi sociali negli spazi mediati di rete: nuove prospettive di ricerca per le scenze sociali",
      "authors": "Giglietto, Fabio",
      "venue": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "year": 2009,
      "type": "journal-article",
      "url": "https://doi.org/10.3280/sc2009-039004",
      "crossref_type": "journal-article",
      "publisher": "Franco Angeli",
      "container_title": "SOCIOLOGIA DELLA COMUNICAZIONE",
      "page": "41-59",
      "issue": "39",
      "issn": "1121-1733",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.2306512",
      "title": "Exploring Correlations Between TV Viewership and Twitter Conversations in Italian Political Talk Shows",
      "authors": "Giglietto, Fabio",
      "venue": "SSRN Electronic Journal",
      "year": 2013,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.2306512",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.2345240",
      "title": "Second Screen and Participation: A Content Analysis of a Full Season Dataset of Tweets",
      "authors": "Giglietto, Fabio; Selva, Donatella",
      "venue": "SSRN Electronic Journal",
      "year": 2013,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.2345240",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.1978393",
      "title": "Social Media and Italian Universities: An Empirical Study on the Adoption and Use of Facebook, Twitter and Youtube",
      "authors": "Lovari, Alessandro; Giglietto, Fabio",
      "venue": "SSRN Electronic Journal",
      "year": 2012,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.1978393",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.2256368",
      "title": "Social TV: Audience Engagement E Autorappresentazione Dell’identita’ in Rete (Social TV: Networked Publics Between Engagement and Identity Construction)",
      "authors": "Giglietto, Fabio; Selva, Donatella",
      "venue": "SSRN Electronic Journal",
      "year": 2013,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.2256368",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.2501856",
      "title": "Testi, Consumi Mediali E Pubblici Produttivi in Italia. Analisi Delle Pratiche Di Social TV Da #XF6 a #Serviziopubblico (From #XF6 to #ServizioPubblico Cross-Genre Analysis of TV Audience Participatory Practices in Italy)",
      "authors": "Boccia Artieri, Giovanni; Gemini, Laura; Giglietto, Fabio; Orefice, Mario",
      "venue": "SSRN Electronic Journal",
      "year": 2014,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.2501856",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.2611083",
      "title": "Understanding Engagement and Willingness to Speak Up in Social-Television: A Full-Season, Cross-Genre Analysis of TV Audience Participation on Twitter",
      "authors": "Giglietto, Fabio; Boccia Artieri, Giovanni; Gemini, Laura; Orefice, Mario",
      "venue": "SSRN Electronic Journal",
      "year": 2015,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.2611083",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.2139/ssrn.1963743",
      "title": "Understanding the Online News Consumer: A Comparative Study Between Italy and United States (L’Informazione da Rito a Puzzle - Le News e Gli Italiani: Dalla Carta Stampata, Alla Rete al Mobile)",
      "authors": "Giglietto, Fabio; Mazzoli, Lella; Orefice, Mario; Bellafiore, Alessandro",
      "venue": "SSRN Electronic Journal",
      "year": 2012,
      "type": "journal-article",
      "url": "https://doi.org/10.2139/ssrn.1963743",
      "crossref_type": "journal-article",
      "publisher": "Elsevier BV",
      "container_title": "SSRN Electronic Journal",
      "issn": "1556-5068",
      "isbn": null,
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.4337/9781800374263.social.tv.second",
      "title": "Social TV and second screen",
      "authors": "Giglietto, Fabio",
      "venue": "Elgar Encyclopedia of Technology and Politics",
      "year": 2022,
      "type": "book-chapter",
      "url": "https://doi.org/10.4337/9781800374263.social.tv.second",
      "crossref_type": "book-chapter",
      "publisher": "Edward Elgar Publishing",
      "container_title": "Elgar Encyclopedia of Technology and Politics",
      "page": "59-61",
      "issn": null,
      "isbn": "9781800374263",
      "subject": [],
      "abstract": null,
      "license": [],
      "funder": [],
      "crossref_score": 1
    },
    {
      "doi": "10.1609/aimag.v37i4.2692",
      "title": "Reports of the Workshops Held at the 2016 International AAAI Conference on Web and Social Media",
      "authors": "An, Jisun; Crandall, David J.; Fedorov, Roman; Fiesler, Casey; Giglietto, Fabio; Heravi, Bahareh; Pater, Jessica; Pelechrinis, Konstantinos; Quercia, Daniele; Weller, Katrin; Zubiaga, Arkaitz",
      "venue": "AI Magazine",
      "year": 2016,
      "type": "journal-article",
      "url": "https://doi.org/10.1609/aimag.v37i4.2692",
      "crossref_type": "journal-article",
      "publisher": "Wiley",
      "container_title": "AI Magazine",
      "page": "89-93",
      "volume": "37",
      "issue": "4",
      "issn": "0738-4602",
      "isbn": null,
      "subject": [],
      "abstract": "<jats:p>The workshop program of the Association for the Advancement of Artificial Intelligence's International Conference on Web and Social Media (AAAI‐16) was held in Cologne, Germany. There were eight workshops in the program: CityLab, Challenges and Futures for Ethical Social Media Research, Social Media and Demographic Research, Wiki, #Fail: Things That Didn't Work Out in Social Media Research — And What We Can Learn from Them, News and Public Opinion, Social Media in the Newsroom, and Social Web for Environmental and Ecological Monitoring. Workshops were held on the first day of the conference, Tuesday, May 17, 2016. Workshop participants met and discussed issues with a selected focus — providing an informal setting for active exchange among researchers, developers, and users on topics of current interest. Of the eight workshops held at the conference; organizers from only five included papers in the AAAI Technical Reports series, and organizers from six workshops submitted reports.</jats:p>",
      "license": [
        "http://onlinelibrary.wiley.com/termsAndConditions#vor"
      ],
      "funder": [],
      "crossref_score": 1
    }
  ],
  "lastUpdated": "2025-06-05T02:07:44.466Z",
  "metadata": {
    "total_requested": 81,
    "successful_requests": 50,
    "failed_requests": 31
  }
}