{
  "profile": {
    "name": "Fabio Giglietto",
    "affiliations": [],
    "homepage": null
  },
  "publications": [
    {
      "title": "Second Screen and Participation: A Content Analysis on a Full Season Dataset of Tweets",
      "authors": "Fabio Giglietto, Donatella Selva",
      "venue": "",
      "year": 2014,
      "doi": "10.1111/JCOM.12085",
      "arxivId": null,
      "citations": 210,
      "influentialCitations": 16,
      "references": 64,
      "semanticScholarId": "7d468c2577c420949c2b32583684c03b519190bf",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The practice of using a “second screen” while following a television program is quickly becoming a widespread phenomenon. When the secondary device is used for comments about programs, most discussions take place on popular social media such as Facebook and Twitter. Previous research pointed out the value of these conversations in understanding the behavior of “networked publics.” Building upon this background, this article presents the first study on a complete dataset of tweets (2,489,669) that span an entire season of a TV genre (1,076 episodes of talk shows). A content analysis of the tweets created during the season's most engaging moments indicates a relationship between typology of broadcasted scenes, style of comments, and the way participation (audience and political) is played.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "The Open Laboratory: Limits and Possibilities of Using Facebook, Twitter, and YouTube as a Research Data Source",
      "authors": "Fabio Giglietto, L. Rossi, Davide Bennato",
      "venue": "",
      "year": 2012,
      "doi": "10.1080/15228835.2012.743797",
      "arxivId": null,
      "citations": 139,
      "influentialCitations": 4,
      "references": 62,
      "semanticScholarId": "7b88268bdcfa24f2682aef645ef5c3aa11ea7c01",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "It takes a village to manipulate the media: coordinated link sharing behavior during 2018 and 2019 Italian elections",
      "authors": "Fabio Giglietto, Nicola Righetti, L. Rossi, Giada Marino",
      "venue": "Information, Communication & Society",
      "year": 2020,
      "doi": "10.1080/1369118X.2020.1739732",
      "arxivId": null,
      "citations": 103,
      "influentialCitations": 11,
      "references": 86,
      "semanticScholarId": "a8b5ebbca42d8760de06f3271caa5a9d09db0c85",
      "isOpenAccess": true,
      "openAccessPdf": "https://pure.itu.dk/portal/files/85402374/It_takes_a_village_to_manipulate_the_media.pdf",
      "abstract": "ABSTRACT Over the last few years, a proliferation of attempts to define, understand and fight the spread of problematic information in contemporary media ecosystems emerged. Most of these attempts focus on false content and/or bad actors detection. In this paper, we argue for a wider ecological focus. Using the frame of media manipulation and a revised version of the ‘coordinated inauthentic behavior’ original definition, the paper presents a study based on an unprecedented combination of Facebook data, accessed through the CrowdTangle API, and two datasets of Italian political news stories published in the run-up to the 2018 Italian general election and 2019 European election. By focusing on actors’ collective behavior, we identified several networks of pages, groups, and verified public profiles (‘entities’), that shared the same political news articles on Facebook within a very short period of time. Some entities in our networks were openly political, while others, despite sharing political content too, deceptively presented themselves as entertainment venues. The proportion of inauthentic entities in a network affects the wideness of the range of news media sources they shared, thus pointing to different strategies and possible motivations. The paper has both theoretical and empirical implications: it frames the concept of ‘coordinated inauthentic behavior’ in existing literature, introduces a method to detect coordinated link sharing behavior and points out different strategies and methods employed by networks of actors willing to manipulate the media and public opinion.",
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Nathaniel Persily e Joshua A. Tucker (a cura di). Social Media and Democracy. The State of the Field, Prospects for Reform",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2021,
      "doi": "10.3270/100321",
      "arxivId": null,
      "citations": 84,
      "influentialCitations": 3,
      "references": 68,
      "semanticScholarId": "805412ad610c0d74282e6a345f2acbf569c7078b",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "‘Fake news’ is the invention of a liar: How false information circulates within the hybrid news system",
      "authors": "Fabio Giglietto, L. Iannelli, A. Valeriani, L. Rossi",
      "venue": "Current Sociology",
      "year": 2018,
      "doi": "10.1177/0011392119837536",
      "arxivId": null,
      "citations": 82,
      "influentialCitations": 1,
      "references": 62,
      "semanticScholarId": "c84a169e6df175c4662012d3ba7dbf8fa1b5abc9",
      "isOpenAccess": true,
      "openAccessPdf": "https://pure.itu.dk/portal/files/83995855/CSI837536_fg_av_lr.pdf",
      "abstract": "Alarmed by the oversimplifications related to the ‘fake news’ buzzword, researchers have started to unpack the concept, defining diverse types and forms of misleading news. Most of the existing works in the area consider crucial the intent of the content creator in order to differentiate among different types of problematic information. This article argues for a change of perspective that, by leveraging the conceptual framework of sociocybernetics, shifts from exclusive attention to creators of misleading information to a broader approach that focuses on propagators and, as a result, on the dynamics of the propagation processes. The analytical implications of this perspective are discussed at a micro level (criteria to judge the falsehood of news and to decide to spread it), at a meso level (four possible relations between individual judgements and decisions), and at a macro level (global circulation cascades). The authors apply this theoretical gaze to analyse ‘fake news’ stories that challenge existing models.",
      "fieldsOfStudy": [
        "Art",
        "Sociology"
      ]
    },
    {
      "title": "A Hashtag Worth a Thousand Words: Discursive Strategies Around #JeNeSuisPasCharlie After the 2015 Charlie Hebdo Shooting",
      "authors": "Fabio Giglietto, Yenn Lee",
      "venue": "",
      "year": 2017,
      "doi": "10.1177/2056305116686992",
      "arxivId": null,
      "citations": 61,
      "influentialCitations": 4,
      "references": 47,
      "semanticScholarId": "1a415874dbd4a3571d10ce4073a7ed505f0c66fc",
      "isOpenAccess": true,
      "openAccessPdf": "https://journals.sagepub.com/doi/pdf/10.1177/2056305116686992",
      "abstract": "Following a shooting attack by two self-proclaimed Islamist gunmen at the offices of French satirical weekly Charlie Hebdo on 7 January 2015, there emerged the hashtag #JeSuisCharlie on Twitter as an expression of solidarity and support for the magazine’s right to free speech. Almost simultaneously, however, there was also #JeNeSuisPasCharlie explicitly countering the former, affirmative hashtag. Based on a multimethod analysis of 74,047 tweets containing #JeNeSuisPasCharlie posted between 7 and 11 January, this article reveals that users of the hashtag under study employed various discursive strategies and tactics to challenge the mainstream framing of the shooting as the universal value of freedom of expression being threatened by religious extremism, while protecting themselves from the risk of being viewed as disrespecting victims or endorsing the violence committed. The significance of this study is twofold. First, it extends the literature on strategic speech acts by examining how such acts take place in a social media context. Second, it highlights the need for a multidimensional and reflective methodology when dealing with data mined from social media.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Facebook Digital Traces for Survey Research: Assessing the Efficiency and Effectiveness of a Facebook Ad–Based Procedure for Recruiting Online Survey Respondents in Niche and Difficult-to-Reach Populations",
      "authors": "L. Iannelli, Fabio Giglietto, L. Rossi, Elisabetta Zurovac",
      "venue": "Social science computer review",
      "year": 2018,
      "doi": "10.1177/0894439318816638",
      "arxivId": null,
      "citations": 37,
      "influentialCitations": 0,
      "references": 42,
      "semanticScholarId": "ed3dbf400b5349482ce280354a62067599399448",
      "isOpenAccess": true,
      "openAccessPdf": "https://ora.uniurb.it/bitstream/11576/2663342/11/Iannelli_Giglietto_Rossi_Zurovac_2020_Accepted_Manuscript.pdf",
      "abstract": "Survey-based studies are increasingly experimenting with strategies that employ digital footprints left by users on social media as entry points for recruiting participants and complementary data sources. In this perspective, the Facebook advertising platform provides unique opportunities and challenges through its marketing tools that target advertisements based on users’ demographics, behaviors, and interests. This article presents a procedure that employed the most recent developments in Facebook marketing tools to evaluate the efficiency and effectiveness of an innovative method for recruiting niche and traditionally hard-to-reach respondents. Although the multiple innovations introduced in the method hinder a proper comparison with previous studies, the survey provides evidence concerning the efficacy of the procedure and offers scholars a set of implementations to design future comparable Facebook ad–based surveys. Challenges, opportunities, and results for effectiveness are discussed in light of a previous survey on Italian adults carried out with a panel-based computer-assisted web interviewing method.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Fakes, News and the Election: A New Taxonomy for the Study of Misleading Information within the Hybrid Media System",
      "authors": "Fabio Giglietto, L. Iannelli, L. Rossi, A. Valeriani",
      "venue": "",
      "year": 2016,
      "doi": null,
      "arxivId": null,
      "citations": 34,
      "influentialCitations": 1,
      "references": 40,
      "semanticScholarId": "0aff44580981341b60167096de932173cb3190ec",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "To Be or Not to Be Charlie: Twitter Hashtags as a Discourse and Counter-discourse in the Aftermath of the 2015 Charlie Hebdo Shooting in France",
      "authors": "Fabio Giglietto, Yenn Lee",
      "venue": "#MSM",
      "year": 2015,
      "doi": null,
      "arxivId": null,
      "citations": 31,
      "influentialCitations": 2,
      "references": 25,
      "semanticScholarId": "4f907f3b4b2bacb91b2245601b59a9494fed8c32",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Computer Science",
        "Art",
        "Geography"
      ]
    },
    {
      "title": "Coordinated Link Sharing Behavior as a Signal to Surface Sources of Problematic Information on Facebook",
      "authors": "Fabio Giglietto, Nicola Righetti, L. Rossi, Giada Marino",
      "venue": "International Conference on Social Media & Society",
      "year": 2020,
      "doi": "10.1145/3400806.3400817",
      "arxivId": null,
      "citations": 30,
      "influentialCitations": 3,
      "references": 50,
      "semanticScholarId": "203da29a37a983c487ce75a894b0d70698077bf5",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "Despite widespread concern over the role played by disinformation during recent electoral processes, the intrinsic elusiveness of the subject hinders efforts aimed at estimating its prevalence and effect. While there has been proliferation of attempts to define, understand and fight the spread of problematic information in contemporary media ecosystems, most of these attempts focus on detecting false content and/or bad actors. For instance, several existing studies rely on lists of problematic content or news media sources compiled by fact-checkers. However, these lists may quickly become obsolete leading to unreliable estimates. Using media manipulation as a frame, along with a revised version of the “coordinated inauthentic behavior” original definition, in this paper, we argue for a wider ecological focus. Leveraging a method designed to detect “coordinated links sharing behavior” (CLSB), we introduce and assess an approach aimed at creating and keeping lists of potentially problematic sources updated by analyzing the URLs shared on Facebook by public groups, pages, and verified profiles. We show how CLSB is consistently associated with higher risks of encountering problematic news sources across three different datasets of news stories and can be thus used as a signal to support manual and automatic detection of problematic information.",
      "fieldsOfStudy": [
        "Political Science",
        "Computer Science"
      ]
    },
    {
      "title": "Networked intimacy. Intimacy and friendship among Italian Facebook users",
      "authors": "Manolo Farci, L. Rossi, Giovanni Boccia Artieri, Fabio Giglietto",
      "venue": "",
      "year": 2017,
      "doi": "10.1080/1369118X.2016.1203970",
      "arxivId": null,
      "citations": 24,
      "influentialCitations": 1,
      "references": 102,
      "semanticScholarId": "c19a8bd4a13366e0739cf0eea322c86340826cf8",
      "isOpenAccess": true,
      "openAccessPdf": "https://ora.uniurb.it/bitstream/11576/2636430/1/Networked%20intimacy%20Intimacy%20and%20friendship%20among%20Italian%20Facebook%20users.pdf",
      "abstract": null,
      "fieldsOfStudy": [
        "Psychology"
      ]
    },
    {
      "title": "Twitter Use During TV: A Full-Season Analysis of #serviziopubblico Hashtag",
      "authors": "L. Rossi, Fabio Giglietto",
      "venue": "",
      "year": 2016,
      "doi": "10.1080/08838151.2016.1164162",
      "arxivId": null,
      "citations": 24,
      "influentialCitations": 1,
      "references": 38,
      "semanticScholarId": "f63228013e6491da1026e256acc5033430f41b9a",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Psychology"
      ]
    },
    {
      "title": "If Likes Were Votes: An Empirical Study on the 2011 Italian Administrative Elections",
      "authors": "Fabio Giglietto",
      "venue": "International Conference on Web and Social Media",
      "year": 2012,
      "doi": "10.2139/ssrn.1982736",
      "arxivId": null,
      "citations": 24,
      "influentialCitations": 1,
      "references": 28,
      "semanticScholarId": "dbc3773ad563818b1bd074874d52bc70405f8020",
      "isOpenAccess": true,
      "openAccessPdf": "https://cdn.aaai.org/ojs/14286/14286-28-17804-1-2-20201228.pdf",
      "abstract": "\n \n Is it possible to forecast electoral results by analyzing social media conversations? This paper aims to contribute to the debate raised by authors claiming to have successfully predicted the outcomes of an election from Twitter or Facebook data. Our work tested the purported predictive power of social media metrics against the 2011 Italian administrative elections. During the months before the election day, we collected the amount of Likes received on the Facebook pages of 229 candidates running for the mayor offices of the 29 provincial capitals. We built two forecast models with the goal of predicting the outcomes of the elections: the aim of the first one was to predict the candidates’ vote shares, while the second was to forecast the name of the winning candidate. We found a non-significant correlation between the share of candidate popularity on Facebook and the respective share of votes. However, in 39% of the cases, the most popular candidate on Facebook actually won the contest, and in another 43%, that candidate came in second. The contribution to the ongoing debate is therefore two-sided: on the one hand, we provide a new case study from a cultural context and political system never analyzed before by this kind of study; on the other side, we propose two forecasting models that, although proven to be partially unsuccessful, can provide a foundation for improved forecasting models.\n \n",
      "fieldsOfStudy": [
        "Computer Science",
        "Sociology"
      ]
    },
    {
      "title": "Mapping Italian News Media Political Coverage in the Lead-Up to 2018 General Election",
      "authors": "Fabio Giglietto, L. Iannelli, L. Rossi, A. Valeriani, Nicola Righetti, Francesca Carabini, Giada Marino, S. Usai, Elisabetta Zurovac",
      "venue": "",
      "year": 2018,
      "doi": "10.2139/SSRN.3179930",
      "arxivId": null,
      "citations": 22,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "974eaf424049146afb7b62c740be5f66e8b2668c",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "This study presents an analysis of the online media coverage in the run up to 2018 Italian General election. We illustrate how immigration, corruption and privileges of the elite – also related to a certain rhetoric on the inability of the state to protect the rights of the needy – were in fact the most salient topics throughout the months before and during the election. Both topics were largely central in both Salvini’s League and Di Maio’s Five Stars Movement agenda. Nevertheless, the leaders most frequently cited in online news articles were Matteo Renzi (PD) and Silvio Berlusconi (Forza Italia). By deep diving into the contents of main leaders media coverage and respective social media engagement we document the centrality of stories unravelling around leaders’ legal issues, alleged collusion and scandals. \n \nWhile the media clusters emerging from the network analysis clearly resembles the tripartite structure of the contemporary Italian politics articulated in centre-left, centre-right and Five Stars Movement, the different weight and articulation within each cluster clearly describe the strengths of M5S and centre-right (largely dominated by the League) and the weakness of the centre-left. \n \nWhile our analysis depicted a clear profile of the actors and topics that catalyzed the highest social media interactions and thus attention, we also illustrate a number of strategies employed by different communities to amplify the reach of contents aligned with own worldview while reframing negative coverage through comments. Overall, explicitly partisan and hyper-partisan sources catalyzed a significant share of the social media interactions performed by the online audience in the lead up of the election. \n \nThe analysis includes the evaluation and mapping of the Italian media landscape from several perspectives and is based on large-scale data collection of online news articles published on the web, shared and interacted on Facebook and Twitter.",
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Ethics and Interdisciplinarity in Computational Social Science",
      "authors": "Fabio Giglietto, L. Rossi",
      "venue": "",
      "year": 2012,
      "doi": "10.4256/mio.2012.003",
      "arxivId": null,
      "citations": 21,
      "influentialCitations": 0,
      "references": 33,
      "semanticScholarId": "b91a9c0cc4369a8dccd94a2a210efff3e6fe47b8",
      "isOpenAccess": true,
      "openAccessPdf": "https://journals.sagepub.com/doi/pdf/10.4256/mio.2012.003",
      "abstract": "During the last few years a growing amount of content produced by Internet users has become publicly available online. These data come from a variety of places, including popular social web services like Facebook and Twitter, consumer services like Amazon or weblogs. The research opportunities opened up by this socio-technological innovation are, as shown by the growing literature on the topic, huge. At the same time new challenges for social scientists arise. In this paper we will focus on two of the main challenges posed to the growth of the so-called computational social science: interdisciplinarity and ethics. While the searchability and persistence of this information make it ideal for sociological research, a quantitative approach is still challenging because of the size and complexity of the data. Collecting, storing and analyzing these data often require technical skills beyond the traditional curricula of social scientists. These projects require, in fact, collaboration with computer scientists. Nevertheless developing a common interdisciplinary project is often challenging because of the different backgrounds of the researchers. At the same time the availability of this content poses a challenge concerning privacy and research ethics. Due to the amount of data and the fact that the real identity of the author is often hidden behind a nickname, it is often impossible to ask the subject involved to consent to the use of their data. On the other hand, especially in the first wave of web 2.0, this information has been – intentionally or not – publicly shared by the users. While a technique of dis-embedding the identity of the user from the content analyzed is often the solution used to bypass this issue, an even more important privacy-related challenge for computational social science is emerging. Due to the wide adoption of social network sites such Facebook or Google+, where a user may decide to share his content with his/her group of friends only, the amount of public data will change and decrease in the future. We will discuss this issue by enumerating a number of possible future scenarios.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Hybrid spaces of politics: the 2013 general elections in Italy, between talk shows and Twitter",
      "authors": "L. Iannelli, Fabio Giglietto",
      "venue": "",
      "year": 2015,
      "doi": "10.1080/1369118X.2015.1006658",
      "arxivId": null,
      "citations": 20,
      "influentialCitations": 0,
      "references": 68,
      "semanticScholarId": "0bf55eb8214a63a60884914ed101a87e622e67ac",
      "isOpenAccess": true,
      "openAccessPdf": "https://ora.uniurb.it/bitstream/11576/2610183/4/Iannelli_Giglietto_Hybrid%20Spaces%20of%20Politics.pdf",
      "abstract": null,
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Social Media and Italian Universities: An Empirical Study on the Adoption and Use of Facebook, Twitter and Youtube",
      "authors": "A. Lovari, Fabio Giglietto",
      "venue": "",
      "year": 2012,
      "doi": "10.2139/ssrn.1978393",
      "arxivId": null,
      "citations": 20,
      "influentialCitations": 0,
      "references": 31,
      "semanticScholarId": "e61d7d8121330d7328ce23852a8e6b262288c054",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The aim of the paper is to investigate the use of social media by Italian universities as communication and relational tools. An analysis of the 95 Italian higher education institutions highlights how nearly half of the universities (51.6%) have an official presence on at least one social media. In particular, private institutions and small-medium size universities are those that are mostly embracing the relational potentialities of these participatory media. Finally, in order to evaluate the social media performances of the analyzed institutions, we introduce the 'university social media performance index' (USMPI).Implications for public relation research and practices are discussed.",
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Diverging patterns of interaction around news on social media: insularity and partisanship during the 2018 Italian election campaign",
      "authors": "Fabio Giglietto, A. Valeriani, Nicola Righetti, Giada Marino",
      "venue": "Information, Communication & Society",
      "year": 2019,
      "doi": "10.1080/1369118X.2019.1629692",
      "arxivId": null,
      "citations": 16,
      "influentialCitations": 0,
      "references": 65,
      "semanticScholarId": "d821bbc7ab0d67ab46796ea43b7158708227b43b",
      "isOpenAccess": true,
      "openAccessPdf": "https://ora.uniurb.it/bitstream/11576/2668426/2/post-print%20for%20ora.uniurb.it%20.pdf",
      "abstract": "ABSTRACT The paper considers how social media ecologies are affecting partisan engagement around political news and online attention economies by investigating the case of the 2018 Italian general election. By analyzing Twitter and Facebook interactions around political news in the lead-up to the election, we shed light on levels of insularity characterizing sources preferred by different partisan communities and investigate how specific patterns of active attention emerge around different sources and around stories proposing different framing of specific political actors. Our findings indicate that, on Twitter, sources mainly shared by supporters of populist parties (the Five Star Movement and the League) are characterized by higher levels of insularity compared to those shared by supporters of other parties. We also find that, on Facebook, news items published by highly insular sources receive a higher number of shares per comment. Finally, our analyses show that news presenting a positive framing of the Five Star Movement – the unique ‘cyber party’ in the system – receives a higher number of shares per comment compared to items presenting the Movement in a negative light, while the opposite is true for stories on all other political parties.",
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Understanding Coordinated and Inauthentic Link Sharing Behavior on Facebook in the Run-up to 2018 General Election and 2019 European Election in Italy",
      "authors": "Fabio Giglietto, Nicola Righetti, Giada Marino",
      "venue": "",
      "year": 2019,
      "doi": "10.31235/osf.io/3jteh",
      "arxivId": null,
      "citations": 15,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "b90411f85dcef4a57ffcb6e33586b181e77622a6",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The year 2016 marked a turning point in the history of relations between the Internet, social media, public opinion, and politics. Online practices of grassroots participation, which used to be considered the prerogative of democratizing forces fighting established powers, turned out to be an effective platform for far-right extremists. In the attempt to make sense of what happened and develop workable solutions, stakeholders rapidly moved through the different stages of grief, ranging from denial to anger and acceptance.As a case in point, we trace the path through these stages which moved from an initial denial of the problem to concern over “fake news” and hoaxes, to finally focusing on the behavior of certain actors on the platform. Starting from the current phase, we analyze “coordinated inauthentic behavior”, a concept only briefly defined in Facebook public statements which, nevertheless, is useful to frame future studies insofar as both the idea of coordination and authenticity have been studied in the literature. Leveraging these works, we suggest a definition that is at once framed in this literature and easy to operationalize.Using this definition and an unprecedented combination of CrowdTangle API (a tool for accessing Facebook and other social media data) and two datasets of Italian political news stories published in the run-up to the 2018 Italian general election and 2019 European election, we developed a method that led to the identification of several networks of pages/groups/verified public profiles (“entities”) that shared the same political news stories on Facebook within a very short period of time (10 in 2018, composed of 28 entities, and 50 in 2019, composed of 143 entities). We call this behavior “coordinated link sharing”. By analyzing the social media profiles of such coordinated entities, we observed that while some of them were clearly political, others presented themselves as entertainment venues, despite sharing political content too. Since the political news stories shared by these non-political entities can reach a broad audience which is largely unguarded against attempts to influence, we describe their behavior as “inauthentic”.Further analyses showed that the news shared by the coordinated networks received a Facebook engagement higher than other news included in our dataset, that much news boosted anti-immigration and far-right propaganda and that several of the news outlets shared by these networks were already blacklisted by fact-checkers.",
      "fieldsOfStudy": []
    },
    {
      "title": "Multi-Party Media Partisanship Attention Score. Estimating Partisan Attention of News Media Sources Using Twitter Data in the Lead-up to 2018 Italian Election",
      "authors": "Fabio Giglietto, Nicola Righetti, Giada Marino, L. Rossi",
      "venue": "",
      "year": 2019,
      "doi": "10.3270/93030",
      "arxivId": null,
      "citations": 11,
      "influentialCitations": 0,
      "references": 47,
      "semanticScholarId": "45f43ead45f5c8fced42014f53411bc482dd0f0e",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The ongoing radical transformations in communication ecosystems have brought up concerns about the risks of partisan selective exposure and ideological polarization. Traditionally, partisan selective exposure is measured by cross-tabulating survey responses to questions on vote intentions and media consumption. This process is expensive, limits the number of news outlets taken into account and is prone to the typical biases of self-reported data. Building upon previous works and with a specific focus on the online media environment, we introduce a new method to measure partisan media attention in a multi-party political system using Twitter data from 2018 Italian general election. Our first research question addresses the effectiveness of this method by measuring the extent to which our estimates correlate with partisan newspaper consumption measured by the latest Italian National Election Studies (ITANES) survey. Once established the reliability of our method, we employ these scores and measures to analyze the Italian digital media ecosystem in the lead-up to March 2018 election. The traditionally high level of political parallelism that characterizes both the Italian press and TV sectors is only partially reflected in a digital media ecosystem where partisan news sources seem to coexist with cross-partisan outlets. Results also point out that certain online partisan communities tend to rely more on exclusive news media sources.",
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "You Are Fake News",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2018,
      "doi": null,
      "arxivId": null,
      "citations": 10,
      "influentialCitations": 1,
      "references": 0,
      "semanticScholarId": "5179d33e4b73201bb2969d53322a99667d78d3e1",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Art"
      ]
    },
    {
      "title": "Moving towards a socially-driven internet architectural design",
      "authors": "Rute C. Sofia, P. Mendes, M. Damásio, Sara Henriques, Fabio Giglietto, Erica Giambitto, A. Bogliolo",
      "venue": "CCRV",
      "year": 2012,
      "doi": "10.1145/2317307.2317316",
      "arxivId": "1508.01087",
      "citations": 10,
      "influentialCitations": 0,
      "references": 33,
      "semanticScholarId": "9c3d8469098969eb207ef8ab0a0e274349cce661",
      "isOpenAccess": true,
      "openAccessPdf": "http://arxiv.org/pdf/1508.01087",
      "abstract": "This paper provides an interdisciplinary perspective concerning the role of prosumers on future Internet design based on the current trend of Internet user empowerment. The paper debates the prosumer role, and addresses models to develop a symmetric Internet architecture and supply-chain based on the integration of social capital aspects. It has as goal to ignite the discussion concerning a socially-driven Internet architectural design.",
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Eyes on You: Analyzing User Generated Content for Social Science",
      "authors": "C. Fonio, Fabio Giglietto, Romeo Pruno, L. Rossi, Stefano Pedrioli",
      "venue": "",
      "year": 2007,
      "doi": null,
      "arxivId": null,
      "citations": 10,
      "influentialCitations": 0,
      "references": 11,
      "semanticScholarId": "194d6eb93a77b8a89b3645e9f4d8f76a9e440e2a",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Exploring Correlations Between TV Viewership and Twitter Conversations in Italian Political Talk Shows",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2013,
      "doi": "10.2139/SSRN.2306512",
      "arxivId": null,
      "citations": 7,
      "influentialCitations": 2,
      "references": 9,
      "semanticScholarId": "193bbe7c673347f7316923445ee0bffeaabc8387",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The practice of using a ‘second screen’ while following a television program is quickly becoming a widespread phenomenon. When the secondary device is used to read or contribute to online comments about a watched program, most of the discussion takes place on popular social media such as Facebook and Twitter. Previous research has shown that the analysis of these contents could lead to a better understanding of the behavior of 'networked publics' and of the structure of the show itself. Leveraging on this background, the paper presents what is, to our knowledge, the first attempt of creating a statistical model with the goal of predicting the audience of a TV show from Twitter activity. During the last TV season, we collected all the Tweets (2,497,885) containing at least one of the official hash-tags of the eleven political talk shows (1,077 episodes) aired by the Italian free-to-air broadcasters from August 2012 to June 2013. We found a significant correlation between the Tweet rate and Twitter contributors per minute during airtime and the audience of the show’s episode. On this premise, we trained a multiple regression model on a random sample of 538 episodes (R^2 = 0.96) and successfully tested the model on remaining observations.",
      "fieldsOfStudy": [
        "Geography"
      ]
    },
    {
      "title": "Understanding Engagement and Willingness to Speak Up in Social-Television: A Full-Season, Cross-Genre Analysis of TV Audience Participation on Twitter",
      "authors": "Fabio Giglietto, G. B. Artieri, L. Gemini, Mario Orefice",
      "venue": "",
      "year": 2015,
      "doi": "10.2139/SSRN.2611083",
      "arxivId": null,
      "citations": 6,
      "influentialCitations": 1,
      "references": 65,
      "semanticScholarId": "b6ee5bb0f075346d698004cdd695316ea61f02ae",
      "isOpenAccess": true,
      "openAccessPdf": "http://pdfs.semanticscholar.org/b6ee/5bb0f075346d698004cdd695316ea61f02ae.pdf",
      "abstract": "The practice of watching TV while using a secondary device is becoming a widespread social phenomenon. At the same time, a growing amount of studies, focus on users’ communicative behaviors while consuming specific TV programs or genres. Despite a diffuse scholarly interest on this issue, few studies compare different forms of online audience participation generated around different TV genres. This paper presents a full-season comparative study of live tweeting practices generated around a political talk show and a talent show. We focused on the following research questions: RQ1. What triggers active audience engagement in the two formats? RQ2. Do people tend to delegate or cover up the expression of opinion when the show deals with politics rather than entertainment? To answer these questions, from August 30 2012 to June 30 2013, we collected all tweets containing either the official hashtag of the political talk show Servizio Pubblico or the sixth Italian edition of X-Factor for a total amount of about 1 million tweets. For each episode (37), we identified peaks of Twitter engagement and observed the corresponding TV scene. We found that surprise and suspense play a different role in enacting online audience engagement. Further content analysis on a sample of eight peaks (13,189 coded tweets) confirmed the substantial difference in the way opinions are expressed when commenting on politics and entertainment.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "DETECTING COORDINATED LINK SHARING BEHAVIOR ON FACEBOOK DURING THE ITALIAN CORONAVIRUS OUTBREAK",
      "authors": "Fabio Giglietto, Nicola Righetti, Giada Marino",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2020,
      "doi": "10.5210/spir.v2020i0.11219",
      "arxivId": null,
      "citations": 5,
      "influentialCitations": 0,
      "references": 14,
      "semanticScholarId": "ea630a826d552705d0165e5eea396080b2f4c803",
      "isOpenAccess": true,
      "openAccessPdf": "https://spir.aoir.org/ojs/index.php/spir/article/download/11219/9807",
      "abstract": "Social media, as many scholars have shown, can be used to influence political behavior through coordinated disinformation campaigns in which participants pretend to be ordinary citizens. With a specific reference to Facebook, a recent study has spotlighted patterns of coordinated activity aimed at fueling online circulation of specific news stories before the 2018 and 2019 Italian elections, an activity called by the authors “Coordinated Link Sharing Behavior” (CLSB). More precisely, CLSB refers to the coordinated shares of the same news articles in a very short time by networks of entities composed by Facebook pages, groups and verified public profiles. The uncertainty related to the coronavirus outbreak is a unique chance for malicious actors to leverage the anxiety of online publics to reach their goals, filling the information void with problematic content. Considering the association between coordination, media manipulation, and problematic information, the entities involved in coordinated online activities represent a privileged perspective on these phenomena. Thus, against the backdrop of the literature and the already conducted studies, this proposal will discuss Coordinated Link Sharing Behavior in the context of the coronavirus outbreak informational void, analyzing network mutations over time and the content strategies used to exploit the ambiguity associated with the topic.",
      "fieldsOfStudy": [
        "Geography"
      ]
    },
    {
      "title": "Social Media and Elections: The Use of Twitter in the 2013 Campaigns in Italy, Australia, Germany, and Norway",
      "authors": "G. Enli, A. Larsson, B. Kalsnes, E. Skogerbø, Hallvard Moe, A. Bruns, Tim Highfield, T. Sauter, Christian Nuernbergk, J. Neubarth, L. Rossi, Fabio Giglietto, Mario Orefice, G. B. Artieri",
      "venue": "",
      "year": 2013,
      "doi": null,
      "arxivId": null,
      "citations": 5,
      "influentialCitations": 2,
      "references": 0,
      "semanticScholarId": "fc6834f48ac1c34cb92eab51518f22eb6be60bce",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "A Workflow to Detect, Monitor, and Update Lists of Coordinated Social Media Accounts Across Time: The Case of the 2022 Italian Election",
      "authors": "Fabio Giglietto, Giada Marino, Roberto Mincigrucci, Anna Stanziano",
      "venue": "Social Media + Society",
      "year": 2023,
      "doi": "10.1177/20563051231196866",
      "arxivId": null,
      "citations": 4,
      "influentialCitations": 0,
      "references": 58,
      "semanticScholarId": "9e31c21df6d8e134626bc15ecf9198a52fe3b83c",
      "isOpenAccess": true,
      "openAccessPdf": "https://journals.sagepub.com/doi/pdf/10.1177/20563051231196866",
      "abstract": "Information operations that target public opinion often exploit breaking news, crises, and elections by using coordinated social media actors to disseminate problematic content. These events often reveal the relationships between actors, prompting the creation of lists of malicious actors and news sources. However, relying on outdated lists may underestimate the prevalence and impact of such operations. This article presents a novel workflow to detect, monitor, and update lists of coordinated social media actors during and beyond peak activity periods. Using this approach, known problematic actors are constantly monitored, allowing the detection of new actors and the update of the monitored pool. The workflow was applied to the 2022 Italian snap election, leveraging previous research on coordinated inauthentic behavior during the 2018 and 2019 Italian elections. The initial list of 435 coordinated accounts was monitored, surfacing 1,022 overly shared or commented political posts, 272 coordinated links, and detecting 66 political and 554 generic coordinated accounts not previously listed. Three case studies were identified: one politically motivated, one click-economy driven, and one religiously motivated operation. The article discusses the implications of this approach, its limitations, and potential future work.",
      "fieldsOfStudy": []
    },
    {
      "title": "Social semantics in a networked space. New perspectives for social sciences",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2009,
      "doi": null,
      "arxivId": null,
      "citations": 4,
      "influentialCitations": 0,
      "references": 15,
      "semanticScholarId": "1bb517635c582e8eec098b6294393347aa20aff4",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Mapping Nefarious Social Media Actors to Speed-up Covid-19 Fact-checking",
      "authors": "Fabio Giglietto, Manolo Farci, Giada Marino, S. Mottola, T. Radicioni, Massimo Terenzi",
      "venue": "",
      "year": 2022,
      "doi": "10.31235/osf.io/6umqs",
      "arxivId": null,
      "citations": 3,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "9342592f75980852aadc974438250e1809dda706",
      "isOpenAccess": true,
      "openAccessPdf": "https://osf.io/6umqs/download",
      "abstract": "This report presents the outcomes of a project aimed at developing and testing a prototype tool that supports and speeds-up the work of fact-checkers and de-bunkers by surfacing and ranking potentially problematic information circulated on social media with a content-agnostic approach. The tool itself is the result of a multi-year research activity carried on within the Mapping Italian News Research Program of the University of Urbino Carlo Bo to study the strategies, tactics and goals of information operations aimed at manipulating the Italian public opinion by exploiting the vulnerabilities of the contemporary media ecosystem. This research activity led to developing original studies, public reports, new methods, maps and tools employed to study the activity of Italian nefarious social media actors aimed at amplifying the reach and impact of problematic information by coordinating their efforts. Tracking these actors proved instrumental to observe the “infodemic” unraveling during the early days of COVID-19 outbreak in Italy. Combining this existing knowledge with a range of original tools and data sources provided by Meta’s Facebook Open Research Initiative (Fort) and by The International Fact-Checking Network (IFCN) at Poynter, the report: documents those early days by highlighting a list of widely viewed and interacted links circulated on Facebook; traces the establishment, growth and evolution of Italian covid-skeptic coordinated networks on Facebook; presents a comprehensive and updated map of the activities performed by these networks of nefarious social media actors; unveils a set of original tactics and strategies employed by these actors to adjust their operations to the mitigation efforts adopted by social media platforms to reduce the spread of problematic information; describes the circulation of three specific piece of problematic information; provides an overview of the outcomes of the testing phase (carried out in collaboration with Facta.news) of a prototype tool that surfaces and ranks potentially problematic information circulated on social media with a content-agnostic approach.",
      "fieldsOfStudy": []
    },
    {
      "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017",
      "authors": "Fabio Giglietto, Giada Marino, Massimo Terenzi, Nicola Righetti, L. Rossi",
      "venue": "Social Science Research Network",
      "year": 2021,
      "doi": "10.2139/SSRN.3777263",
      "arxivId": null,
      "citations": 3,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "1c83c5e7c490b24a61cbd4221807e33116c0be64",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "In the context of a larger study on the spread of COVID-19 related mis/disinformation in Italy, we detected a network of 10 Facebook Pages that performed Coordinated Link Sharing. The potential reach of the network is significant, with a cumulative subscriber count close to 2 millions users. Each month, the network publishes more than 6,500 posts. The large majority of posts are links (83%), followed by status (8%) and photos (7%). However, 8 over 10 photos also include links in the message/description of the post. The current goal of the network is to drive traffic to the tg24-ore.com domain, a news source that, according to NewsGuard, fails to meet all the basic journalistic standards, is anonymous and publishes false news about health and partisan right-wing stories without disclosing their editorial line.The network has a long history of activity. It was spotted as performing coordinated link sharing behaviour on highly polarized and false political content in the lead-up to 2018 and 2019 Italian elections (see elections report). The report reconstructs the full list of different domains used by this network from 2017 on and points out to a brand new domain currently used (notiziariodelweb.com). Several of the domains shared by this network are featured in fact-checkers black-lists. 35 news stories posted by this network have been rated as false or misleading by Facebook’s Italian third-party fact-checker. Despite this, the posts linking to these 35 stories have been cumulatively viewed over six million times and clicked more than five hundred thousand times between 2017 and 2019 on Facebook. The domain howtodofor.com was also shared by this network. An analysis of the core Facebook network that shares this domain is available in the second report of this series. The network also serves as a paradigmatic example of how memes page can be repurposed to share highly problematic content as the content posted shifted suddenly from photos to links in the months preceding 2018 Italian general election. A diachronic analysis of the networks’ coordinated links sharing activities, clearly highlights an escalation of the operation that started immediately after the fall of the “yellow-green” government supported by a coalition of M5S and League. The activity further intensifies from the COVID-lockdown on.",
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "COORNET: AN INTEGRATED APPROACH TO SURFACE PROBLEMATIC CONTENT,\n MALICIOUS ACTORS, AND COORDINATED NETWORKS",
      "authors": "Fabio Giglietto, Nicola Righetti, L. Rossi, Giada Marino",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2021,
      "doi": "10.5210/spir.v2021i0.12170",
      "arxivId": null,
      "citations": 3,
      "influentialCitations": 0,
      "references": 14,
      "semanticScholarId": "8934fa18f260a702d351f96823c7b69361c74f0d",
      "isOpenAccess": true,
      "openAccessPdf": "https://journals.uic.edu/ojs/index.php/spir/article/download/12170/10455",
      "abstract": "As much as the field of mis/disinformation studies flourished during\n the last few years, the efforts to measure its prevalence and effects are often hindered or\n significantly limited by the fuzziness of the phenomenon under study. Differently from\n approaches based on sole content or actors detection, the authors implement an integrated\n approach to understand the interplay between manipulative actors, deceptive behavior, and\n harmful content. To do so, the authors present a study on patterns of coordinated activity\n on Facebook (named “Coordinated Link Sharing Behavior”) during the first and second waves of\n the COVID-19 pandemic in Italy. Coordinated Link Sharing Behavior” (CLSB) refers to the\n coordinated shares of the same news article in a very short timeframe by networks of pages,\n groups, and verified public profiles. CLSB is a strategy used to boost the reach of content\n by gaming algorithms that govern the distribution of posts. Additionally, this coordinated\n activity has been proven to be consistently associated with the spread of problematic\n information before the 2018 and 2019 Italian elections. In this paper, the authors devote\n specific attention to discuss the methodology and tool employed in the context of existing\n literature on mis/disinformation as well as to present the results of the case\n study.",
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Steering the world from where we are: An introduction to the sociocybernetics perspective",
      "authors": "P. Almaguer-Kalixto, Fabio Giglietto",
      "venue": "Current Sociology",
      "year": 2019,
      "doi": "10.1177/0011392119837573",
      "arxivId": null,
      "citations": 3,
      "influentialCitations": 0,
      "references": 85,
      "semanticScholarId": "5b52994ddf5562572202583ae821f89c68dc7a8d",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The concept of sociocybernetics has been shaped over the past 40 years at the intersection between first- and second-order cybernetics, constructive epistemology and systems science. This has produced a common language to bridge these different disciplines and a common basis for research analysing complex social problems. Sociocybernetics applies second-order cybernetics concepts to the study of societies, communities and groups in which first- and second-order reflexivity may play an important part, but it is not only a theoretical perspective in the abstract; it is also an approach that is applied to the analysis of cross-disciplinary issues such as systemic violence, the role of technology in society, environmental challenges, urban planning, community development, social identity and media representation, among many others. This article provides an introduction and a general conceptual description of second-order cybernetics in the broader context of cybernetics and systems sciences. It also presents the sociocybernetics debate as it stands today, after the 20-year anniversary of the Research Committee on Sociocybernetics’ (RC51) activities within the International Sociological Association (ISA) and its contributions to understanding and acting upon an increasingly complex social world. Sociocybernetics is the science of turbulent societies that somehow continue to adapt themselves, despite the complexities they are confronted with. The articles in this monograph introduce some of the current work of the research committee and showcase the extensive potential for sociocybernetics’ interaction with other areas of sociology and contemporary debate.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "POLITICAL ADVERTISEMENT AND COORDINATED BEHAVIOR ON SOCIAL MEDIA IN THE LEAD-UP TO THE 2021 GERMAN FEDERAL ELECTIONS",
      "authors": "Nicola Righetti, Fabio Giglietto, Azade E. Kakavand, Aytalina Kulichkina, Giada Marino, Massimo Terenzi",
      "venue": "",
      "year": null,
      "doi": null,
      "arxivId": null,
      "citations": 3,
      "influentialCitations": 0,
      "references": 1,
      "semanticScholarId": "4a044175aa5dc64f60379f7028fc7baa8024d473",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "FROM MOON TO COMET LANDING: RE-IMAGINING (SCIENTIFIC) MEDIA EVENTS IN THE AGE OF TWITTER",
      "authors": "Fabio Giglietto, L. Rossi, Jiyoung Kim",
      "venue": "",
      "year": 2015,
      "doi": null,
      "arxivId": null,
      "citations": 2,
      "influentialCitations": 0,
      "references": 5,
      "semanticScholarId": "c03aaea6f1198a79fa14f82ff5c08d4a788242d1",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Geography"
      ]
    },
    {
      "title": "Facebook reactions in the context of politics and social issues: a systematic literature review",
      "authors": "Sawood Anwar, Fabio Giglietto",
      "venue": "Frontiers in Sociology",
      "year": 2024,
      "doi": "10.3389/fsoc.2024.1379265",
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 69,
      "semanticScholarId": "4b6d3b6ce53423f92a6fbe8577dc6d940a745761",
      "isOpenAccess": true,
      "openAccessPdf": "https://www.frontiersin.org/articles/10.3389/fsoc.2024.1379265/pdf?isPublishedV2=False",
      "abstract": "In February 2016, Facebook expanded the original “Like” button by introducing five additional “Reactions”—Love, Haha, Wow, Sad, and Angry—using modified versions of Unicode emojis. These reactions enable users to express more nuanced emotions towards posts. This literature review investigates scholarly research on user behavior in response to these reactions, with a focus on a broad spectrum of socioeconomic and psychological issues. We conducted a systematic search across databases including Scopus and Google Scholar, using keywords such as “Facebook” and “Reaction,” combined with various key phrases and Boolean operators. Our review synthesizes sixty-four articles published from 2016 to 2023, exploring diverse topics such as political news, far-right and extremist parties, racism, and hate speech during the COVID-19 pandemic. We organized these articles by theme and publication date. Our meta-analysis reveals that lifestyle and entertainment posts predominantly receive positive reactions, while sociopolitical content tends to elicit a broader spectrum of emotions, including negative sentiments. Furthermore, emotionally charged content consistently attracts higher volumes of reactions, regardless of sentiment. This research highlights the intricate relationship between user reactions and content characteristics, providing deeper insights into the dynamics of online engagement. By understanding these interaction patterns, we gain a better grasp of emotional responses and engagement levels, which ultimately shape online discourse and user interactions.",
      "fieldsOfStudy": [
        "Medicine"
      ]
    },
    {
      "title": "Widespread Low-Quality News Sources, Ethnic and Religious Divisions: An Analysis of the Drivers Propelling Coordinated Circulation of Problematic Health Information in Nigeria",
      "authors": "Fabio Giglietto, Samuel Olaniran, Roberto Mincigrucci",
      "venue": "Social Science Research Network",
      "year": 2022,
      "doi": "10.2139/ssrn.4161992",
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "734ccd305bb6b80b2b3be047027426812c03f5e7",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Adapting to Mitigation Efforts: Evolving Strategies of Coordinated Link Sharing on Facebook",
      "authors": "Fabio Giglietto, Massimo Terenzi, Giada Marino, Nicola Righetti, L. Rossi",
      "venue": "Social Science Research Network",
      "year": 2021,
      "doi": "10.2139/SSRN.3775469",
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "37ed9970a8e0c0c004f2d885f62c6450cb5c070a",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "In the context of a larger study on the spread of COVID-19 related mis/disinformation in Italy, we detected a network of 26 Facebook Pages that performed Coordinated Link Sharing. The potential reach of the network is significant, with a cumulative subscriber count close to 6 million users. Each month, the network publishes more than 18,000 posts. Half of the posts are type photos (64%), followed by status (22%) and links (14%). However, one third of the photos include links in the message/description of the post. The goal of the network is to drive traffic to the howtodofor.com domain, a news source that, according to NewsGuard, fails to meet several basic journalistic standards and republished articles from other media without mentioning the original source. The network is organized in different clusters that, beside various forms of links pointing to the main domain, also post the same image macros at approximately the same time. These types of posts tend to perform better in terms of volume of interaction received. Beside the obvious economic driver, one specific cluster also appears to be ideologically motivated. Over the year, the network experimented with different strategies aimed at maximizing the exposure of their content and, possibly, sidestepping Facebook’s community standard. Starting in March, a growing number of the links shared are posted in the first comment of click-bait posts (either photos or status). More recently, the network also started posting links to well-respected journalistic news sources such as La Repubblica and La Stampa.",
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Using Facebook’s Advertising Platform for Recruiting Online Survey Respondents",
      "authors": "Giada Marino, Fabio Giglietto, L. Iannelli",
      "venue": "",
      "year": 2021,
      "doi": "10.4135/9781529601886",
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "72382eac0956d36291e3bf5d33e4f691aed75556",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "An Italian Network of Memes, News, Spam Pages, and Dietary Supplements",
      "authors": "Fabio Giglietto, Massimo Terenzi, Giada Marino, Nicola Righetti, L. Rossi",
      "venue": "Social Science Research Network",
      "year": 2020,
      "doi": "10.2139/SSRN.3743531",
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "6f0fa3a797172bd417fd2e48fcad6137a3304ae4",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "In the context of a larger study on the spread of Covid-19 related mis/disinformation in Italy, we detected a network of 34 Facebook Pages that performed Coordinated Link Sharing. The potential reach of the network is significant with a cumulative subscriber count of over 6 million users. Each month, the network publishes more than 20,000 posts. Due to the number of posts and users, the interaction rate is relatively low with less than 0.05 interaction per user in a month. Despite that, top monthly posts have been shared thousands of times. The large majority of content posted consists of inspirational sentences conveyed as image macros. However, 10% of the photo includes links in the message/description of the post. During mid-October, the network started posting links to well-respected journalistic news sources such as La Repubblica and La Stampa. We hypothesize that the aim of this strategy is to meddle with Facebook’s policy that prioritizes news from trustworthy publications and/or to mitigate the effects of circulation penalties gained by violating the platform community standards. The goal of the network is to drive traffic to the billoccino.com domain and monetize by selling online parapharmaceutical products (e.g. dietary supplements).",
      "fieldsOfStudy": [
        "Business"
      ]
    },
    {
      "title": "Data and Society",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2016,
      "doi": null,
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "2ddab5653261aab6c871e4b0a7addacd3f12e629",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Hybrid spaces of politics. The 2013 general elections in Italy, between talk shows and Twitter",
      "authors": "L. Iannelli, Fabio Giglietto",
      "venue": "",
      "year": 2016,
      "doi": null,
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 62,
      "semanticScholarId": "9e1a8a340c56d7f591d1ea88f717a8c5077fc608",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Second screen and Political Talk-Shows: Measuring and Understanding the Italian Participatory Couch Potato",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2013,
      "doi": null,
      "arxivId": null,
      "citations": 1,
      "influentialCitations": 0,
      "references": 9,
      "semanticScholarId": "b8eea1829bbc2bd5678ec79d1400541eda47ed59",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Geography"
      ]
    },
    {
      "title": "TRANSFORMATIVE TOOLS, EMERGING CHALLENGES: EMPIRICAL AND PRACTICAL EXPERIENCES WITH LARGE LANGUAGE MODELS FOR TEXT CLASSIFICATION AND ANNOTATION IN COMMUNICATION STUDIES",
      "authors": "Tariq Choucair, Ahrabhi Kathirgamalingam, Fabienne Lind, Jana Bernhard, H. Boomgaarden, Bruna Oliveira, Rousiley Maia, Laura Vodden, Katharina Esau, Axel Bruns, Sebastian F. K. Svegaard, Kate Farfan, Hendrik Meyer, Cornelius Puschmann, Michael Brüggemann, Fabio Giglietto, Luca Rossi, Nicola Righetti, Giada Marino",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2025,
      "doi": "10.5210/spir.v2024i0.14102",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "4b25422b35281f88efe4d2bb590380fd673aa3dc",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "Advancements in Large Language Models have been showing important research opportunities within the field of communication studies. It offers the capacity to conduct large-scale content classification and annotation with low computational expertise and reduced manual coding efforts, potentially allowing more possibilities for researchers in social sciences to explore understudied topics (Bail, 2023; Chang et al., 2024). Because of its functioning and vast domains and language training, LLMS also potentially unlocks more generalizable, complex, and diverse analyses across various communication materials than previous computational tools and approaches (Chang et al., 2024). These materials encompass a wide spectrum, ranging from journalistic content to the digital discourse of political actors and social media conversation threads. At the same time, LLMs also raise important concerns with potential biases, data privacy, models’ transparency, environmental impact, and power imbalances (Jameel et al., 2020; Fecher et al., 2023). Although highly discussed recently, as a recent topic LLMs still need deeper theoretical elaboration and dialogue between empirical investigations specifically for communication scholars (Gil de Zúñiga et al., 2024; Guzman and Lewis, 2020).\n\nOur panel assembles a collection of case studies that harness LLMs to tackle text classification and annotation tasks related to media and communication problems, issues, and topics. These research papers engage in an exploration of: (a) pipeline structuring: diverse methodologies for structuring effective pipelines tailored to this form of analysis; (b) tools and models comparison: comparisons of the various LLMs tools and models available for text classification and annotation, highlighting their strengths and weaknesses; (c) optimal variables and tasks: identifying the variables and tasks where LLMs demonstrates exceptional performance and reliability; (d) limitations: discussions on the existing limitations of these tools, including limitations related to specific tasks, variables, languages and data formats; (e) prompt development: strategies for developing, adapting and adjusting prompts that allows better results for specific tasks; and (e) ethical and political dimensions: an examination of the ethical and political considerations inherent in the deployment of LLMs in communication research.\n\nThis panel puts together valuable efforts of different research groups across the world to not only use, but also reflect on the use of LLMs in Communication studies. They show important avenues for the field to think about different approaches to validity, ethics and truthful cooperation between humans and computational models without erasing the challenges of doing so, and the disagreements - not only between humans, but between humans and their computational language models too.",
      "fieldsOfStudy": []
    },
    {
      "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA",
      "authors": "Giada Marino, Bruna Almeida Paroni, Fabio Giglietto",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2025,
      "doi": "10.5210/spir.v2024i0.13999",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "65477e54b34b2517af06140cf2cc0593ec9f1a4b",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "The 2022 Brazilian presidential elections and subsequent events highlight a significant period of political polarization and misinformation, particularly on social media platforms like Facebook. This study investigates the dynamics of misinformation campaigns on Facebook in the context of Brazil's political shifts, focusing on the period from the 2022 elections to the aftermath of the attempted coup on January 8, 2023. Utilizing a mixed methods approach and an innovative news alert system, we analyzed three months of links shared in a coordinated fashion leading up to the first anniversary of the attempted coup.\n\nOur findings reveal a bipartisan battlefield of political discourse, with a scenario characterized by divergence in accounts’ political alignment. We, in fact, identified two primary networks of political Facebook accounts: one supporting former President Jair Bolsonaro and another backing President Lula. Interestingly, we observed Lula supporters repeatedly share content criticizing or mocking Bolsonaro, his family members, and his supporters within pro-Bolsonaro groups. Moreover, these posts often receive a substantial number of comments and minor reactions and shares.\n\nFuture research will expand on these findings by examining a year's worth of Facebook posts from these networks to explore changes in topics and strategies over time.\n\nThe presentation will thus discuss the study's advancement outcomes in-depth, contributing to understanding how Brazilian political factions’ supporters utilize social media to influence public opinion and the implications for democracy in the digital age.",
      "fieldsOfStudy": []
    },
    {
      "title": "Cracking Open the European Newsfeed",
      "authors": "Luca Rossi, Fabio Giglietto, Giada Marino",
      "venue": "Journal of Quantitative Description Digital Media",
      "year": 2023,
      "doi": "10.51685/jqd.2023.020",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 39,
      "semanticScholarId": "0a64ae7234d61d9a7c072c85c707d6cbb0ef1355",
      "isOpenAccess": true,
      "openAccessPdf": "https://journalqd.org/article/download/4377/3604",
      "abstract": "This paper contributes to the ongoing effort to describe and quantify the quality of information that is shared on large social media platforms. We do this by complementing existing research that provided a first quantitative assessment of the quality of the information circulating on Facebook among US users. Leveraging an updated version of the same data source — Meta's URL Shares Dataset — and replicating much of the methodology, we quantify the trustworthy and untrustworthy links to external websites that have been shared on Facebook in the period between 2019 and 2022 in three major European countries (Germany, France, and Italy). We observe a clear decline in the number of URLs present in the dataset and an increase in the URLs from untrustworthy domains as a percentage of the total URLs shared in a year. This increase seems to be higher in electoral years (in Germany and in Italy) but it does not translate into an increase of Views received from untrustworthy sources.",
      "fieldsOfStudy": []
    },
    {
      "title": "REVISITING KEY CONCEPTS IN DIGITAL MEDIA RESEARCH: INFLUENCE, POPULISM, PARTISANSHIP, POLARISATION",
      "authors": "Axel Bruns, Anja Bechmann, Marina Charquero-Ballester, J. G. Walter, Jennifer Stromer-Galley, Brian McKernan, Fabio Giglietto, Nicola Righetti, Anna Stanziano, Tariq Choucair, Katharina Esau, Sebastian F. K. Svegaard, Samantha Vilkins",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2023,
      "doi": "10.5210/spir.v2023i0.13527",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 59,
      "semanticScholarId": "4086d536bf4c49d234355ea7ace1820460e5a532",
      "isOpenAccess": true,
      "openAccessPdf": "https://spir.aoir.org/ojs/index.php/spir/article/download/13527/11477",
      "abstract": "Recent scholarship on the intersections between digital media and political debate has taken on a decidedly pessimistic, even dystopian tone, and not without reason: from the effective use of social media platforms by populists and demagogues like Donald Trump to the expression of deepening ideological divides in online public debate, and from the emergence of partisan online communities and platforms to the intensification and exploitation of such partisanship by conspiracy theorists and state actors, there are substantial concerns about the way that extremist actors are utilising digital and social media logics to further their ideological agendas. The situation is further complicated by platform providers’ and regulators’ limited and unsystematic responses to these issues.\n\nBut while there is considerable research into the various issues and events that illustrate these developments, many of the central concepts that are used to describe these cases receive substantially less critical attention. Terms such as ‘influence’, ‘populism’, ‘partisanship’, and ‘polarisation’ are often deployed as if did not themselves require further qualification and definition – even in spite of the considerable volume of literature in political science and other ancillary disciplines that addresses the various facets that such concepts may have. Informed by and building on substantial empirical research, this panel therefore facilitates a conversation between methodological innovation at the coalface of digital trace data analysis and careful reflection on the definitions of key concepts, in order to explore the conceptual frameworks and methodological approaches that might illuminate the distinct features of our four key concepts in sharper focus.\n\nOur first paper engages with the concept of influence, which it conceptualises as the power to affect others. Focussing especially on the spread of verified false content (VFC) through social media, it proposes a novel population-scale approach that both employs a bottom-up perspective for identifying the influential actors spreading such content, and highlights the exposure of ordinary citizens to these messages. It demonstrates this approach by drawing on the large-scale Facebook URL-sharing dataset available from Social Science One, developing an EU-wide perspective on VFC exposure at national levels.\n\nOur second paper continues this approach by critiquing the concept of populism, highlighting the term as a weak analytical concept. It argues that, rather than focussing on their populist stance, populist politicians can be judged by the extent of their delegitimising rhetoric. Further, the paper asserts that such rhetoric is enabled by the decentralised communication environment of social media. The utility of the concept of delegitimisation is that enables the identification of political messages that are truly dangerous because they are meant to destabilise fundamental democratic principles, such as the integrity of the vote and the legitimacy of alternative policy perspectives. By situating this in the context of social media messaging, we can see how such messages are amplified by distributed network channels.\n\nOur third paper shifts focus to the possible results of influence campaigns and populist demagoguery, and addresses the concept of partisanship. Taking as case study the 2022 Italian election, it introduces a novel combination of computationally informed analytical methods and applies them to social media data to gauge the level of partisan attention devoted to the different news sources and political topics in the election campaign, and distinguish between partisan and cross-partisan sources and themes. This provides new insights into the structures, intersections, and faultlines of partisanship, and enables the mapping of a broader multi-dimensional ideological space.\n\nOur final paper continues this discussion by exploring the complexities of polarisation. It highlights the conceptual fluidity of this term, which is expressed in the multitude of adjectives and qualifiers that can be found in the relevant literature – from ideological through affective to interactive polarisation and beyond, and from benign and even beneficial to pernicious and destructive polarisation. Mapping these distinct forms of polarisation onto a diverse range of mixed-methods digital media research approaches, and outlining a number of criteria for assessing whether the dynamics of polarisation have turned destructive, it outlines new pathways for polarisation research in Internet studies.\n\nIn combination, then, these four papers offer a timely nudge for digital and social media research to revisit and reconsider some of the central concepts in online political communication studies, and to retrace and reaffirm the connections between the definitions of these concepts and the methodological frameworks that we use to study them.",
      "fieldsOfStudy": []
    },
    {
      "title": "PANDEMIC POLITICS: THE 2021 AND 2022 GERMAN AND AUSTRALIAN FEDERAL ELECTION CAMPAIGNS ON SOCIAL MEDIA",
      "authors": "A. Bruns, Nina F. Schumacher, Moritz Mathieu, Christian Nuernbergk, Nicola Righetti, Fabio Giglietto, Azade Kavakand, Aytalina Kulichkina, Giada Marino, Massimo Terenzi, Daniel Angus, Timothy Graham, Ehsan Dehghan, Nadia Jude, Phoebe Matich, M. Andrejevic, B. Carlson, A. Obeid, Philip Mai, A. Gruzd",
      "venue": "AoIR Selected Papers of Internet Research",
      "year": 2023,
      "doi": "10.5210/spir.v2022i0.12953",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 36,
      "semanticScholarId": "fdd13323e035db317b698546e2cb87ca3101dac2",
      "isOpenAccess": true,
      "openAccessPdf": "https://spir.aoir.org/ojs/index.php/spir/article/download/12953/10847",
      "abstract": "One of the effects of the continuing COVID-19 pandemic has been to further accelerate the incorporation of social media activities into political and electoral campaigning. Especially as a result of lockdowns and other restrictions to offline public life, overall social media use has increased in many countries; health concerns have severely curtailed conventional in-person political campaigning activities, from doorknocking to mass rallies (even if some candidates are openly flouting health measures in order to appeal to fringe, COVID-denialist voters); and concerns about the safety of in-person voting processes have also led to a growth in postal voting well ahead of election day, potentially increasing the importance of political messaging early on in election campaigns. In addition, of course, the pandemic itself, and the health, economic, and social measures taken by different governments to address and manage its implications, have also become a dominant theme in most political contests.\n\nPolitical parties around the world have scrambled to keep up with and engage with these changing circumstances, voter behaviours, and political debates, and it is therefore time to re-examine the current state of affairs. This panel does so by focussing on social media campaigning in two of the most recent major national elections: the German federal election campaign in August and September 2021, and the Australian federal election campaign in March to May 2022. The four papers included in this panel examine political campaigning, public engagement, and journalistic coverage on Facebook and Twitter, as well as political advertising practices on Facebook, and in combination offer a very timely new perspective on electioneering in the final stages of a multi-year global pandemic.",
      "fieldsOfStudy": []
    },
    {
      "title": "Blowing on the Fire: An Analysis of Low Quality and Hyper Partisan News Sources Circulated by Coordinated Link Sharing Networks in Nigeria",
      "authors": "Fabio Giglietto, Samuel Olaniran, Roberto Mincigrucci, Giada Marino, S. Mottola, Massimo Terenzi",
      "venue": "Social Science Research Network",
      "year": 2022,
      "doi": "10.2139/ssrn.4162030",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "90f0d4c933ae4b0b1ccd006fbfc0e1206255e59b",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Between Localism and Politics: Mapping Coordinated Networks that Circulate Problematic Health Content in India",
      "authors": "Fabio Giglietto, Piyush Ghasiya, K. Sasahara, Sawood Anwar, Roberto Mincigrucci",
      "venue": "Social Science Research Network",
      "year": 2022,
      "doi": "10.2139/ssrn.4164140",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "dbcb3ba352255b9ecae58ed808da66d8c563eef8",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Research Note: Top 10 Most Viewed Links on Facebook during 2020",
      "authors": "Fabio Giglietto, L. Rossi, Nicola Righetti, Giada Marino, Massimo Terenzi",
      "venue": "Social Science Research Network",
      "year": 2021,
      "doi": "10.2139/ssrn.3908944",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "8d59959abb84c994ff6589005c78de576ba927a2",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Information and Health in Digital Environments, between Agenda Setting and Online Gatekeeping. A Study on Google News Italy and Facebook Users",
      "authors": "Gea Ducci, G. B. Artieri, Mario Corsi, Fabio Giglietto, Fabrizio Manattini",
      "venue": "",
      "year": 2021,
      "doi": "10.1445/101581",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "fc759dcab82776357e232cd977ad8eeedb6961e1",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Correction",
      "authors": "Fabio Giglietto, Nicola Righetti, L. Rossi, Giada Marino",
      "venue": "",
      "year": 2020,
      "doi": "10.1080/1369118x.2020.1755558",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "4b1c93a0942483a06105876623a4e096fcda110c",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "To answer the first research question about whether the coordinated networks identified through the method described above actually spread problematic content online, we checked the domains they shared against blacklists of already identified sources of “fake” and hyperpartisan news. The list of problematic websites was retrieved from Italian established debunking websites (butac.it, bufale.net, bufalopedia.it and pagellapolitica.it). The first three sources have been previously used to identify and measure Italian problematic information (Fletcher et al., 2018), while pagellapolitica.it is Facebook’s Italian official fact-checking partner. Merging these blacklists we ended up with a list of 376 problematic news domains (see Appendix 1). Moreover, we checked the coordinated entities against a list of 87 Facebook pages already pointed out as sources of problematic information by the nonprofit organization Avaaz (Di Benedetto Montaccini, 2019; Mastinu, 2019), whose investigative reports have already spotlighted numerous disinformation networks that Facebook subsequently took down (see Appendix 2). Risk Ratio (RR) was used to calculate statistically significant differences in proportions of problematic domains shared by coordinated and non-coordinated networks, as well as in the prevalence of problematic Facebook entities.",
      "fieldsOfStudy": []
    },
    {
      "title": "Three Consequences of Big Data on the Practices and Scholarships of Political Communication",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2020,
      "doi": "10.3270/96423",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "a58517a303ef58f1aacb66c262cf6af281fa83a3",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Patterns of Facebook Interactions around Insular and Cross-Partisan Media Sources in the Run-up of the 2018 Italian Election",
      "authors": "Fabio Giglietto, L. Iannelli, Giada Marino, Nicola Righetti, L. Rossi, A. Valeriani",
      "venue": "",
      "year": 2019,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "453fa76f151894dcc7d739bb97267aee6547b912",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Page Proof Instructions and Queries",
      "authors": "Fabio Giglietto, L. Iannelli, A. Valeriani, Luca Rossi",
      "venue": "",
      "year": 2019,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 44,
      "semanticScholarId": "51e65fb21d843adbb77e9c6988231370244f1da1",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Europe as home, Europe as cage. Tone, frames and engagment on European Union before 2018 Italian election",
      "authors": "Nicola Righetti, Fabio Giglietto, Giada Marino",
      "venue": "",
      "year": 2019,
      "doi": "10.1445/92856",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "90fbbf6ced5b06491bd5574865f109492c7cf49f",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Assessing the efficiency and effectiveness of a Facebook ad – based procedure for recruiting online survey respondents in niche and difficult-to-reach populations",
      "authors": "L. Iannelli, Fabio Giglietto, Luca Rossi, Elisabetta Zurovac",
      "venue": "",
      "year": 2018,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 39,
      "semanticScholarId": "582bc6d59217f2a3e52a747b3bed0549be12dd5b",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Binge watching the algorithmic catalog: an analysis of Twitter’s reaction to the launch of Netflix Italia",
      "authors": "Fabio Giglietto, C. Checcaglini, L. Mazzoli",
      "venue": "",
      "year": 2017,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 5,
      "semanticScholarId": "d52bd516eee5d0c328e52a672f162e5a70d11287",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Engineering"
      ]
    },
    {
      "title": "CITIZENFOUR: INTERNET PUBLICS AND THE IMAGINARY OF PRIVACY A CONTENT ANALYSIS OF TWITTER COMMENTARIES AROUND THE 2015 OSCAR WINNING DOCUMENTARY",
      "authors": "G. B. Artieri, Fabio Giglietto, L. Gemini",
      "venue": "",
      "year": 2016,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "23a939828574246e874e6d193a8a1135ec4d43f5",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Geography",
        "Sociology"
      ]
    },
    {
      "title": "Index to Volume 60, 2016",
      "authors": "B. Zaman, M. Nouwen, Jeroen Vanattenhoven, Evelien de Ferrerre, J. Looy, T. Kim, David J. Atkin, W. Xu, Ji Young Park, J. Kim, Dong-Hee Shin, Patricia F. Phalen, Thomas Ksiazek, Jacob B. Garber, R. A. Hayes, C. Carr, D. Y. Wohn, Natalya N. Bazarova, Brian E. Weeks, Fabio Giglietto",
      "venue": "",
      "year": 2016,
      "doi": "10.1080/08838151.2016.1238236",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "2cba70cea15d97ed1888cfc4e6a53dd2206418fb",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "RESEARCHING MISLEADING INFORMATION WITHIN HYBRID MEDIA ECOLOGIES. WHERE WE ARE AND WHERE WE ARE GOING",
      "authors": "Fabio Giglietto, A. Valeriani, L. Iannelli, L. Rossi, S. D. Gvirsman, Jing Zeng, Chung-hong Chan, King-wa Fu, J. Farkas, Jannick Schou",
      "venue": "",
      "year": 2016,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "515fecbee0ce3aaeed4e672c10c869c246549c4a",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Engineering"
      ]
    },
    {
      "title": "Reports of the Workshops Held at the 2016 International AAAI Conference on Web and Social Media",
      "authors": "Jisun An, David J. Crandall, Roman Fedorov, Casey Fiesler, Fabio Giglietto, B. Heravi, Jessica A. Pater, K. Pelechrinis, D. Quercia, Katrin Weller, A. Zubiaga",
      "venue": "The AI Magazine",
      "year": 2016,
      "doi": "10.1609/aimag.v37i4.2692",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "53fe95b96c2a33ce461b9543015aaa71794a4d8b",
      "isOpenAccess": true,
      "openAccessPdf": "https://aaai.org/ojs/index.php/aimagazine/article/download/2692/2605",
      "abstract": "Based on a recent report from the United Nations, more than 50 percent of the world’s population currently lives in cities. This percentage is projected to increase to 70 percent by the year 2050. As massive amounts of people move to urban areas there is a need for cities to be run more efficiently, while at the same time improving the quality of life of their dwellers. Nevertheless, the exact same force that sets the above requirement, that is, the proliferation of urbanization levels, makes this task much harder and challenging, especially in megacities. Despite the aforementioned conflicting dynamics, many city management operations can be facilitated by appropriate exploitation of the unprecedented amount of data that can be made available to authorities from a variety of sources. In the era of big data and ubiquitous and pervasive mobile computing, different types of sensors such as parking meters, weather sensors, traffic sensors, pipe sensors, public transportation ticket readers, and even human sensors (for example, through web technologies, social media, or cell phone usage data) can assist in these Workshop Reports",
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "ADOPTION AND ADAPTATION: DIACHRONIC PERSPECTIVES ON THE GROWING SOPHISTICATION OF SOCIAL MEDIA USES IN ELECTIONS CAMPAIGNS",
      "authors": "Anders Olof Larsson, Axel Bruns, Tim Highfield, Jennifer Stromer-Galley, K. Kenski, Jeff J Hemsley, Lauren Bryant, Huichuan Xiu, Bryan Semaan, Luca Rossi, Fabio Giglietto",
      "venue": "",
      "year": 2016,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "c7b818ababc5b8a1be2a10edfb2408cfffb4fc6f",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Connected Audiences of Politics: Analyzing Twitter Conversation on Beppe Grillo and Five Star Movement Generated during Political TV Talk-Shows",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2014,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "70ed6191f026a53239628e60c1130ea18a7a4233",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Klaus Bredl, Julia Hünniger and Jakob Linaa Jensen (eds), Methods for Analyzing Social Media",
      "authors": "Fabio Giglietto, L. Rossi, Davide Bennato, Stefan Stieglitz, Tim Highfield, A. Siibak, M. Forsman",
      "venue": "",
      "year": 2014,
      "doi": "10.1177/0267323114531873h",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "a5e7ff6f40977729af0179891af233eb5cebb082",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "Observing Social Systems in the Era of Big Data. Part II",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2014,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "ca6b51087ad0e2010bf6f2e1697bf610d33fddae",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Social Systems Form Simulation to Observation",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2014,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "cc9ebc6c30d76437cf490dd88eadae1d8fd98a0d",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Social TV: Audience Engagement E Autorappresentazione Dell’identita’ in Rete (Social TV: Networked Publics Between Engagement and Identity Construction)",
      "authors": "Fabio Giglietto, Donatella Selva",
      "venue": "",
      "year": 2013,
      "doi": "10.2139/SSRN.2256368",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "ea643867520078c9f224ec85debb8cec4fe906e0",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "La social tv puo essere studiata come modalita di fruizione della televisione che contribuisce a creare uno spazio discorsivo pubblico in cui le modalita di rappresentazione della politica da parte della televisione entrano in dialogo con le grammatiche di autorappresentazione dei networked publics, secondo diversi gradi di coinvolgimento e diverse tipologie espressive. Attraverso metodi quantitativi e qualitativi e stata evidenziata una tendenza all’uso di Twitter per la social tv di tipo prevalentemente informativo, anche in presenza di espressione di opinioni personali, suggerendo una stretta sinergia tra tempi e modalita espressive televisive e le audience connesse.According to several recent reports, the practice of using a ‘second screen’ while following a television program is quickly becoming a widespread phenomenon. When the secondary device is used to read or contribute to online comments about a watched program, most of the discussion takes place on popular social media such as Facebook and Twitter. Previous research has shown that the analysis of these contents could lead to a better understanding of the behavior of networked publics and of the structure of the show itself. Leveraging on this background, the paper presents a quanti-qualitative analysis of 62,933 Tweets published during the air-time of the first eight episodes of the talk-show PiazzaPulita. The analysis illustrates a technique aimed at identify the emergence of community structures among the connected viewers of a show and introduce a code matrix aimed at classifying Tweets published by viewers during the airtime of a show.",
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "Twitter and Political Talk Shows in Italy (2012/2013)",
      "authors": "Fabio Giglietto",
      "venue": "",
      "year": 2013,
      "doi": "10.6084/M9.FIGSHARE.809555.V4",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "eecec2d871f6e2aae0c340cc732f1f9094ce3daf",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Political Science"
      ]
    },
    {
      "title": "Understanding the Online News Consumer: A Comparative Study Between Italy and United States (L’Informazione da Rito a Puzzle - Le News e Gli Italiani: Dalla Carta Stampata, Alla Rete al Mobile)",
      "authors": "Fabio Giglietto, L. Mazzoli, Mario Orefice, A. Bellafiore",
      "venue": "",
      "year": 2011,
      "doi": "10.2139/SSRN.1963743",
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 1,
      "semanticScholarId": "61b77708f60dc80a7d75fe7805f3d3b837488606",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": "In the digital era, news has become omnipresent. The Internet is at the center of the story of how people’s relationship to news is changing. Italy is, under this perspective, an interesting laboratory. Ownership of traditional media is concentrated in the hands of a relative small elite and public broadcasters are often strongly influenced by politicians.At the same time, according to a recent report issued by the national Institute of Statistics, Internet is finally becoming widely adopted by young people.The paper contains the results of a CATI survey conducted during December 2010 by the \"Advanced Communication Research Lab\" (LaRiCA) of the University of Urbino on a sample of 1209 respondents representative of the Italian population (200 of whose have been interviewed on mobile phones). In order to foster a comparative analysis, the survey questions set was translated and adapted for the different national context from a previous survey conducted during January 2010 by Pew Internet in United States.Aim of the research was investigating how Italians inform themselves, which combination of media platforms they do use, what profiles of use and trust emerge in relation to the different parts of the media system, how mobile, personal and participatory news consumption is affecting information.The results show how Italians, on one hand, remain strongly tied to traditional mass media, with little differences to the past, and, on the other hand, they behave on the Web in a surprisingly similar way to the American Internet users. A further generational analysis clearly pinpoint a common path that describe how the process of news consumption is shifting from the traditional rite of appointment based information toward a new way mainly influenced by foraging and opportunism. In this new multi-platform media environment people seem to access news when the spirit moves them or they have a chance to check up on headlines.",
      "fieldsOfStudy": [
        "Geography"
      ]
    },
    {
      "title": "SOCIOCYBERNETICS AND THE INCREASING COMPLEXITY OF SOCIAL LIFE 2 . Violence as an adaptive system : An example in Mexico",
      "authors": "B. Hornung, E. Buchinger, M. Paetau, F. Lara-Rosano, B. Scott, B. Hornung, Fabio Giglietto",
      "venue": "",
      "year": 2011,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 1,
      "semanticScholarId": "9029dd1012bea6d4aefb47c369e73c48351ddb1c",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    },
    {
      "title": "SIGSNA: Special Interest Group on Social Network Analysis",
      "authors": "L. Rossi, Fabio Giglietto",
      "venue": "",
      "year": 2010,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "824ce630075ea86d929552d081bd1c5b422fe47a",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Social System Theory between Individuals and Society. The Social Construction of Life",
      "authors": "G. Caramaschi, Fabio Giglietto",
      "venue": "",
      "year": 2009,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "2c3bf7c57c15eed0f3af97f3fa09f5b53c373153",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Sociology"
      ]
    },
    {
      "title": "The Future of Learning",
      "authors": "Fabio Giglietto, Luca Rossi",
      "venue": "",
      "year": 2004,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 0,
      "semanticScholarId": "cafa0c55e0d3adfca9131b29296530ec4b000ace",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": [
        "Computer Science"
      ]
    },
    {
      "title": "Diverging Patterns of Social Media Interactions around Online News: Information Sources and Partisan Communities in the Lead-up to 2018 Italian General Election",
      "authors": "Fabio Giglietto, Carlo Bo, A. Valeriani, Nicola Righetti, Giada Marino",
      "venue": "",
      "year": null,
      "doi": null,
      "arxivId": null,
      "citations": 0,
      "influentialCitations": 0,
      "references": 66,
      "semanticScholarId": "a568c40e49cdf3eeaa37d6a39b84fd43fcd74dbb",
      "isOpenAccess": false,
      "openAccessPdf": null,
      "abstract": null,
      "fieldsOfStudy": []
    }
  ],
  "metrics": {
    "hIndex": 17,
    "documentCount": 76,
    "citationCount": 1094,
    "influentialCitationCount": 54
  },
  "lastUpdated": "2025-06-24T00:46:05.875Z"
}