{
  "overallSummary": "Fabio Giglietto has a strong social media presence across Mastodon, LinkedIn, and Bluesky, with a total follower count of 3580. His content focuses on computational social science, disinformation research, and academic opportunities. Overall engagement varies across platforms, with LinkedIn posts receiving higher levels of direct interaction (likes and comments).",
  "engagementMetrics": {
    "totalFollowers": 3580,
    "averageEngagementRate": 2.87,
    "mostEngagingPlatform": "linkedin"
  },
  "contentThemes": [
    {
      "theme": "Computational Social Science Research",
      "description": "Posts related to research findings, new tools, and methodological approaches in computational social science."
    },
    {
      "theme": "Disinformation & Information Operations",
      "description": "Content focused on the study and detection of disinformation campaigns and coordinated inauthentic behavior."
    },
    {
      "theme": "Academic Opportunities",
      "description": "Announcements regarding research grants, postdoctoral positions, and PhD opportunities."
    }
  ],
  "recommendations": [
    "Diversify content formats (e.g., videos, infographics) to increase engagement.",
    "Tailor content to each platform's audience and engagement style.",
    "Actively participate in relevant conversations and engage with followers to build community."
  ],
  "platformInsights": {
    "bluesky": "Bluesky shows a good balance of likes and reposts, indicating a potentially active and engaged audience. Content about newly published papers and conference presentations performs well.",
    "mastodon": "Mastodon has the lowest follower count and engagement levels. Consider sharing more visually appealing content or engaging in more community-focused discussions.",
    "linkedin": "LinkedIn has the highest follower count and receives the most likes and comments, suggesting a professional network is highly responsive to announcements and job opportunities."
  },
  "topPerformingContent": [
    {
      "content": "Excited to announce that our research team has been awarded a new grant to study information operations across social media platforms.",
      "platform": "linkedin",
      "engagementRate": 5.78
    },
    {
      "content": "Now hiring: Two postdoctoral researchers to join our team working on computational methods for social media analysis. Background in data science, computational social science, or related fields preferred.",
      "platform": "linkedin",
      "engagementRate": 3.95
    },
    {
      "content": "Just published our new paper on coordinated inauthentic behavior on social media platforms!",
      "platform": "bluesky",
      "engagementRate": 7.37
    }
  ]
}