[
  {
    "title": "SOCIAL NETWORK ANALYSIS - Lecturer: Fabio Giglietto - A.Y. 2023/2024 - Credits 6",
    "snippet": "This page describes Fabio Giglietto's Social Network Analysis course at the University of Urbino Carlo Bo for the academic year 2023/2024. It mentions his expertise in methodologies for analyzing digital social environments, data collection from the web and social media, and the critical interpretation of research results.",
    "url": "https://www.uniurb.it/syllabi/263942",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This webpage from the University of Urbino Carlo Bo describes Fabio Giglietto's Social Network Analysis course for the 2023/2024 academic year, covering methodologies for analyzing digital social environments.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Fabio Giglietto, along with Dr. Giada Marino and Bruna Paroni, presented research on using large language models (LLMs) to analyze political discourse in hyperpartisan Facebook groups. He also moderated a roundtable discussion on data access in the DSA era.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-12-30",
    "source": "vera.ai",
    "description": "This vera.ai article discusses Fabio Giglietto's presentations at conferences in Brazil regarding the use of LLMs for analyzing political discourse and his moderation of a roundtable on data access in the DSA era.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "How to Detect a Disinformation Campaign - Media Ecosystems Analysis Group",
    "snippet": "Fabio Giglietto is interviewed regarding his research on how actors respond to social media platforms' attempts to crack down on coordinated behavior, specifically in the context of COVID-19 mis- and disinformation in Italy. He discusses the importance of analyzing large-scale data sets to figure out and mitigate bad activity online and explains that coordination isn't necessarily an indicator of negative activity.",
    "url": "https://www.mediaecosystems.org/podcast/4-detect-disinformation-campaign",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is interviewed about his research on coordinated behavior and disinformation related to COVID-19 on social media platforms, specifically in the Italian context. The interview discusses the importance of analyzing large data sets to identify and mitigate negative online activity.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Who is behind vera.ai? Meet the people and teams that make up the vera.ai project. #8 Team of University of Urbino Carlo Bo",
    "snippet": "This article spotlights Fabio Giglietto and his team's work at the University of Urbino as part of the vera.ai project. They coordinate Work Package 4, focusing on detecting potentially problematic content in near-real-time using a content-agnostic approach, specifically addressing coordinated sharing behavior.",
    "url": "https://www.veraai.eu/posts/who-is-behind-veraai-uniurb",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article on vera.ai features Fabio Giglietto and his team at the University of Urbino, highlighting their contributions to Work Package 4, which focuses on detecting problematic content in near-real-time by analyzing coordinated sharing behavior.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop Pipeline | Sociologica",
    "snippet": "This mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo. His research explores the relationship between information theory, media, and digital technologies, and their impact on society.",
    "url": "https://sociologica.unibo.it/article/view/19524/18664",
    "date": "2025-12-30",
    "source": "Sociologica",
    "description": "The article from Sociologica mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo, whose research explores the relationship between information theory, media, and digital technologies, and their impact on society.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "SICSS-Bologna - Summer Institute in Computational Social Science",
    "snippet": "Fabio Giglietto is mentioned as an Associate Professor at the University of Urbino Carlo Bo. His research focuses on digital media and societal transformations.",
    "url": "https://sicss.io/2024/bologna/people",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The SICSS-Bologna website mentions Fabio Giglietto as an Associate Professor at the University of Urbino Carlo Bo whose research focuses on digital media and societal transformations. This is a highly relevant third-party mention relating to his academic work.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "The persistence and resilience of misinformation in the face of fact checking - Vera.ai",
    "snippet": "Fabio Giglietto, Massimo Terenzi and Richard Rogers facilitated a project by vera.ai, entitled “The Persistence and Resilience of Misinformation in the Face of Fact Checking”, at the Digital Media Initiative (DMI) Winter School at the University of Amsterdam.",
    "url": "https://www.veraai.eu/posts/the-persistence-and-resilience-of-misinformation-in-the-face-of-fact-checking",
    "date": "2025-12-30",
    "source": "Vera.ai",
    "description": "This post on Vera.ai discusses a project facilitated by Fabio Giglietto, Massimo Terenzi, and Richard Rogers at the Digital Media Initiative (DMI) Winter School at the University of Amsterdam, focusing on the persistence and resilience of misinformation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA | AoIR Selected Papers of Internet Research",
    "snippet": "Giada Marino, Bruna Almeida Paroni and Fabio Giglietto are the authors of the paper. This study investigates the dynamics of misinformation campaigns on Facebook in the context of Brazil's political shifts.",
    "url": "https://spir.aoir.org/ojs/index.php/spir/article/view/13999",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This research paper, co-authored by Fabio Giglietto, investigates misinformation campaigns on Facebook in Brazil after the Bolsonaro era, focusing on political shifts and information dynamics.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  }
]