[
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Reports on Fabio Giglietto's presentations at conferences in Brazil in October 2025, including research using large language models to analyze political discourse in hyperpartisan Facebook groups, and moderating a roundtable discussion on data access under the Digital Services Act. Also mentions collaborative research with Giada Marino and Bruna Paroni.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-12-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article reports on Fabio Giglietto's presentations at conferences in Brazil, focusing on his research on disinformation and digital manipulation, including analysis of political discourse in Facebook groups and discussions on data access under the Digital Services Act.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Giornata Internazionale di Studi - Can the Damage of Destructive Polarization Be Repaired?",
    "snippet": "Fabio Giglietto, along with Giada Marino and Bruna Almeida Paroni, is mentioned as presenting research on the dynamics of misinformation campaigns on Facebook during the 2022 Brazilian presidential elections and the aftermath.",
    "url": "https://www.uniurb.it/novita-ed-eventi/5977",
    "date": "2025-12-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This is a news item from the University of Urbino Carlo Bo website describing an international study day, mentioning Fabio Giglietto's research presentation on misinformation dynamics during the 2022 Brazilian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "How to Detect a Disinformation Campaign - Media Ecosystems Analysis Group",
    "snippet": "Fabio Giglietto is interviewed as an expert on mis- and disinformation, discussing coordinated inauthentic behavior on social media and how actors adapt to platform crackdowns. He also talks about his research on COVID-19 related disinformation in Italy and coordinated link sharing.",
    "url": "https://www.mediaecosystems.org/podcast/4-detect-disinformation-campaign",
    "date": "2025-12-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is interviewed about disinformation campaigns, coordinated inauthentic behavior, and COVID-19 related disinformation research, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "„România, cea mai importantă țară din lume” vs. Vestul “cel rău” - narațiunile coordonate persistă - EURACTIV.ro",
    "snippet": "This article mentions that data analysis was conducted by Fabio Giglietto and Massimo Terenzi, University of Urbino for the PROMPT project, regarding coordinated inauthentic behavior in Romanian elections.",
    "url": "https://www.euractiv.ro/section/digital/news/romania-cea-mai-importanta-tara-din-lume-vs-vestul-cel-rau-naratiunile-coordonate-persista/",
    "date": "2025-12-31",
    "source": "euractiv.ro",
    "description": "This article from euractiv.ro discusses coordinated inauthentic behavior in Romanian elections, mentioning that data analysis was conducted by Fabio Giglietto and Massimo Terenzi from the University of Urbino as part of the PROMPT project.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Un an de la alegerile anulate. Șocul continuă - EURACTIV.ro",
    "snippet": "This article mentions that data analysis was conducted by Fabio Giglietto and Massimo Terenzi, University of Urbino for the PROMPT project, regarding coordinated inauthentic behaviour in Romanian elections.",
    "url": "https://www.euractiv.ro/section/elections/news/un-an-de-la-alegerile-anulate-socul-continua/",
    "date": "2025-12-31",
    "source": "euractiv.ro",
    "description": "The article discusses the anniversary of annulled elections and mentions Fabio Giglietto's contribution to the PROMPT project, which involved data analysis on coordinated inauthentic behaviour during Romanian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  }
]