[
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil",
    "snippet": "This article discusses the University of Urbino's participation in two conferences in Brazil in October 2025, where Fabio Giglietto presented research on analyzing political discourse using large language models in hyperpartisan Facebook groups and moderated a roundtable discussion on data access for social media research in the DSA era. He also co-authored a study on how deceptive operations evolve through cycles of trial and adaptation.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article discusses Fabio Giglietto's participation in conferences in Brazil, presenting research on political discourse analysis and moderating a discussion on data access for social media research. It also mentions his co-authored study on the evolution of deceptive operations.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Mapping Italian News Research Program - Uniurb",
    "snippet": "This page mentions a white paper co-authored by Fabio Giglietto and Massimo Terenzi on the Digital Services Act and data access for platform research. It also references his role as the chair of vera.ai WP4 and his research on influence operations and coordinated link-sharing behavior.",
    "url": "https://mine.uniurb.it/news",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page from the Mapping Italian News Research Program at Uniurb mentions Fabio Giglietto's co-authorship of a white paper on the Digital Services Act, his role as chair of vera.ai WP4, and his research on influence operations.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "Coordinated Sharing Behavior Detection Conference",
    "snippet": "Fabio Giglietto (Urbino) is listed as one of the speakers at the Coordinated Sharing Behavior Detection Conference, a satellite event of #AoIR2024 focusing on advancing the state of the art in multimodal and cross-platform CIB detection.",
    "url": "https://disinfo-prompt.eu/agenda",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto from the University of Urbino is listed as a speaker at the Coordinated Sharing Behavior Detection Conference, a satellite event of #AoIR2024, focusing on coordinated information behavior detection, aligning with his research areas.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "'Big Data' | Snurblog — Axel Bruns",
    "snippet": "This blog post mentions Fabio Giglietto presenting a study of pro-Bolsonaro narratives on Facebook in Brazil at the AoIR 2025 conference. The study explores the stability of online hyperpartisan groups during times of intense political crisis.",
    "url": "https://snurb.info/taxonomy/term/142",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This blog post mentions Fabio Giglietto presenting research on pro-Bolsonaro narratives on Facebook in Brazil at the AoIR 2025 conference, focusing on hyperpartisan group stability during political crises.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "EU Digital Technologies and Policy Conference (EUDTP 2025) Abstracts and Contributions - Epizeuxis.net",
    "snippet": "Fabio Giglietto is listed as a speaker at the EU Digital Technologies and Policy Conference (EUDTP 2025). The page contains abstracts and contributions from the conference.",
    "url": "https://www.epizeuxis.net/index.php/team/faculty-and-permanent-research-staff/juan-antonio-cordero-fuertes/",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as a speaker at the EU Digital Technologies and Policy Conference (EUDTP) 2025, suggesting his involvement in discussions related to digital policy and technology. This aligns with his expertise in internet studies and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  },
  {
    "title": "SOCIAL NETWORK ANALYSIS - Lecturer: Fabio Giglietto - A.Y. 2023/2024 - Credits 6",
    "snippet": "This is a course syllabus for Social Network Analysis taught by Fabio Giglietto at the University of Urbino Carlo Bo for the academic year 2023/2024. It outlines the course objectives, learning outcomes, and content related to methodologies for analyzing digital social environments, data collection, and the use of R and Gephi software.",
    "url": "https://www.uniurb.it/syllabi/263942",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This is a course syllabus for Social Network Analysis taught by Fabio Giglietto at the University of Urbino Carlo Bo for the academic year 2023/2024, focusing on methodologies for analyzing digital social environments.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true
  }
]