[
  {
    "title": "L'Università di Urbino in prima linea per la lotta alle fake news - Studia Rapido",
    "snippet": "This article discusses the Vera.ai project, which aims to develop AI-based solutions to combat fake news. It mentions that Fabio Giglietto, a professor at the University of Urbino Carlo Bo, is coordinating a team participating in the project. The team's participation is part of the Mapping Italian News (MINE) research program, which studies attempts to manipulate public opinion through social media.",
    "url": "https://www.studiarapido.it/luniversita-di-urbino-in-prima-linea-per-la-lotta-alle-fake-news/",
    "date": "2026-02-16",
    "source": "studiarapido.it",
    "description": "The article discusses the Vera.ai project and mentions Fabio Giglietto, a professor at the University of Urbino Carlo Bo, as the coordinator of a team participating in the project. The team's work is part of the MINE research program, focusing on manipulation attempts on social media, which aligns with Giglietto's expertise in disinformation studies and social media research.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Who is behind vera.ai? Meet the people and teams that make up the vera.ai project. #8 Team of University of Urbino Carlo Bo",
    "snippet": "This article is an interview with the team from the University of Urbino Carlo Bo working on the vera.ai project. It identifies Fabio Giglietto as the team lead. The team is coordinating Work Package 4 (WP4) within the vera.ai project, focusing on discovering potentially problematic content in near-real-time using a content-agnostic approach, specifically addressing coordinated sharing behavior.",
    "url": "https://www.veraai.eu/posts/who-is-behind-veraai-uniurb",
    "date": "2026-02-16",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The article introduces the team from the University of Urbino Carlo Bo that is working on the vera.ai project and identifies Fabio Giglietto as the team lead, coordinating work on discovering potentially problematic content in near-real-time.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Giornata Internazionale di Studi - Can the Damage of Destructive Polarization Be Repaired?",
    "snippet": "Fabio Giglietto (University of Urbino Carlo Bo) is listed as a speaker, along with Giada Marino and Bruna Almeida Paroni, presenting on \"The Brazilian Digital Battlefield: Investigating The Dynamics Of Political Information Campaigns In Post-Bolsonaro Era\".",
    "url": "https://www.uniurb.it/novita-ed-eventi/5977",
    "date": "2026-02-16",
    "source": "uniurb.it",
    "description": "The content describes an international study day where Fabio Giglietto from the University of Urbino Carlo Bo is presenting on political information campaigns in Brazil, which falls under his expertise in social media and disinformation studies.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Da Horizon Europe 400 mila Euro all'Università di Urbino per combattere la disinformazione - UniUrb",
    "snippet": "This article from the University of Urbino discusses the Horizon Europe project and the 400,000 euros awarded to the university to combat disinformation. Fabio Giglietto, an associate professor of Internet Studies, is mentioned as being involved in the project, which is part of the Mapping Italian News (MINE) research program that studies attempts to manipulate public opinion through social media.",
    "url": "https://www.uniurb.it/comunicati/39813",
    "date": "2026-02-16",
    "source": "uniurb.it",
    "description": "This University of Urbino article discusses a Horizon Europe project awarded to the university to combat disinformation. Fabio Giglietto, an associate professor of Internet Studies, is mentioned as being involved in the project related to social media manipulation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Health Discourse Research Initiative",
    "snippet": "This page describes a health discourse research initiative where Fabio Giglietto from the University of Urbino Carlo Bo is working to identify coordinated link-sharing networks on Facebook, focusing on health information in Nigeria and India. The research uses the CooRnet package on CrowdTangle data.",
    "url": "https://www.mediaecosystems.org/initiatives/health-discourse-research-initiative",
    "date": "2026-02-16",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page describes a health discourse research initiative featuring Fabio Giglietto from the University of Urbino Carlo Bo working on identifying coordinated link-sharing networks on Facebook related to health information in Nigeria and India, utilizing the CooRnet package on CrowdTangle data.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "L’articolo 21 nella gabbia di Facebook - Terzogiornale",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPMmh0ZzJpWm5SenhobHBiYUJoUkc2c192RE1EZmhRRFJuWnRZT0tUOE0xQkJkZ0dwelhHWmFxalByYmhIOTM5RFBEVS1lNlgwd1ZFYlg1d2lPYWVyTHR1ZGh5QXY4cXNYdGFKb3h6Rzg4TlFpSXJ0ZTV3dUR3REJIU29hZlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-19",
    "source": "Terzogiornale",
    "description": "News article from Terzogiornale",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Il Premio Rimini Mundi a sette ambasciatori del congressuale - lapiazzarimini.it",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSXlscW55aHBKdlR2VVZrX2kyRXVWZnVKNWFHZllpb1VOdVNOMVRKdFdJeUR2eWNCN3QtWXFzOTFIZngxcFUyV1NwXy1WYjdNa0RvbDBEUFpSeG96ME81dXl0UmxHaC1NYkFsMER0MENWbzlvS2JoYWNuSW1WRkxoM21xR3I4SHNuWnhYWXhLVXBCT1c4OFdV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-11-30",
    "source": "lapiazzarimini.it",
    "description": "News article from lapiazzarimini.it",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Il movimento religioso cinese che si è infiltrato in un gruppo Facebook urbinate - il Ducato",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRlVLVTNqUkVuTUkzZ3p2N1BQZHhmQWhQR3czSk9vQjAzYk93STZnT0w3WTJyeG1vcEJtQW5QS3o3R0ROM0hBOUNkZGc0SGNpbTQ2SVhtQ3BhMnl1MTFVR1dOVUVYajRPMXFvRzJUNm5hdFFNbWpyaHFGdkdlMFM5blQ4Y2Q2VkxjR19WUkY4SFgxeDdGRFdSX0VOckxZbzRnUEsySTU1MlJLOS1iSWc0aW9GeF9aSEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2024-12-17",
    "source": "il Ducato",
    "description": "News article from il Ducato",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  }
]