[
  {
    "title": "Presentation (Video): OpenAI Models for Topic Modelling in Social Media Analysis - Vera.ai",
    "snippet": "Details Fabio Giglietto's talk at the Digital Media Research Center of the Queensland University of Technology (QUT), where he discussed using OpenAI models to identify salient topics circulated via Facebook links during Italian general elections. He elaborated on techniques for constructing classifiers, performing cluster analysis, and utilizing Meta's URL Shares Dataset.",
    "url": "https://www.veraai.eu/posts/presentation-video-fabio-at-uni-queensland",
    "date": "2026-02-27",
    "source": "vera.ai",
    "description": "This vera.ai post details Fabio Giglietto's presentation at the Queensland University of Technology about using OpenAI models for topic modeling in social media analysis, particularly focusing on Facebook links during Italian general elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "The Persistence and Resilience of Misinformation in the Face of Fact Checking - Vera.ai",
    "snippet": "Reports on a project facilitated by Fabio Giglietto and others at the Digital Media Initiative (DMI) Winter School at the University of Amsterdam. The project analyzed a dataset of Facebook stories identified as problematic by Meta's fact-checkers, using OpenAI's GPT models and Mistral AI's embedding tools to identify topics and assess the quality of labels.",
    "url": "https://www.veraai.eu/posts/the-persistence-and-resilience-of-misinformation-in-the-face-of-fact-checking",
    "date": "2026-02-27",
    "source": "vera.ai",
    "description": "This article from vera.ai reports on a project facilitated by Fabio Giglietto at the Digital Media Initiative Winter School at the University of Amsterdam, which analyzed misinformation on Facebook using AI tools.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop Pipeline | Sociologica",
    "snippet": "This article mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo, whose research explores the relationship between information theory, media, digital technologies, and their impact on society. It also references his work on using computational methods to analyze online information dissemination and media manipulation and cites his 2024 research on LLMs.",
    "url": "https://sociologica.unibo.it/article/view/19524/18664",
    "date": "2026-02-27",
    "source": "Sociologica",
    "description": "The Sociologica article mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo and references his research on information theory, media, digital technologies, online information dissemination, media manipulation, and LLMs, specifically citing his 2024 work.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "SICSS-Bologna - Summer Institute in Computational Social Science",
    "snippet": "Fabio Giglietto is listed as an Associate Professor at the University of Urbino Carlo Bo, with research focusing on the interplay between digital media and societal transformations, and how digital platforms influence public opinion and democratic processes.",
    "url": "https://sicss.io/2024/bologna/people",
    "date": "2026-02-27",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as an Associate Professor at the University of Urbino Carlo Bo, associated with the SICSS-Bologna Summer Institute. His research focuses on digital media, societal transformations, public opinion, and democratic processes, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "\"A Pretty Blunt Approach\": Meta's Political Content Reduction Policy and Italian Parliamentarians' Facebook Visibility | Sciety",
    "snippet": "This study, authored by Fabio Giglietto, examines the impact of Meta's political content reduction policy on the Facebook visibility of Italian parliamentarians using a dataset of over 2.5 million posts. It finds a significant reduction in reach for mainstream politicians and reveals transparency deficits in Meta's policy communication.",
    "url": "https://sciety.org/articles/activity/10.31235/osf.io/8dqag_v2",
    "date": "2026-02-27",
    "source": "Sciety",
    "description": "This Sciety article highlights a study by Fabio Giglietto that examines the impact of Meta's political content reduction policy on Italian parliamentarians' Facebook visibility, revealing a reduction in reach for mainstream politicians.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Mapping Italian News Research Program - Università degli Studi di Urbino Carlo Bo",
    "snippet": "Mentions Fabio Giglietto as co-author of a white paper titled 'The State of Social Media Research APIs & Tools in the Digital Services Act Era' and discusses his leadership in the Mapping Italian News Research Program (MINE).",
    "url": "https://mine.uniurb.it/news",
    "date": "2026-02-27",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content from the University of Urbino Carlo Bo's MINE program website mentions Fabio Giglietto as a co-author of a white paper on social media research APIs and tools and discusses his leadership role in the Mapping Italian News Research Program (MINE). This aligns with his expertise in social media research, disinformation studies, and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "L’articolo 21 nella gabbia di Facebook - Terzogiornale",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPMmh0ZzJpWm5SenhobHBiYUJoUkc2c192RE1EZmhRRFJuWnRZT0tUOE0xQkJkZ0dwelhHWmFxalByYmhIOTM5RFBEVS1lNlgwd1ZFYlg1d2lPYWVyTHR1ZGh5QXY4cXNYdGFKb3h6Rzg4TlFpSXJ0ZTV3dUR3REJIU29hZlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-19",
    "source": "Terzogiornale",
    "description": "News article from Terzogiornale",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Meno contenuti politici nei feed, la stretta di Meta è stata meno efficace contro gli estremisti - Il Sole 24 ORE",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPUm9rNE1MZkk2NTVQbjd2NUd6dXFsOHFNa2NJZ3dNUGU1QzVCOVpFQkQ1cXg2TGtYR1lVR0hJbEZKMFhKSTF4a1djb2EtRzlaRl9aN0xTYmVkQU5sVEY4QTFrZkcxck44dVdqdEVHQmN3dmlaWkZfMkFYWHlqTTF3bEFZcGVnNkJuWndKWVRLaW4wUVZiamJBczNHQmk3N05YTE9hMkFQMHFlNk5heVZEdFB2MFdQMmNrR0kwNnN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-08",
    "source": "Il Sole 24 ORE",
    "description": "News article from Il Sole 24 ORE",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Il Premio Rimini Mundi a sette ambasciatori del congressuale - lapiazzarimini.it",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSXlscW55aHBKdlR2VVZrX2kyRXVWZnVKNWFHZllpb1VOdVNOMVRKdFdJeUR2eWNCN3QtWXFzOTFIZngxcFUyV1NwXy1WYjdNa0RvbDBEUFpSeG96ME81dXl0UmxHaC1NYkFsMER0MENWbzlvS2JoYWNuSW1WRkxoM21xR3I4SHNuWnhYWXhLVXBCT1c4OFdV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-11-30",
    "source": "lapiazzarimini.it",
    "description": "News article from lapiazzarimini.it",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Reports on Fabio Giglietto's presentation of collaborative research on analyzing political discourse using fine-tuned large language models (LLMs) to examine political talk in hyperpartisan Facebook groups. He also moderated a roundtable discussion on data access in the DSA era.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-10-09",
    "source": "vera.ai",
    "description": "This vera.ai post reports on Fabio Giglietto's presentation and moderation of a roundtable discussion in Brazil, focusing on using LLMs to analyze political discourse in Facebook groups and data access in the DSA era.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  }
]