[
  {
    "title": "Panel TRANSFORMATIVE TOOLS, EMERGING CHALLENGES: EMPIRICAL AND PRACTICAL EXPERIENCES WITH LARGE LANGUAGE MODELS FOR TEXT CLASSIF - AoIR Selected Papers of Internet Research",
    "snippet": "Fabio Giglietto and colleagues presented a paper reflecting on their investigation of the role of social media in shaping exposure to political news during the 2018 and 2022 Italian elections, using large language models (LLMs) to address methodological challenges.",
    "url": "https://spir.aoir.org/ojs/index.php/spir/article/download/14102/11959/89985",
    "date": "2026-01-27",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This paper presented at AoIR mentions Fabio Giglietto and his colleagues' research on using large language models to analyze social media's role in shaping exposure to political news during the 2018 and 2022 Italian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-27T06:35:13.616Z",
    "collectionRun": "2026-01-27"
  },
  {
    "title": "Insights and Report from the Coordinated Sharing Behavior Detection Conference - Vera.ai",
    "snippet": "Fabio Giglietto and Giada Marino presented insights from the vera.ai Alerts project, which tracked and analyzed coordinated accounts on Facebook. Their research identified coordinated posts, links, and new coordinated accounts, with notable activity in large groups and networks.",
    "url": "https://www.veraai.eu/posts/coordinated-sharing-behavior-detection-conference-2024",
    "date": "2026-01-27",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article reports on the Coordinated Sharing Behavior Detection Conference and specifically mentions Fabio Giglietto and Giada Marino presenting insights from the vera.ai Alerts project, which analyzed coordinated accounts on Facebook, aligning with his research in social media and disinformation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-27T06:35:13.616Z",
    "collectionRun": "2026-01-27"
  },
  {
    "title": "D4.2 - Coordinated sharing behaviour detection and disinformation campaign modelling methods - AWS",
    "snippet": "This report mentions an expert opinion authored by Fabio Giglietto. It also references research from the University of Urbino that uncovered a large-scale disinformation campaign on Facebook surrounding Pope Francis's health.",
    "url": "https://veraai-cms-files.s3.eu-central-1.amazonaws.com/D4_2_V1_0_013beb034d.pdf",
    "date": "2026-01-27",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This report mentions Fabio Giglietto's expert opinion and references research from the University of Urbino on a disinformation campaign related to Pope Francis's health on Facebook, indicating direct relevance to his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-27T06:35:13.616Z",
    "collectionRun": "2026-01-27"
  },
  {
    "title": "Mis and Disinformation in Global Health Symposium - Media Ecosystems Analysis Group",
    "snippet": "Fabio Giglietto presented research from his group at the University of Urbino Carlo Bo on coordinated link sharing behavior in Nigeria and India, discussing how they detected coordinated networks and analyzed content from various news websites.",
    "url": "https://www.mediaecosystems.org/explorations/mis-and-disinformation-in-global-health-symposium",
    "date": "2026-01-27",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content discusses Fabio Giglietto's presentation at the Mis and Disinformation in Global Health Symposium, where he presented research from his group at the University of Urbino Carlo Bo on coordinated link sharing behavior in Nigeria and India.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-27T06:35:13.616Z",
    "collectionRun": "2026-01-27"
  },
  {
    "title": "Meet: Team of University of Urbino Carlo Bo",
    "snippet": "This article introduces the University of Urbino Carlo Bo team involved in the vera.ai project, led by Fabio Giglietto. It describes their role in Work Package 4 (WP4), which focuses on discovering potentially problematic content in near-real-time using a content-agnostic approach, specifically addressing coordinated sharing behavior.",
    "url": "https://veraai.eu/who-is-behind-vera-ai-meet-team-of-university-of-urbino-carlo-bo/",
    "date": "2026-01-25",
    "source": "veraai.eu",
    "description": "The article introduces the University of Urbino Carlo Bo team involved in the vera.ai project, led by Fabio Giglietto, and describes their role in discovering potentially problematic content in near-real-time.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-25T06:31:46.208Z",
    "collectionRun": "2026-01-25"
  },
  {
    "title": "Facebook premia gli estremisti: la ricerca dell'Università di Urbino - Lumsanews",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQU1NiaVlhNkE3OUR6bzU5Y2dPaFBDXzZJd2hSaFFMUFVIOTBVLUhSUU40dEZUeWhFbjMwaUpsOXhiR3lTR0twclU3X2FmNDV0SGI4WUp2QXlpcmlkai1WUHRWaTlxV3dFV2VsVWtxNUR0NTR1c0ZEQ3c0aFlEb05nOWtFNmNybmNCbVVCZ3JSTHlscHdEN25kUktnM2ZDWmpubXpQanppSUNWNWczVTlzWlZSN05wYklRRFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-09",
    "source": "Lumsanews",
    "description": "News article from Lumsanews",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-25T06:31:46.208Z",
    "collectionRun": "2026-01-25"
  },
  {
    "title": "Meno contenuti politici nei feed, la stretta di Meta è stata meno efficace contro gli estremisti - Il Sole 24 ORE",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPUm9rNE1MZkk2NTVQbjd2NUd6dXFsOHFNa2NJZ3dNUGU1QzVCOVpFQkQ1cXg2TGtYR1lVR0hJbEZKMFhKSTF4a1djb2EtRzlaRl9aN0xTYmVkQU5sVEY4QTFrZkcxck44dVdqdEVHQmN3dmlaWkZfMkFYWHlqTTF3bEFZcGVnNkJuWndKWVRLaW4wUVZiamJBczNHQmk3N05YTE9hMkFQMHFlNk5heVZEdFB2MFdQMmNrR0kwNnN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-08",
    "source": "Il Sole 24 ORE",
    "description": "News article from Il Sole 24 ORE",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-21T06:36:19.699Z",
    "collectionRun": "2026-01-21"
  },
  {
    "title": "Curating art exhibitions using machine learning",
    "snippet": "This paper references Fabio Giglietto's 2024 study: 'Evaluating embedding models for clustering italian political news: A comparative study of text-embedding-3-large and umberto.'",
    "url": "https://arxiv.org/html/2506.19813v3",
    "date": "2026-01-20",
    "source": "vertexaisearch.cloud.google.com",
    "description": "A paper on curating art exhibitions using machine learning references Fabio Giglietto's 2024 study on embedding models for clustering Italian political news.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-20T06:35:46.442Z",
    "collectionRun": "2026-01-20"
  },
  {
    "title": "L’articolo 21 nella gabbia di Facebook - Terzogiornale",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPMmh0ZzJpWm5SenhobHBiYUJoUkc2c192RE1EZmhRRFJuWnRZT0tUOE0xQkJkZ0dwelhHWmFxalByYmhIOTM5RFBEVS1lNlgwd1ZFYlg1d2lPYWVyTHR1ZGh5QXY4cXNYdGFKb3h6Rzg4TlFpSXJ0ZTV3dUR3REJIU29hZlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-19",
    "source": "Terzogiornale",
    "description": "News article from Terzogiornale",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-20T06:35:46.442Z",
    "collectionRun": "2026-01-20"
  },
  {
    "title": "White Paper: The State of Social Media Research APIs & Tool in the DSA Era",
    "snippet": "Fabio Giglietto co-authored a white paper with Massimo Terenzi on how the Digital Services Act (DSA) is transforming data access for platform research. The white paper explores the implementation of Article 40.12, which mandates Very Large Online Platforms (VLOPs) to provide access to “publicly available data.”",
    "url": "https://www.vera.ai/news/white-paper-the-state-of-social-media-research-apis-tool-in-the-dsa-era",
    "date": "2026-01-19",
    "source": "vera.ai",
    "description": "The white paper, co-authored by Fabio Giglietto, examines the impact of the Digital Services Act (DSA) on data access for platform research, specifically focusing on the implementation of Article 40.12 concerning publicly available data.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-19T06:38:02.772Z",
    "collectionRun": "2026-01-19"
  },
  {
    "title": "Fabio Giglietto's research works",
    "snippet": "Lists Fabio Giglietto's research publications, including a preprint on Meta's political content reduction policy and its impact on Italian parliamentarians' Facebook visibility. The study examines the effects of Meta's policy using a dataset of over 2.5 million Facebook posts and identifies breakpoints that reveal policy effects.",
    "url": "https://www.researchgate.net/scientific-contributions/Fabio-Giglietto-2335302945",
    "date": "2026-01-19",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate page lists Fabio Giglietto's research publications, including a preprint about Meta's content policies' impact on Italian parliamentarians. It highlights his work on social media analysis and policy impacts.",
    "relevanceScore": 0.8,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-19T06:38:02.772Z",
    "collectionRun": "2026-01-19"
  },
  {
    "title": "Rassegna Stampa - Università degli Studi di Urbino - UniUrb",
    "snippet": "This press review from the University of Urbino mentions Fabio Giglietto's participation in a meeting at Facebook's campus in Menlo Park, California, with other researchers to study the role of social media in electoral processes. It lists some of the other prominent scholars who attended the meeting.",
    "url": "https://uniurb.it/comunicati/26475",
    "date": "2026-01-18",
    "source": "uniurb.it",
    "description": "This press review from the University of Urbino mentions Fabio Giglietto's participation in a meeting at Facebook's campus, where researchers studied social media's role in elections. It confirms his involvement in social media research related to electoral processes.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-18T06:30:34.721Z",
    "collectionRun": "2026-01-18"
  },
  {
    "title": "Facebook, troppa visibilità a estremisti e complottisti: ecco come impatta Meta sulle elezioni",
    "snippet": "A study by Professor Fabio Giglietto analyzed over 2.5 million posts on the platform between 2021 and 2025 and found that Meta's algorithmic choices in distributing political content favored extremist and anti-European Union voices while penalizing institutional politics.",
    "url": "https://www.ansa.it/amp/pressrelease/sardegna/2026/01/09/facebook-troppa-visibilita-a-estremisti-e-complottisti-ecco-come-impatta-meta-sulle-elezioni_2432ca84-2d59-41c5-bd7a-9556c09c9f1a.html",
    "date": "2026-01-09",
    "source": "ansa.it",
    "description": "The press release discusses a study by Professor Fabio Giglietto analyzing over 2.5 million Facebook posts to determine Meta's impact on elections, specifically focusing on the amplification of extremist and anti-EU voices.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-17T06:30:20.405Z",
    "collectionRun": "2026-01-17"
  },
  {
    "title": "L'Europa assolda Urbino contro le fake-news - Il Resto del Carlino",
    "snippet": "This article reports on the European Union investing 7 million euros in the Vera.ai project, which aims to combat disinformation. A team coordinated by Fabio Giglietto, a professor of Internet Studies at the University of Urbino, will receive 400,000 euros as a partner in the project. Giglietto discusses the urgency of addressing disinformation to protect the democratic system and mentions the exploitation of uncertainty during the pandemic to spread skepticism and fear.",
    "url": "https://www.ilrestodelcarlino.it/pesaro/cronaca/leuropa-assolda-urbino-contro-le-fake-news-91d8600d",
    "date": "2022-09-15",
    "source": "ilrestodelcarlino.it",
    "description": "This article discusses the European Union's Vera.ai project aimed at combating disinformation, in which Fabio Giglietto, Professor of Internet Studies at the University of Urbino, is participating with his research team.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-16T06:34:24.506Z",
    "collectionRun": "2026-01-16"
  },
  {
    "title": "Secondo uno studio dell'università di Urbino l'algoritmo di Facebook ora punisce la politica ufficiale e premia gli estremisti antieuropei. Pd e FdI verso una legge bipartisan sulle piattaforme",
    "snippet": "A study by the University of Urbino, authored by Professor Fabio Giglietto, analyzes the effects of Meta's algorithmic choices on the distribution and visibility of political content on Facebook. The study highlights transparency deficits, noting that algorithmic suppression is less effective against extremists. The research analyzed over 2.5 million Facebook posts between 2021 and 2025.",
    "url": "https://www.open.online/2026/01/07/facebook-fake-news-giorgia-meloni-algoritmo-universita-urbino-studio-fabio-giglietto/",
    "date": "2026-01-15",
    "source": "open.online",
    "description": "This article on open.online discusses a study by Professor Fabio Giglietto from the University of Urbino that analyzes the impact of Facebook's algorithms on political content, specifically regarding disinformation and the visibility of extremist viewpoints.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-15T06:33:28.308Z",
    "collectionRun": "2026-01-15"
  },
  {
    "title": "Mapping Italian News Research Program - TEAM",
    "snippet": "This page mentions Fabio Giglietto as a professor of Internet Studies at the University of Urbino Carlo Bo and provides a link to his personal website. It also mentions Giada Marino's involvement with the Computational Communication Science Lab.",
    "url": "https://mine.uniurb.it/team",
    "date": "2026-01-14",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The \"Mapping Italian News Research Program - TEAM\" page mentions Fabio Giglietto as a professor of Internet Studies at the University of Urbino Carlo Bo and links to his personal website, also referencing related work at the Computational Communication Science Lab.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-14T06:33:45.177Z",
    "collectionRun": "2026-01-14"
  },
  {
    "title": "Secondo uno studio dell'università di Urbino l'algoritmo di Facebook ora punisce la politica ufficiale e premia gli estremisti antieuropei. Pd e FdI verso una legge bipartisan sulle piattaforme",
    "snippet": "A study by the University of Urbino, authored by Professor Fabio Giglietto, analyzes the effects of Meta's algorithmic choices on the distribution and visibility of political content on Facebook. The study highlights significant transparency deficits, noting that the algorithmic suppression appears less effective against the extremists it intended to target. The researchers analyzed over 2.5 million Facebook posts published between 2021 and 2025.",
    "url": "https://www.open.online/2026/01/07/studio-universita-urbino-algoritmo-facebook-politica-estremisti/",
    "date": "2026-01-13",
    "source": "open.online",
    "description": "This article from open.online discusses a study by the University of Urbino, authored by Professor Fabio Giglietto, which analyzes the impact of Facebook's algorithm on political content, finding it ineffective against extremists and highlighting transparency issues.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-13T06:33:22.010Z",
    "collectionRun": "2026-01-13"
  },
  {
    "title": "Secondo uno studio dell'università di Urbino l'algoritmo di Facebook ora punisce la politica ufficiale e premia gli estremisti antieuropei. Pd e FdI verso una legge bipartisan sulle piattaforme",
    "snippet": "A study by the University of Urbino, authored by Professor Fabio Giglietto, analyzes the effects of Meta's algorithmic choices on the distribution and visibility of political content on Facebook and Instagram. The study highlights transparency deficits, noting that algorithmic suppression appears less effective against extremists. The research analyzed over 2.5 million posts on Facebook published between 2021 and 2025.",
    "url": "https://www.open.online/2026/01/07/algoritmi-politica-meta-facebook-eleioni-europee-ricerca-unviersita-urbino-deficit-trasparenza/",
    "date": "2026-01-12",
    "source": "Open",
    "description": "This article from Open discusses a study by the University of Urbino, authored by Professor Fabio Giglietto, which analyzes the effects of Meta's algorithmic choices on political content distribution, highlighting transparency deficits.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-12T06:36:51.270Z",
    "collectionRun": "2026-01-12"
  },
  {
    "title": "Meet the speakers! - EUDTP 2025 - EuroTech Universities Alliance",
    "snippet": "This page lists Fabio Giglietto as a speaker at the EU Digital Technologies and Policy Conference 2025.  It mentions his research on disinformation dynamics and computational methods for detecting manipulation campaigns.",
    "url": "https://eurotech-universities.eu/news-and-events/news/eudtp-digital-technologies-and-policy-conference-2025-meet-the-speakers/",
    "date": "2026-01-12",
    "source": "EuroTech Universities Alliance",
    "description": "This page from the EuroTech Universities Alliance announces Fabio Giglietto as a speaker at the EU Digital Technologies and Policy Conference 2025, mentioning his expertise in disinformation dynamics and computational methods for detecting manipulation campaigns.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-12T06:36:51.270Z",
    "collectionRun": "2026-01-12"
  },
  {
    "title": "SOS! ORA L’ALGORITMO PUNTA SUI ‘COMPLOTTISTI’: “INTERVENIRE SUBITO!” - ByoBlu",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVm9GZjY3RzJ2VWx4SVN3ZUdMaUhodDlJbWNuMld3c3lOYzJqWjVhMVNLRWhRRUJ2Z1BQZVJlS0lxaXJYTU9xYUROWVZpU3JWRVRuaFFVMzJQSWJNSlFrZzR4c1huU0V0eWpJVExyMC00c0VnNEtMSkdTWTdHYzdHVTlLUzRDSVdjb1lCSGdEYmtUOGhNdmplTlZ6NA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-09",
    "source": "ByoBlu",
    "description": "News article from ByoBlu",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-12T06:36:51.270Z",
    "collectionRun": "2026-01-12"
  },
  {
    "title": "Secondo uno studio dell'università di Urbino l'algoritmo di Facebook ora punisce la politica ufficiale e premia gli estremisti antieuropei. Pd e FdI verso una legge bipartisan sulle piattaforme",
    "snippet": "This article discusses a study by Fabio Giglietto from the University of Urbino, which analyzes the effects of Meta's algorithmic choices on the visibility of political content on Facebook. The study highlights a lack of transparency, stating that the algorithmic suppression is less effective against extremists. The study analyzed over 2.5 million Facebook posts published between 2021 and 2025.",
    "url": "https://www.open.online/2026/01/07/facebook-fake-news-giorgia-meloni-governo-meloni-mark-zuckerberg-pd/",
    "date": "2026-01-11",
    "source": "open.online",
    "description": "This article from open.online discusses a study by Fabio Giglietto from the University of Urbino, which analyzes the effects of Meta's algorithmic choices on the visibility of political content on Facebook, highlighting a lack of transparency regarding algorithmic suppression against extremists.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-11T06:31:17.435Z",
    "collectionRun": "2026-01-11"
  },
  {
    "title": "SOS! Ora l'algoritmo punta sui complottisti: \"Intervenire subito!\"",
    "snippet": "This article refers to a research by the University of Urbino, led by Professor Fabio Giglietto, highlighting that the visibility of posts by Italian parliamentarians on Facebook has decreased significantly between 2021 and 2025, while 'extremist' accounts have increased their visibility. The article quotes Professor Giglietto describing these 'extremists' as Facebook pages and public figures characterized by anti-system narratives, criticism of mainstream media, and skepticism about vaccination policies.",
    "url": "https://www.byoblu.com/2026/01/08/sos-ora-lalgoritmo-punta-sui-complottisti-intervenire-subito/",
    "date": "2026-01-11",
    "source": "byoblu.com",
    "description": "This article on byoblu.com discusses research led by Professor Fabio Giglietto from the University of Urbino, focusing on the decreased visibility of Italian parliamentarians on Facebook compared to extremist accounts.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": false,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-11T06:31:17.435Z",
    "collectionRun": "2026-01-11"
  },
  {
    "title": "Più visibilità agli estremisti che ai parlamentari, l'impatto del “filtro” di Meta sulle elezioni",
    "snippet": "This article discusses a study titled “Meta's Political Content Reduction Policy and Italian Parliamentarians' Facebook Visibility” by Fabio Giglietto, a professor at the University of Urbino. The study analyzes the impact of Meta's algorithmic 'filter' on the visibility of political content. The article mentions that the study found a significant decrease in the visibility of Italian parliamentarians' posts, while extremist accounts maintained or increased their visibility.",
    "url": "https://www.ilfattoquotidiano.it/2026/01/07/piu-visibilita-agli-estremisti-che-ai-parlamentari-limpatto-del-filtro-di-meta-sulle-elezioni/7010496/",
    "date": "2026-01-11",
    "source": "ilfattoquotidiano.it",
    "description": "This article from ilfattoquotidiano.it discusses a study by Fabio Giglietto regarding the impact of Meta's content reduction policies on the visibility of Italian parliamentarians on Facebook.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-11T06:31:17.435Z",
    "collectionRun": "2026-01-11"
  },
  {
    "title": "ChatGpt va all’università, la promozione delle big tech per fidelizzare gli studenti all’uso dell’Ai - Il Sole 24 ORE",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQT011ZEZmNkJjckhHSUNIZ0ZxSHV4SzdReVFfSWY1SlYwWHVuZkVsSVlsanhIZXpONDdSQ1FtNlhSNnhBd1kwbzhQOW5KUGlqV0dBWlREdXBXS24ydEh4bDhtMW5OQnpNQnJVZXJJSVdmOGdGT21OczRxTDRIVGxvQ2g3cy1fV2g3S2RUYW1TZlNORFdhSU1Sc2ZWY25zb1E3YlFTdlhlWDFVMDBpamQxNjVOOVIwSWRNRVFzX0JOMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-04-22",
    "source": "Il Sole 24 ORE",
    "description": "News article from Il Sole 24 ORE",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-11T06:31:17.435Z",
    "collectionRun": "2026-01-11"
  },
  {
    "title": "Secondo uno studio dell'università di Urbino l'algoritmo di Facebook ora punisce la politica ufficiale e premia gli estremisti antieuropei. Pd e FdI verso una legge bipartisan sulle piattaforme",
    "snippet": "The article discusses a study published by the University of Urbino, authored by Professor Fabio Giglietto, which analyzes the effects of Meta's algorithmic choices on the distribution and visibility of political content on Facebook. The study highlights that the algorithmic suppression appears less effective against extremist actors. The research analyzed over 2.5 million posts on Facebook between 2021 and 2025.",
    "url": "https://www.open.online/2026/01/07/facebook-algoritmo-punisce-politica-ufficiale-premia-antieuropeisti-studio-urbino-giglietto/",
    "date": "2026-01-07",
    "source": "open.online",
    "description": "The article discusses a study by Professor Fabio Giglietto from the University of Urbino, which analyzes how Facebook's algorithm affects the visibility of political content, particularly regarding extremist actors.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-10T06:30:13.691Z",
    "collectionRun": "2026-01-10"
  },
  {
    "title": "Meta Is Getting Rid of CrowdTangle—and Its Replacement Isn't as Transparent or Accessible",
    "snippet": "Fabio Giglietto, an associate professor of internet studies at the University of Urbino, is quoted as an early tester of Meta's MCL (Meta Content Library), expressing concerns about its limits compared to CrowdTangle, especially regarding data exporting for disinformation research projects like Vera AI EU.",
    "url": "https://www.cjr.org/tow_center/meta-is-getting-rid-of-crowdtangle.php",
    "date": "2024-07-09",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The article discusses Meta's decision to replace CrowdTangle with MCL, and quotes Fabio Giglietto, an associate professor of internet studies at the University of Urbino, regarding his concerns about the limitations of MCL for disinformation research.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-10T06:30:13.691Z",
    "collectionRun": "2026-01-10"
  },
  {
    "title": "SOS! ORA L’ALGORITMO PUNTA SUI ‘COMPLOTTISTI’: “INTERVENIRE SUBITO!” - ByoBlu",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPMGVVR2Q1T3RyZlJVUEdLMTViNlRVaXlvMDZJOC1nMHRfSWx1RmdEQkdLN1Z0bzM1MkVRN3lzOVBEV1JpQUdGNEk5YTFPRnpvUzZVTzM5ak5pN2VSc0E3YUpDSG40cGhUSVlBUGZZc2RXNTdMMXQ0UE1IU0IyeE9hVklaQ3J1dFpsaDdNOWdTbUNzZXhJR0FjU3FJcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-08",
    "source": "ByoBlu",
    "description": "News article from ByoBlu",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-09T06:33:13.458Z",
    "collectionRun": "2026-01-09"
  },
  {
    "title": "Meno contenuti politici nei feed, la stretta di Meta è stata meno efficace contro gli estremisti - MSN",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPaG1ybGVyOGNiUzJOenVwaFJid2NtVEw4MmJRVzZ4dXpIdGQtYUVXRkNCZC1xakw1UFEyUkl0TC1ublJqakNSclhwS0U3cmxLR2UtdUYtbWNucmp2ZFNPVXh4UGZ0a3J2UnRHRDVIa3pFelluX3RPMzcxZFJhY0g5eXBNV1lyVllrbUlhWTdRUXJEWU9fZHIzejduc2FRNXFuV0pDMV9IbnFHWUVJZVVQUU1SUmZGbTdrTlNxUjRVNU5meF9xSWtCSE9nNF9LUE1rcGprbGhJaTZOM3RONkg3dFBuMGNHSDc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-08",
    "source": "MSN",
    "description": "News article from MSN",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-09T06:33:13.458Z",
    "collectionRun": "2026-01-09"
  },
  {
    "title": "Algoritmi Meta, più spazio agli estremisti e meno alla politica ufficiale",
    "snippet": "A research study conducted by Fabio Giglietto of the University of Urbino, analyzing over 2.5 million Facebook posts between 2021 and 2025, found that posts from Italian parliamentarians and politicians experienced an average reach reduction of 72%. The study also indicated that extremist and anti-European accounts were the only ones able to increase their overall visibility during 2024. The study also highlights that Meta did not communicate the existence or effects of this policy on disinformation during elections in its mandatory Transparency Reports to the European Commission.",
    "url": "https://www.teleambiente.it/algoritmi-meta-piu-spazio-agli-estremisti-e-meno-alla-politica-ufficiale/",
    "date": "2026-01-07",
    "source": "teleambiente.it",
    "description": "The article discusses a research study by Fabio Giglietto of the University of Urbino analyzing Facebook's algorithms and their impact on the visibility of political and extremist content in Italy.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-09T06:33:13.458Z",
    "collectionRun": "2026-01-09"
  },
  {
    "title": "MENO POLITICA SU META, ESTREMISTI IN VANTAGGIO - 9Colonne",
    "snippet": "A research study by Fabio Giglietto from the University of Urbino, analyzing over 2.5 million posts on 901 Facebook accounts from January 2021 to November 2025, reveals a decline in the visibility of institutional politics and an increase in the reach of 'extremist' content. The visibility of posts from parliamentarians and prominent politicians decreased by an average of 72%, while posts with 'extremist' content increased their reach by over 13%.",
    "url": "https://www.9colonne.it/475109/meno-politica-su-meta-estremisti-in-vantaggio",
    "date": "2026-01-07",
    "source": "9colonne.it",
    "description": "The article reports on a research study by Fabio Giglietto from the University of Urbino, which analyzes Facebook posts to show a decline in the visibility of political content and a rise in extremist content.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-09T06:33:13.458Z",
    "collectionRun": "2026-01-09"
  },
  {
    "title": "Secondo uno studio dell'università di Urbino l'algoritmo di Facebook ora punisce la politica ufficiale e premia gli estremisti antieuropei. Pd e FdI verso una legge bipartisan sulle piattaforme",
    "snippet": "This article discusses a study published on January 7, 2026, by the University of Urbino, authored by Professor Fabio Giglietto, analyzing the effects of Meta's algorithmic choices on the distribution and visibility of political content on its platforms. The study highlights transparency deficits, noting that the algorithmic suppression appears less effective against extremist actors than against institutional politicians.",
    "url": "https://www.open.online/2026/01/07/studio-universita-urbino-facebook-algoritmo-politica-ufficiale-estremisti-antieuropei/",
    "date": "2026-01-07",
    "source": "open.online",
    "description": "The article discusses a study by Professor Fabio Giglietto from the University of Urbino, analyzing the impact of Facebook's algorithm on political content and highlighting transparency issues related to extremist content.",
    "relevanceScore": 1,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": false,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-08T06:33:59.030Z",
    "collectionRun": "2026-01-08"
  },
  {
    "title": "MENO POLITICA SU META, ESTREMISTI IN VANTAGGIO - 9Colonne",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWWNwaXc4SmpkYmFyTC1VcXNyYzY3QmlseVk1M3A3Q2tIa20xZzlZZS1WdVJwVmc2UFY2cElLemFrbHZHeUlTUXBwajV6TUdvYU9uX2todk9CcWZYX2ZIZ1pPUXdzUS10WWFnUzFKdUp2NDBFM214aEpZMHZwVHJuUDBzUUI3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-07",
    "source": "9Colonne",
    "description": "News article from 9Colonne",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-08T06:33:59.030Z",
    "collectionRun": "2026-01-08"
  },
  {
    "title": "A year since the TikTok Messiah's rise, the shock is far from over - EURACTIV.ro",
    "snippet": "Mentions data analysis conducted by Fabio Giglietto and Massimo Terenzi from the University of Urbino for the PROMPT project, which analyzed Facebook posts related to the Romanian elections to detect coordinated inauthentic behavior.",
    "url": "https://www.euractiv.ro/espresso/a-year-since-the-tiktok-messiah-s-rise-the-shock-is-far-from-over-76244",
    "date": "2025-11-22",
    "source": "EURACTIV.ro",
    "description": "This EURACTIV.ro article discusses the impact of TikTok influencers and mentions data analysis conducted by Fabio Giglietto and Massimo Terenzi for the PROMPT project at the University of Urbino to detect coordinated inauthentic behavior during Romanian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-08T06:33:59.030Z",
    "collectionRun": "2026-01-08"
  },
  {
    "title": "„România, cea mai importantă țară din lume” vs. Vestul “cel rău” - narațiunile coordonate persistă - EURACTIV.ro",
    "snippet": "This article from euractiv.ro discusses coordinated inauthentic behavior in Romanian elections. It mentions that data analysis was conducted by Fabio Giglietto and Massimo Terenzi from the University of Urbino.",
    "url": "https://www.euractiv.ro/analize/romania-cea-mai-importanta-tara-din-lume-vs-vestul-cel-rau-naratiunile-coordonate-persista-29848",
    "date": "2025-11-24",
    "source": "euractiv.ro",
    "description": "This euractiv.ro article analyzes coordinated inauthentic behavior in Romanian elections and specifically mentions that data analysis was conducted by Fabio Giglietto and Massimo Terenzi from the University of Urbino.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-05T06:38:11.841Z",
    "collectionRun": "2026-01-05"
  },
  {
    "title": "In the Shadows of Disinformation: Fake News and Violations of Human Rights - ResearchGate",
    "snippet": "Fabio Giglietto et al. are cited in this study for their definition of disinformation as deliberately false information intended to deceive, often for political or economic goals. The study examines disinformation and fake news in relation to human rights.",
    "url": "https://www.researchgate.net/publication/379160366_In_the_Shadows_of_Disinformation_Fake_News_and_Violations_of_Human_Rights/fulltext/65fd855bd3a08551423e88b8/In-the-Shadows-of-Disinformation-Fake-News-and-Violations-of-Human-Rights.pdf",
    "date": "2026-01-03",
    "source": "researchgate.net",
    "description": "This ResearchGate study, published in 2024, cites Fabio Giglietto's definition of disinformation in the context of human rights violations and fake news. It's a third-party mention relating to his expertise in disinformation studies.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-03T06:30:36.046Z",
    "collectionRun": "2026-01-03"
  },
  {
    "title": "Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop",
    "snippet": "This paper mentions Giglietto's (2024) research, noting that LLMs outperform fully fine-tuned transformer models in NLP tasks using the same dataset. It also lists Giada Marino and Fabio Giglietto as copyright holders.",
    "url": "https://ora.uniurb.it/retrieve/deeb880a-e7b0-466c-a109-b3e038d97062/19524-marino.pdf",
    "date": "2026-01-02",
    "source": "uniurb.it",
    "description": "This paper, focusing on the integration of Large Language Models in political discourse studies on social media, mentions Fabio Giglietto as a copyright holder and references his 2024 research, suggesting relevance to his academic work.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-02T06:33:23.205Z",
    "collectionRun": "2026-01-02"
  },
  {
    "title": "Empowering People in Online Spaces: Democracy and Well-Being in Digital Societies - Weizenbaum Institut",
    "snippet": "This report references Fabio Giglietto & Massimo Terenzi, 2024 in the context of disinformation analysis.",
    "url": "https://www.weizenbaum-institut.de/media/Publikationen/Weizenbaum_Proceedings/Proceedings_WIConf25.pdf",
    "date": "2026-01-02",
    "source": "weizenbaum-institut.de",
    "description": "This report from the Weizenbaum Institut proceedings mentions Fabio Giglietto in the context of disinformation analysis research, citing a 2024 publication with Massimo Terenzi. It appears to be a relevant, third-party mention related to his research area.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-02T06:33:23.205Z",
    "collectionRun": "2026-01-02"
  },
  {
    "title": "Un an de la alegerile anulate. Șocul continuă - EURACTIV.ro",
    "snippet": "This article mentions that data analysis was conducted by Fabio Giglietto and Massimo Terenzi, University of Urbino, for the PROMPT project, concerning coordinated inauthentic behavior in the re-run of Romanian elections.",
    "url": "https://www.euractiv.ro/facts-not-fake-decode/un-an-de-la-aparitia-lui-mesia-de-pe-tik-tok.-socul-continua-76245",
    "date": "2026-01-02",
    "source": "euractiv.ro",
    "description": "This Euractiv.ro article discusses data analysis conducted by Fabio Giglietto and Massimo Terenzi from the University of Urbino for the PROMPT project, focusing on coordinated inauthentic behavior during the re-run of Romanian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-02T06:33:23.205Z",
    "collectionRun": "2026-01-02"
  },
  {
    "title": "Meta Is Getting Rid of CrowdTangle — and Its Replacement Isn't As Transparent or Accessible - Proof News",
    "snippet": "This article quotes Fabio Giglietto, an associate professor of internet studies at the University of Urbino, regarding Meta's MCL. He discusses the limitations of the MCL compared to CrowdTangle, particularly regarding data exporting restrictions, which impacts his work on the Vera AI EU disinformation research project.",
    "url": "https://www.proofnews.org/meta-is-getting-rid-of-crowdtangle-and-its-replacement-isnt-as-transparent-or-accessible/",
    "date": "2026-01-01",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The article discusses Meta's replacement of CrowdTangle with MCL and quotes Fabio Giglietto, an associate professor of internet studies at the University of Urbino, regarding the limitations of the MCL, especially its impact on his disinformation research within the Vera AI EU project.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-01T06:33:09.871Z",
    "collectionRun": "2026-01-01"
  },
  {
    "title": "uniurb.it",
    "snippet": "",
    "url": "https://www.uniurb.it/persone/fabio-giglietto",
    "date": "2026-01-01",
    "source": "uniurb.it",
    "description": "Link to the profile page of Fabio Giglietto on the University of Urbino Carlo Bo website. Likely contains information about his role as a Professor of Internet Studies and his research interests.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-01T06:33:09.871Z",
    "collectionRun": "2026-01-01"
  },
  {
    "title": "Commissioni riunite Cultura e Trasporti della Camera (2.12.2025) - Radio Radicale",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNM25ibklZTWhQUEQzMHpkdW1qSmVMVVYwYkJmUkJlTlRWcHdUWFg4OHFMdXIySVNnSGctVGRuR0JqMmFHbmJKazExb2ZtOFcwbkhQbGxHWlRUR2dxRkQ4SllLd21PNmI5UDJnMGU3RlEwMTBEM0oxTWMxRktTQlhCX25xWm56RXpIZVdzZmtULVdQeVlLRFFKaXRzUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-12-02",
    "source": "Radio Radicale",
    "description": "News article from Radio Radicale",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-01T06:33:09.871Z",
    "collectionRun": "2026-01-01"
  },
  {
    "title": "Il Premio Rimini Mundi a sette ambasciatori del congressuale - lapiazzarimini.it",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSXlscW55aHBKdlR2VVZrX2kyRXVWZnVKNWFHZllpb1VOdVNOMVRKdFdJeUR2eWNCN3QtWXFzOTFIZngxcFUyV1NwXy1WYjdNa0RvbDBEUFpSeG96ME81dXl0UmxHaC1NYkFsMER0MENWbzlvS2JoYWNuSW1WRkxoM21xR3I4SHNuWnhYWXhLVXBCT1c4OFdV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-11-30",
    "source": "lapiazzarimini.it",
    "description": "News article from lapiazzarimini.it",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-01T06:33:09.871Z",
    "collectionRun": "2026-01-01"
  },
  {
    "title": "Cracking the code: social data access and the DSA's impact on disinformation research",
    "snippet": "This article, part of the PROMPT series, is co-authored by Massimo Terenzi and Fabio Giglietto. It discusses the impact of the Digital Services Act (DSA) on social media research, particularly in the context of disinformation. It highlights both the opportunities and limitations of the DSA in providing researchers with access to platform data.",
    "url": "https://en.ejo.ch/recent/cracking-the-code-social-data-access-and-the-dsas-impact-on-disinformation-research",
    "date": "2025-03-10",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article, co-authored by Fabio Giglietto, explores the implications of the Digital Services Act on social media research and disinformation studies, examining both opportunities and limitations for researchers.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2026-01-01T06:33:09.871Z",
    "collectionRun": "2026-01-01"
  },
  {
    "title": "Il movimento religioso cinese che si è infiltrato in un gruppo Facebook urbinate - il Ducato",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRlVLVTNqUkVuTUkzZ3p2N1BQZHhmQWhQR3czSk9vQjAzYk93STZnT0w3WTJyeG1vcEJtQW5QS3o3R0ROM0hBOUNkZGc0SGNpbTQ2SVhtQ3BhMnl1MTFVR1dOVUVYajRPMXFvRzJUNm5hdFFNbWpyaHFGdkdlMFM5blQ4Y2Q2VkxjR19WUkY4SFgxeDdGRFdSX0VOckxZbzRnUEsySTU1MlJLOS1iSWc0aW9GeF9aSEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2024-12-17",
    "source": "il Ducato",
    "description": "News article from il Ducato",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss",
    "collectedAt": "2026-01-01T06:33:09.871Z",
    "collectionRun": "2026-01-01"
  },
  {
    "title": "Facebook accidentally gave misinformation about misinformation to researchers",
    "snippet": "The Independent covers how a social media researcher from the University of Urbino, Fabio Giglietto, revealed that Facebook’s data to researchers was incomplete, including only about half of U.S. users.",
    "url": "https://www.independent.co.uk/tech/facebook-misinformation-researchers-mistake-data-b1919042.html",
    "date": "2021-09-13",
    "source": "independent.co.uk",
    "description": "The article from The Independent discusses how Fabio Giglietto, a social media researcher from the University of Urbino, found that Facebook provided incomplete data to researchers regarding misinformation on its platform.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": false,
    "searchEngine": "openai",
    "collectedAt": "2025-12-31T15:58:19.470Z",
    "collectionRun": "2025-12-31"
  },
  {
    "title": "Facebook has been giving misinformation researchers incomplete data",
    "snippet": "The article reports that Fabio Giglietto, associate professor at the University of Urbino, was the first to discover that Facebook was providing flawed and incomplete interaction data to misinformation researchers by comparing it with the publicly released 'Widely Viewed Content Report.'",
    "url": "https://www.engadget.com/facebook-misinformation-researchers-incomplete-data-050143486.html",
    "date": "2021-09-10",
    "source": "engadget.com",
    "description": "The Engadget article reports that Fabio Giglietto, an associate professor at the University of Urbino, discovered that Facebook provided flawed and incomplete interaction data to misinformation researchers.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "openai",
    "collectedAt": "2025-12-31T15:58:19.470Z",
    "collectionRun": "2025-12-31"
  },
  {
    "title": "All Articles – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "This page mentions a video recording of a talk by Fabio Giglietto from the University of Urbino, given in June 2023 at the Queensland University of Technology (QUT). The topic was using OpenAI models to identify the most salient topics circulated via Facebook links in the run-up to the Italian general elections.",
    "url": "https://www.veraai.eu/all-articles",
    "date": "2025-12-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page mentions a talk given by Fabio Giglietto from the University of Urbino in June 2023 at QUT, discussing the use of OpenAI models to identify salient topics circulated via Facebook links in relation to the Italian general elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2025-12-31T15:49:24.748Z",
    "collectionRun": "2025-12-31"
  },
  {
    "title": "Fabio Giglietto - Festival Internazionale del Giornalismo",
    "snippet": "This page mentions Fabio Giglietto as a researcher at the Department of Communication Sciences, Humanities and International Studies at the University of Urbino Carlo Bo, where he teaches Social Media Analysis. It mentions his publications in journals such as Journal of Communication, Information, Communication and Society, Journal of Broadcasting and Electronic Media, Social Media + Society and International Journal of Communication.",
    "url": "https://www.festivaldelgiornalismo.com/speaker/fabio-giglietto",
    "date": "2025-12-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page on the Festival Internazionale del Giornalismo website profiles Fabio Giglietto, confirming his affiliation with the University of Urbino Carlo Bo and his expertise in social media analysis and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2025-12-31T15:49:24.748Z",
    "collectionRun": "2025-12-31"
  },
  {
    "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017 | Request PDF",
    "snippet": "This ResearchGate page mentions Fabio Giglietto's previous analysis (Giglietto et al., 2021) regarding coordinated networks and the spread of harmful inflammatory false stories since 2017 in the context of Italian politics and social issues. ",
    "url": "https://www.researchgate.net/publication/349059207_Coordinated_Hateful_Disinformation_on_Italian_Politics_and_Social_Issues_since_2017",
    "date": "2025-12-31",
    "source": "researchgate.net",
    "description": "This ResearchGate page cites Fabio Giglietto's work on coordinated networks and the spread of disinformation in Italian politics, referencing his 2021 research.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2025-12-31T15:46:48.891Z",
    "collectionRun": "2025-12-31"
  },
  {
    "title": "Giornata Internazionale di Studi - Can the Damage of Destructive Polarization Be Repaired?",
    "snippet": "Fabio Giglietto, along with Giada Marino and Bruna Almeida Paroni, is mentioned as presenting research on the dynamics of misinformation campaigns on Facebook during the 2022 Brazilian presidential elections and the aftermath.",
    "url": "https://www.uniurb.it/novita-ed-eventi/5977",
    "date": "2025-12-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This is a news item from the University of Urbino Carlo Bo website describing an international study day, mentioning Fabio Giglietto's research presentation on misinformation dynamics during the 2022 Brazilian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini",
    "collectedAt": "2025-12-31T06:32:50.055Z",
    "collectionRun": "2025-12-31"
  },
  {
    "title": "Mapping Italian News Research Program - Uniurb",
    "snippet": "This page mentions a white paper co-authored by Fabio Giglietto and Massimo Terenzi on the Digital Services Act and data access for platform research. It also references his role as the chair of vera.ai WP4 and his research on influence operations and coordinated link-sharing behavior.",
    "url": "https://mine.uniurb.it/news",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page from the Mapping Italian News Research Program at Uniurb mentions Fabio Giglietto's co-authorship of a white paper on the Digital Services Act, his role as chair of vera.ai WP4, and his research on influence operations.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T13:30:17.949Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Coordinated Sharing Behavior Detection Conference",
    "snippet": "Fabio Giglietto (Urbino) is listed as one of the speakers at the Coordinated Sharing Behavior Detection Conference, a satellite event of #AoIR2024 focusing on advancing the state of the art in multimodal and cross-platform CIB detection.",
    "url": "https://disinfo-prompt.eu/agenda",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto from the University of Urbino is listed as a speaker at the Coordinated Sharing Behavior Detection Conference, a satellite event of #AoIR2024, focusing on coordinated information behavior detection, aligning with his research areas.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T13:30:17.949Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "'Big Data' | Snurblog — Axel Bruns",
    "snippet": "This blog post mentions Fabio Giglietto presenting a study of pro-Bolsonaro narratives on Facebook in Brazil at the AoIR 2025 conference. The study explores the stability of online hyperpartisan groups during times of intense political crisis.",
    "url": "https://snurb.info/taxonomy/term/142",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This blog post mentions Fabio Giglietto presenting research on pro-Bolsonaro narratives on Facebook in Brazil at the AoIR 2025 conference, focusing on hyperpartisan group stability during political crises.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T13:30:17.949Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "EU Digital Technologies and Policy Conference (EUDTP 2025) Abstracts and Contributions - Epizeuxis.net",
    "snippet": "Fabio Giglietto is listed as a speaker at the EU Digital Technologies and Policy Conference (EUDTP 2025). The page contains abstracts and contributions from the conference.",
    "url": "https://www.epizeuxis.net/index.php/team/faculty-and-permanent-research-staff/juan-antonio-cordero-fuertes/",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as a speaker at the EU Digital Technologies and Policy Conference (EUDTP) 2025, suggesting his involvement in discussions related to digital policy and technology. This aligns with his expertise in internet studies and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T13:30:17.949Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "SOCIAL NETWORK ANALYSIS - Lecturer: Fabio Giglietto - A.Y. 2023/2024 - Credits 6",
    "snippet": "This page describes Fabio Giglietto's Social Network Analysis course at the University of Urbino Carlo Bo for the academic year 2023/2024. It mentions his expertise in methodologies for analyzing digital social environments, data collection from the web and social media, and the critical interpretation of research results.",
    "url": "https://www.uniurb.it/syllabi/263942",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This webpage from the University of Urbino Carlo Bo describes Fabio Giglietto's Social Network Analysis course for the 2023/2024 academic year, covering methodologies for analyzing digital social environments.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Fabio Giglietto, along with Dr. Giada Marino and Bruna Paroni, presented research on using large language models (LLMs) to analyze political discourse in hyperpartisan Facebook groups. He also moderated a roundtable discussion on data access in the DSA era.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-12-30",
    "source": "vera.ai",
    "description": "This vera.ai article discusses Fabio Giglietto's presentations at conferences in Brazil regarding the use of LLMs for analyzing political discourse and his moderation of a roundtable on data access in the DSA era.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "How to Detect a Disinformation Campaign - Media Ecosystems Analysis Group",
    "snippet": "Fabio Giglietto is interviewed regarding his research on how actors respond to social media platforms' attempts to crack down on coordinated behavior, specifically in the context of COVID-19 mis- and disinformation in Italy. He discusses the importance of analyzing large-scale data sets to figure out and mitigate bad activity online and explains that coordination isn't necessarily an indicator of negative activity.",
    "url": "https://www.mediaecosystems.org/podcast/4-detect-disinformation-campaign",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is interviewed about his research on coordinated behavior and disinformation related to COVID-19 on social media platforms, specifically in the Italian context. The interview discusses the importance of analyzing large data sets to identify and mitigate negative online activity.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop Pipeline | Sociologica",
    "snippet": "This mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo. His research explores the relationship between information theory, media, and digital technologies, and their impact on society.",
    "url": "https://sociologica.unibo.it/article/view/19524/18664",
    "date": "2025-12-30",
    "source": "Sociologica",
    "description": "The article from Sociologica mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo, whose research explores the relationship between information theory, media, and digital technologies, and their impact on society.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "SICSS-Bologna - Summer Institute in Computational Social Science",
    "snippet": "Fabio Giglietto is mentioned as an Associate Professor at the University of Urbino Carlo Bo. His research focuses on digital media and societal transformations.",
    "url": "https://sicss.io/2024/bologna/people",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The SICSS-Bologna website mentions Fabio Giglietto as an Associate Professor at the University of Urbino Carlo Bo whose research focuses on digital media and societal transformations. This is a highly relevant third-party mention relating to his academic work.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "The persistence and resilience of misinformation in the face of fact checking - Vera.ai",
    "snippet": "Fabio Giglietto, Massimo Terenzi and Richard Rogers facilitated a project by vera.ai, entitled “The Persistence and Resilience of Misinformation in the Face of Fact Checking”, at the Digital Media Initiative (DMI) Winter School at the University of Amsterdam.",
    "url": "https://www.veraai.eu/posts/the-persistence-and-resilience-of-misinformation-in-the-face-of-fact-checking",
    "date": "2025-12-30",
    "source": "Vera.ai",
    "description": "This post on Vera.ai discusses a project facilitated by Fabio Giglietto, Massimo Terenzi, and Richard Rogers at the Digital Media Initiative (DMI) Winter School at the University of Amsterdam, focusing on the persistence and resilience of misinformation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA | AoIR Selected Papers of Internet Research",
    "snippet": "Giada Marino, Bruna Almeida Paroni and Fabio Giglietto are the authors of the paper. This study investigates the dynamics of misinformation campaigns on Facebook in the context of Brazil's political shifts.",
    "url": "https://spir.aoir.org/ojs/index.php/spir/article/view/13999",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This research paper, co-authored by Fabio Giglietto, investigates misinformation campaigns on Facebook in Brazil after the Bolsonaro era, focusing on political shifts and information dynamics.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T12:16:33.964Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Scientists around the world call to protect research on one of humanity’s greatest short-term threats – Disinformation",
    "snippet": "Fabio Giglietto from the University of Urbino, Italy, is listed as one of the signatories of a collective op-ed featured in multiple news outlets, calling for the protection of disinformation research. The op-ed emphasizes the importance of understanding how disinformation spreads and impacts society.",
    "url": "https://observatory.informationdemocracy.org/scientists-around-the-world-call-to-protect-research-on-one-of-humanitys-greatest-short-term-threats-disinformation/",
    "date": "2025-12-29",
    "source": "Observatory on Information and Democracy",
    "description": "The content mentions Fabio Giglietto, a professor at the University of Urbino, as a signatory of an op-ed that calls for the protection of disinformation research and highlights the importance of understanding its societal impact.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T17:01:43.067Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Unlocking Insights: paper \"Cracking Open the European Newsfeed\" is finally out in JQD:DM",
    "snippet": "This article announces the publication of a paper co-authored by Fabio Giglietto on disinformation analysis in the Journal of Quantitative Description: Social Media. The paper, titled “Cracking Open the European Newsfeed,” examines trustworthy and untrustworthy links shared on Facebook in Germany, France, and Italy.",
    "url": "https://www.veraai.eu/posts/paper-cracking-open-the-european-newsfeed",
    "date": "2025-12-29",
    "source": "vera.ai VERification Assisted by Artificial Intelligence",
    "description": "This article announces the publication of a paper co-authored by Fabio Giglietto on disinformation analysis, specifically examining trustworthy and untrustworthy links shared on Facebook in Germany, France, and Italy. The mention is about his work and within the last 6 months.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T17:01:43.067Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Fabio Giglietto (@fabiogiglietto@aoir.social) - Mastodon",
    "snippet": "This is a link to Fabio Giglietto's Mastodon profile, where he identifies himself as a Professor of Internet Studies at the University of Urbino. It also mentions his involvement in mine.uniurb.it and veraai.eu projects.",
    "url": "https://aoir.social/@fabiogiglietto",
    "date": "2025-12-29",
    "source": "social.vertexaisearch.cloud.google.com",
    "description": "This is a link to Fabio Giglietto's Mastodon profile, confirming his identity as a Professor of Internet Studies at the University of Urbino, and mentioning projects related to his academic interests.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T17:01:43.067Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Who is behind vera.ai? Meet the people and teams that make up the vera.ai project. #8 Team of University of Urbino Carlo Bo",
    "snippet": "This page introduces the team at the University of Urbino Carlo Bo working on the vera.ai project, led by Fabio Giglietto. It describes their roles and objectives within the project, which focuses on detecting potentially problematic content in near-real-time using a content-agnostic approach, specifically addressing coordinated sharing behavior.",
    "url": "https://www.veraai.eu/posts/who-is-behind-veraai-uniurb",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page introduces the team at the University of Urbino Carlo Bo working on the vera.ai project, led by Fabio Giglietto, focusing on detecting potentially problematic content and coordinated sharing behavior.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T17:01:43.067Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "L'Università di Urbino in prima linea per la lotta alle fake news",
    "snippet": "Reports on Fabio Giglietto coordinating a team at the University of Urbino participating in the Vera.ai project, which aims to develop AI-based solutions to combat fake news. Mentions his research program Mapping Italian News (mine.uniurb.it).",
    "url": "https://www.studirapido.it/luniversita-di-urbino-in-prima-linea-per-la-lotta-alle-fake-news/",
    "date": "2025-12-29",
    "source": "studirapido.it",
    "description": "The article reports on Fabio Giglietto coordinating a team at the University of Urbino participating in the Vera.ai project to combat fake news, and mentions his Mapping Italian News research program.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:59:31.173Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Home | Professor of Internet Studies",
    "snippet": "This is a bio page for Fabio Giglietto, PhD, a Professor of Internet Studies at the University of Urbino Carlo Bo. It highlights his research interests in disinformation, social media analysis, computational social science, and political communication. It mentions his work on coordinated link-sharing behavior during the Italian elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFB4gX-HWFwD7dAR52ds6tmqEUpeNkKzcgJXJnNAqm9IN_bIJkxyykGSsQyjVe3QcYxOB_fm-WPk_GqRFXAKqLJaX8VR_Se-Od6LZIY4fGyOjClrjNRyz111ERG0A==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This is a bio page for Fabio Giglietto, a Professor of Internet Studies at the University of Urbino Carlo Bo, highlighting his research interests in disinformation, social media analysis, and political communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Detection and Characterization of Coordinated Online Behavior: A Survey - arXiv",
    "snippet": "This survey paper cites Fabio Giglietto's work on coordinated online behavior, specifically mentioning his 2023 paper with Marino, Mincigrucci, and Stanziano on detecting and monitoring coordinated social media accounts during the 2022 Italian election, as well as Giglietto et al. [2020a].",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEdVZ26dW1qV3n5iQnSrtDZL1jDebV1ymbK_1jnnWCyui6uE_o5QziQnVIZyeAklqL-1fbQpSZO1wbX5jAbujHhgEeCsqeQt4oArSi6hehtW-ZbvftgthUX2x00yrIA",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This survey paper cites Fabio Giglietto's research on coordinated online behavior, specifically referencing his 2023 paper on the Italian election and a 2020 paper. It demonstrates the influence of his work within the field of social media analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "'Fake news' is the invention of a liar: How false information circulates within the hybrid news system - IRIS",
    "snippet": "This entry references Fabio Giglietto's work on 'fake news' and how false information circulates within the hybrid news system. Co-authors include Laura Iannelli, Augusto Valeriani, and Luca Rossi.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6L1xaziQpAoAoEY1rV-4-yFJo-ln0AlM5jzOK_extutg23skhcxytRd7O8HfaVmIgs1F859eUGRAGYVsdwrOGXOhVF2tXAxYw43YAlvfnkvAtHyu5tAk62Ohxvu8diORDY79HwQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The entry references Fabio Giglietto's research on 'fake news' and its circulation within the hybrid news system, indicating a third-party mention of his academic work. The co-authors also suggest this is a legitimate research project.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Coordinated Link Sharing Behavior as a Signal to Surface Sources of Problematic Information on Facebook | Request PDF - ResearchGate",
    "snippet": "This ResearchGate entry discusses Fabio Giglietto's work (Giglietto et al. 2020) on coordinated link-sharing behavior (CLSB) as a signal to surface sources of problematic information on Facebook. It highlights how coordinated networks manipulate visibility and media narratives and how CLSB is associated with higher risks of encountering problematic news sources.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHa4FCbbt7yzjzUFpAFUU83FrYlHClhztCsBSlN6Ikj_D2iUerhuomH18H4aoyc2QMFPJGTvKmd2qnLALDK4mAl1lE5ARVzkkunC6-7acdMvoqlon1WJXUxiR7tNM78SlQf3RCIiU4E3kQkL2FCS6gpTiVvbZLiKRV-hzEtAMnzen1I98a6r9n8-8LR-rKJ8lf80hmpqJoBc_tdS0sd0SbLfBJ7U_2ve4vrdFSeJRXs8eEOO3xHHKBTzb54hiW9vGMiOl_SRl6YiaXaD2Ua3TTHNSesiiKT",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate entry references Fabio Giglietto's 2020 work on coordinated link-sharing behavior (CLSB) and its connection to the spread of problematic information on Facebook.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "POLITICAL ADVERTISEMENT AND COORDINATED BEHAVIOR ON SOCIAL MEDIA IN THE LEAD-UP TO THE 2021 GERMAN FEDERAL ELECTIONS - Landesanstalt für Medien NRW",
    "snippet": "This study references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) and coordinated networks on Facebook, specifically citing 'Giglietto, Righetti, Rossi, & Marino, 2020'. It discusses the use of CLSB to spread anti-establishment narratives and disinformation during elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE7ZXixd7XTfU5udkC4ucfE_bym_qeDcx6l1prS6rpkmmpw51CAml_7SfzBtdGk3gLucv59-wegh3x6YCk314MH9rq38gV-O5sJTBtmhxV9COVdqOUxm-Lkg_WrfQLb5_N2GXeMgHvJArgwtZqYJ6Ynj8bRhO3aTmdICrZnhz4WWEWVdu8bkvLJERP2zCTMyWBoYbLZsEPtTq3Fi98RZGFUqdFDy2FYEkZDPMb-CMGkMzCh",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This study on political advertisement and coordinated behavior during the 2021 German Federal Elections references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) and its use in spreading disinformation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Fabio Giglietto",
    "snippet": "Fabio Giglietto, PhD, is a distinguished Professor of Internet Studies at the Department of Communication Sciences, Humanities, and International Studies at the University of Urbino Carlo Bo. His research focuses on social media analysis, computational social science, and the detection and analysis of disinformation campaigns, particularly in the context of political communication.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQESPK3gn1IwE97Ib4xKFqRUEm0A8xamgiewo2hsXQiaPPWDQNUt2WC7xucH3t1em27p9s8HqZyzmoeFP5PcMTOpHiYukdXLVWi6YwOjlJgMFNWpPcVdBNJBu7UbpA==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content explicitly mentions Fabio Giglietto as a Professor of Internet Studies at the University of Urbino Carlo Bo, detailing his research focus on social media analysis, computational social science, and disinformation campaigns, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Meet the speakers! - EUDTP 2025 - EuroTech Universities Alliance",
    "snippet": "Fabio Giglietto is a speaker at the EU Digital Technologies and Policies (EUDTP) conference in Brussels on May 14 and 15, 2025. He will be discussing implementation challenges and opportunities under the Digital Services Act (DSA).",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFjuV3m4LhZREUUfTXg1dWWHYw9lCPUM4A0XGB8iiVi7dLsCYHJBL7WcE2tW34zNlnzag6dlpf7V_0bmbC0QZUkBkuJUuUd-JRZ6EEcltk2U6B_D0fABAwsJPorw17WIojr_A8HhnRMcmc152DoFQWYR8wS9I2EMrXbwDEW6tbMTibuYRDFWIxVrgF3CRl88CAr8wK-3wXjVpXEWExC9wH-yJ2RuX_OwvqmUxoeA9Zmqq_bufHGw5QyNw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is a speaker at the EuroTech Universities Alliance EU Digital Technologies and Policies conference in Brussels, discussing the Digital Services Act.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Conference Schedule - International Conference on Social Media & Society",
    "snippet": "Fabio Giglietto participated in a panel discussion titled \"Topic Modelling for Research on Social Media Platforms\" at the International Conference on Social Media & Society, July 15, 2024.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEOa3yf2FYDIKlj_A2FC8hfR2jWNX1OhMjY6-aGSJmcsdXadfGQGspDqzTfuuIhkOkJoDel-gLGo-0cEVwOK_vKsm6vun9_ZAupncaij-_p3OqM-ZSzjhOMcHjVMbmLqLto2HscbYH9571VbbSmxoaH7IwpSLcB",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto participated in a panel discussion on topic modelling for social media research at the International Conference on Social Media & Society in July 2024, indicating his expertise in social media analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "PROMPT_whitepaper_The State of Social Media Research APIs & Tools in the Digital Service Act Era - Zenodo",
    "snippet": "Fabio Giglietto, along with Massimo Terenzi, authored a white paper from the University of Urbino Carlo Bo, analyzing how the European Union’s Digital Services Act (DSA) is transforming data access for platform research. It draws on existing literature and testing of research APIs/tools from platforms like Meta, YouTube, and TikTok. The paper focuses on Article 40.12, which mandates access to publicly available data, and examines how Very Large Online Platforms (VLOPs) are implementing these requirements, identifying gaps, challenges, and potential solutions. Published: 2024-12-19.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFLGTYv_8mzGuxQbAZgGbcA2uJ6zgNxfnnjxxwwOj4RL7If8AjMZ0M6rw500aZcPQNkVPMH92QE4msCD_PylubOPpwYGIm6ItgfM8CINND50mOGgKy1bn2twOmMQCQ_TDWJDUYb9p86uDMx5RTdpdGu6t6ebNI3aUaLMPCBub6ehp_mSmBmq606qM1iDaDbbXpEkPccqTb1_i40zAjgiHr3zQM2z7AwbBajIIz-_bNvrLSYttbDB566rP9WCJ2IgAfU9lk_n0BX_BxxjRf9q2_9OCBun65IpzOM90wz-NjSGGqO2e_Hc9U_ItF7Ik8mWI5h",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto co-authored a white paper from the University of Urbino Carlo Bo analyzing the impact of the Digital Services Act (DSA) on data access for platform research, focusing on how VLOPs are implementing Article 40.12 regarding publicly available data.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:34:03.598Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "People - Summer Institute in Computational Social Science",
    "snippet": "Fabio Giglietto is listed as a faculty member/organizer at the Summer Institute in Computational Social Science (SICSS). His affiliation and research interests (digital media, public opinion, democratic processes) are mentioned.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGetM3MFpYDA_QvKXyjdXCA9Ka19Yvq0XorW-JdVKZ6_afmyvf4AukpBNYiwpbDNH5zKLWt6MyvP0O26JWqqB7iCZNyDWztlgWWmuBIcTv7qbLN0whvWLgV",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as faculty at the Summer Institute in Computational Social Science, which aligns with his expertise in digital media, public opinion, and democratic processes.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Italy at the Polls 2022: The Right Strikes Back 3031292979, 9783031292972 - dokumen.pub",
    "snippet": "Fabio Giglietto is mentioned as teaching Internet Studies at the University of Urbino Carlo Bo and as the lead researcher for the 'Mapping Italian News' program.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG5U8gjYASzp5iYl0PiKscOT_aocB3rDpAfFr-tcvRIFvr79qEAgo7ORNpLYN3qUI0-6lXexxey6LNqboL3L4oQoYVhuTPrls56uW6WeaYkRcARSgNkT6PfdlImTJQVAcqJc_F2X3pMcENXNvD9dwbTVVXWsiztiAN0hAdgD9LPQjLcQu8MROXy9hp_AmBFeenEufnmjrFGVChsKw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This content likely references Fabio Giglietto's work on Italian news and his role at the University of Urbino Carlo Bo, potentially in the context of the 2022 Italian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "REVISITING KEY CONCEPTS IN DIGITAL MEDIA RESEARCH: INFLUENCE, POPULISM, PARTISANSHIP, POLARISATION",
    "snippet": "This paper cites Fabio Giglietto's work on the Multi-Party Media Partisanship Attention Score (MP-MPAS) and its application to understanding partisan information dynamics in social media.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH8BtmG9-5kxvWsW7jpYC9lqINCKIHk2iF-yKfAGGuyLKxRDNhRg60T9h3-VrC2GXEIvSMl374O0-G6OtxAh3BeYar_Gq4gv6DVIMeImujexQI7DhPpvh0R-hCSOR0cQXnhQ50q0Zwx5ijbyEPm9qO3NAGu-zuIWJXwojP0L_RC7j1hFFEXeA==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The paper \"REVISITING KEY CONCEPTS IN DIGITAL MEDIA RESEARCH\" cites Fabio Giglietto's work on the Multi-Party Media Partisanship Attention Score (MP-MPAS) in the context of partisan information dynamics on social media.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "A Workflow to Detect, Monitor, and Update Lists of Coordinated Social Media Accounts Across Time - Uniurb",
    "snippet": "This paper references Giglietto's work on Coordinated Link Sharing Behavior (CLSB) and its use in detecting problematic information and coordinated social media actors, specifically in the context of the 2022 Italian general elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFor1PjVx2iG6gSpZISQ51FQcsOYA6wSISmKqdXXYl_XkId65spFrGM6XXO5Gox1HVjVQscc64kyLLsO1J5UgA4UUWLA_R7TpVPnXEljfoXN5sI8mqZqApBgqF1_OUbD-9n9zKkkXEyqAFMLyplVwihxR4jxLSSHhzp8uzzbfz4S30Oq6_9DQFJWZkBc8anDFSM8pcUmQx9dfEV4bgZi1hBQoDqDvDGXCq1F8zps_H9c6E5bcXV_64cs0iNQK8ZB_n1__7fJ8CNuEWXSucV-r5S4TYIeKTxOXd9i4p8xBwtVdFDOeTykhcOW6S6J-HQUj1F_MfQjsQiA6zqOw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This paper from Uniurb references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) in the context of detecting problematic information during the 2022 Italian general elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Professor of Internet Studies",
    "snippet": "Fabio Giglietto is a Professor of Internet Studies at the Department of Communication Sciences, Humanities, and International Studies at the University of Urbino Carlo Bo. His research focuses on the relationships between social systems, media, and digital technologies, with recent projects focusing on social media analysis, computational social science, and the detection and analysis of disinformation campaigns.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGHcvjEMQuTA8aCc0IlqrG0hHf0-BheCfYQL3Xiy6tvrO3UwA78i0cR-MZoV3FG3RLk4RPI_3pefrRGYJ61QjxNPL-WylhN3ZzXyIQitmj58S9BlqaU6lx6js5NuQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content explicitly mentions Fabio Giglietto as a Professor of Internet Studies at the University of Urbino Carlo Bo, and describes his research interests in social media analysis, computational social science, and disinformation detection, aligning with his known areas of expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "INTERNET STUDIES - Lecturer: Fabio Giglietto - A.Y. 2025/2026 - Credits 8 - Uniurb",
    "snippet": "Fabio Giglietto is the lecturer for the Internet Studies course at the University of Urbino for the academic year 2025/2026. The course covers key concepts of Internet Studies, media manipulation, and research methods, including social media data analysis.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGC0hfvRNCL41pZLtdpARrq4tMrNBSCV5GU0Ax-nMmc4ePpnWUq3N-j8V6vNhtDNrHAdQiLdQuy42Lue2pg9A9WmzB7sF3EnmMQEuctWo6Pgb-tca7BU21vBPX1fK9w4A==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This web mention refers to Fabio Giglietto as the lecturer for the Internet Studies course at the University of Urbino for the academic year 2025/2026, covering topics such as media manipulation and social media data analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "L’Europa assolda Urbino contro le fake-news",
    "snippet": "",
    "url": "https://www.ilrestodelcarlino.it/pesaro/cronaca/leuropa-assolda-urbino-contro-le-fake-news-91d8600d?utm_source=openai",
    "date": "2025-10-27",
    "source": "ilrestodelcarlino.it",
    "description": "L’Europa assolda Urbino contro le fake-news",
    "relevanceScore": 0.5,
    "personMatch": "uncertain",
    "collectedAt": "2025-10-27T06:31:21.929Z",
    "collectionRun": "2025-10-27"
  },
  {
    "title": "DMRC Visitor Seminar: Prof. Fabio Giglietto - QUT Digital Media Research Centre",
    "snippet": "",
    "url": "https://research.qut.edu.au/dmrc/2023/06/08/dmrc-visitor-seminar-prof-fabio-giglietto/?utm_source=openai",
    "date": "2025-07-06",
    "source": "research.qut.edu.au",
    "description": "The content is about a seminar featuring Prof. Fabio Giglietto at the QUT Digital Media Research Centre, likely discussing his expertise in social media and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-07-06T00:52:48.465Z",
    "collectionRun": "2025-07-06"
  },
  {
    "title": "INTRODUCTION TO DATA ANALYSIS FOR MEDIA STUDIES - Lecturer: Fabio Giglietto - A.Y. 2024/2025 - Credits 5",
    "snippet": "",
    "url": "https://www.uniurb.it/syllabi/267263?utm_source=openai",
    "date": "2025-07-05",
    "source": "uniurb.it",
    "description": "The content is a course syllabus for 'Introduction to Data Analysis for Media Studies' taught by Fabio Giglietto at the University of Urbino Carlo Bo for the academic year 2024/2025.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-07-05T00:44:26.479Z",
    "collectionRun": "2025-07-05"
  },
  {
    "title": "DIGITAL SOCIAL NETWORK ANALYSIS - Lecturer: Fabio Giglietto - A.Y. 2024/2025 - Credits 6",
    "snippet": "",
    "url": "https://www.uniurb.it/syllabi/265964?utm_source=openai",
    "date": "2025-07-05",
    "source": "uniurb.it",
    "description": "The content is a course listing for 'Digital Social Network Analysis' taught by Fabio Giglietto at the University of Urbino Carlo Bo for the academic year 2024/2025.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-07-05T00:44:26.479Z",
    "collectionRun": "2025-07-05"
  },
  {
    "title": "Decoding the News Media Diet of Disinformation Spreaders",
    "snippet": "",
    "url": "https://arxiv.org/abs/2402.02173?utm_source=openai",
    "date": "2025-06-10",
    "source": "arxiv.org",
    "description": "This paper on arXiv discusses the news media consumption patterns of individuals who spread disinformation, a topic closely related to Fabio Giglietto's expertise in disinformation studies.",
    "relevanceScore": 0.9,
    "collectedAt": "2025-06-10T06:45:26.015Z",
    "collectionRun": "2025-06-10"
  }
]