[
  {
    "title": "Mapping Italian News Research Program - Uniurb",
    "snippet": "Mentions a white paper co-authored by Fabio Giglietto and Massimo Terenzi that explores how the Digital Services Act (DSA) is transforming data access for platform research. It also mentions Fabio Giglietto's involvement in the vera.ai project, which aims to develop AI-based methods to assist in verifying multimedia content and combating disinformation.",
    "url": "https://mine.uniurb.it/news",
    "date": "2026-02-05",
    "source": "uniurb.it",
    "description": "This news item from the University of Urbino mentions Fabio Giglietto's co-authorship of a white paper on the DSA's impact on platform research and his involvement in the vera.ai project for multimedia verification and disinformation combating.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Giornata Internazionale di Studi - Can the Damage of Destructive Polarization Be Repaired?",
    "snippet": "Fabio Giglietto, along with Giada Marino and Bruna Almeida Paroni, from the University of Urbino Carlo Bo, presented on 'The Brazilian Digital Battlefield: Investigating The Dynamics Of Political Information Campaigns In Post-Bolsonaro Era'. The study investigates the dynamics of misinformation campaigns on Facebook in the context of Brazil's political landscape.",
    "url": "https://www.uniurb.it/novita-ed-eventi/5977",
    "date": "2026-02-05",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto from the University of Urbino Carlo Bo, along with colleagues, presented research on political information campaigns in Brazil during a conference. The study explores misinformation dynamics on Facebook in the post-Bolsonaro era.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "How to Detect a Disinformation Campaign - Media Ecosystems Analysis Group",
    "snippet": "Fabio Giglietto is interviewed as an expert on how actors respond to social media platforms' attempts to crack down on coordinated behavior. He discusses his research on COVID-19 mis- and disinformation in Italy and the importance of looking at the coordination between social media actors to spot misinformation.",
    "url": "https://www.mediaecosystems.org/podcast/4-detect-disinformation-campaign",
    "date": "2026-02-05",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The podcast features Fabio Giglietto discussing his research on COVID-19 mis- and disinformation in Italy and the importance of coordination between social media actors for spotting misinformation campaigns, showcasing his expertise in social media analysis and misinformation detection.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "L’articolo 21 nella gabbia di Facebook - Terzogiornale",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPMmh0ZzJpWm5SenhobHBiYUJoUkc2c192RE1EZmhRRFJuWnRZT0tUOE0xQkJkZ0dwelhHWmFxalByYmhIOTM5RFBEVS1lNlgwd1ZFYlg1d2lPYWVyTHR1ZGh5QXY4cXNYdGFKb3h6Rzg4TlFpSXJ0ZTV3dUR3REJIU29hZlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-19",
    "source": "Terzogiornale",
    "description": "News article from Terzogiornale",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Facebook premia gli estremisti: la ricerca dell'Università di Urbino - Lumsanews",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQU1NiaVlhNkE3OUR6bzU5Y2dPaFBDXzZJd2hSaFFMUFVIOTBVLUhSUU40dEZUeWhFbjMwaUpsOXhiR3lTR0twclU3X2FmNDV0SGI4WUp2QXlpcmlkai1WUHRWaTlxV3dFV2VsVWtxNUR0NTR1c0ZEQ3c0aFlEb05nOWtFNmNybmNCbVVCZ3JSTHlscHdEN25kUktnM2ZDWmpubXpQanppSUNWNWczVTlzWlZSN05wYklRRFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2026-01-09",
    "source": "Lumsanews",
    "description": "News article from Lumsanews",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Il Premio Rimini Mundi a sette ambasciatori del congressuale - lapiazzarimini.it",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQSXlscW55aHBKdlR2VVZrX2kyRXVWZnVKNWFHZllpb1VOdVNOMVRKdFdJeUR2eWNCN3QtWXFzOTFIZngxcFUyV1NwXy1WYjdNa0RvbDBEUFpSeG96ME81dXl0UmxHaC1NYkFsMER0MENWbzlvS2JoYWNuSW1WRkxoM21xR3I4SHNuWnhYWXhLVXBCT1c4OFdV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2025-11-30",
    "source": "lapiazzarimini.it",
    "description": "News article from lapiazzarimini.it",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Reports on Professor Fabio Giglietto presenting collaborative research with Dr. Giada Marino and Bruna Paroni at conferences in Brazil. The research explores using fine-tuned large language models (LLMs) to analyze political discourse in hyperpartisan Facebook groups.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-10-09",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article from vera.ai reports on Professor Fabio Giglietto's presentation of collaborative research on using LLMs to analyze political discourse at conferences in Brazil.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Il movimento religioso cinese che si è infiltrato in un gruppo Facebook urbinate - il Ducato",
    "snippet": "",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRlVLVTNqUkVuTUkzZ3p2N1BQZHhmQWhQR3czSk9vQjAzYk93STZnT0w3WTJyeG1vcEJtQW5QS3o3R0ROM0hBOUNkZGc0SGNpbTQ2SVhtQ3BhMnl1MTFVR1dOVUVYajRPMXFvRzJUNm5hdFFNbWpyaHFGdkdlMFM5blQ4Y2Q2VkxjR19WUkY4SFgxeDdGRFdSX0VOckxZbzRnUEsySTU1MlJLOS1iSWc0aW9GeF9aSEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "date": "2024-12-17",
    "source": "il Ducato",
    "description": "News article from il Ducato",
    "relevanceScore": 0.75,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "google-news-rss"
  },
  {
    "title": "Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop Pipeline",
    "snippet": "This article mentions Fabio Giglietto as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo. It highlights his expertise in the relationship between information theory, media, and digital technologies and his research into how these forces shape social systems, influence public opinion, and political communication. It also mentions his use of advanced computational methods to analyze online information dissemination and media manipulation.",
    "url": "https://sociologica.unibo.it/article/view/19524/18664",
    "date": "2024-10-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The article 'Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop Pipeline' mentions Fabio Giglietto as an Associate Professor at the University of Urbino, highlighting his expertise in information theory, media, and digital technologies, and his research on social systems, public opinion, and political communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  },
  {
    "title": "Who is behind vera.ai? Meet the people and teams that make up the vera.ai project. #8 Team of University of Urbino Carlo Bo",
    "snippet": "This page features an interview with the University of Urbino Carlo Bo team involved in the vera.ai project. Fabio Giglietto leads the team as an Associate Professor and coordinator of the Mapping Italian News Research Program. The team's work focuses on discovering problematic content in near-real-time by analyzing coordinated sharing behavior using social media analysis and network science methods.",
    "url": "https://www.veraai.eu/posts/who-is-behind-veraai-uniurb",
    "date": "2023-05-31",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page features an interview with the University of Urbino Carlo Bo team involved in the vera.ai project. Fabio Giglietto leads the team and their work focuses on discovering problematic content in near-real-time by analyzing coordinated sharing behavior using social media analysis and network science methods.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "searchEngine": "gemini"
  }
]