[
  {
    "title": "Meet the speakers! - EUDTP 2025 - EuroTech Universities Alliance",
    "snippet": "Fabio Giglietto is listed as a Professor of Internet Studies at University of Urbino Carlo Bo and a speaker at the EUDTP 2025 conference in Brussels. His research on disinformation dynamics and media manipulation is highlighted, noting his work provides insights into identifying and countering harmful information operations. He will be speaking about implementation challenges and opportunities under DSA",
    "url": "https://eurotech-universities.eu/news-and-events/news/eudtp-digital-technologies-and-policy-conference-2025-meet-the-speakers/",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This webpage announces Fabio Giglietto as a speaker at the EUDTP 2025 conference, highlighting his expertise in disinformation dynamics and media manipulation and his upcoming talk on implementation challenges under the DSA.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T06:32:48.976Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "Reports on Fabio Giglietto's participation in two conferences in Brazil in October 2025, where he presented research on using large language models to analyze political discourse in hyperpartisan Facebook groups. He also moderated a roundtable discussion on data access in the DSA era.",
    "url": "https://www.veraai.eu/posts/uni-urbino-at-conferences-in-brazil",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Reports on Fabio Giglietto's participation in two conferences in Brazil in October 2025, where he presented research on using large language models to analyze political discourse in hyperpartisan Facebook groups and moderated a roundtable discussion on data access.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T06:32:48.976Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Mapping Italian News Research Program - Uniurb",
    "snippet": "This page from the University of Urbino website mentions Fabio Giglietto as part of the Mapping Italian News Research Program. It highlights a white paper co-authored by him and Massimo Terenzi on the DSA and data access, and also mentions his role in the vera.ai project.",
    "url": "https://mine.uniurb.it/news",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This page from the University of Urbino details Fabio Giglietto's involvement in the Mapping Italian News Research Program, highlighting his work on the DSA and data access, and his role in the vera.ai project. The content aligns with his expertise in social media research and disinformation studies.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T06:32:48.976Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "THE BRAZILIAN DIGITAL BATTLEFIELD: INVESTIGATING THE DYNAMICS OF POLITICAL INFORMATION CAMPAIGNS IN POST-BOLSONARO ERA | AoIR Selected Papers of Internet Research",
    "snippet": "Fabio Giglietto co-authored a study investigating the dynamics of misinformation campaigns on Facebook in Brazil, focusing on the period from the 2022 elections to the aftermath of the attempted coup on January 8, 2023.",
    "url": "https://spir.aoir.org/ojs/index.php/spir/article/view/13999",
    "date": "2025-12-30",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The selected paper from AoIR discusses a study co-authored by Fabio Giglietto that investigates the dynamics of political information campaigns on Facebook in Brazil, specifically focusing on the period surrounding the 2022 elections and the January 8, 2023, attempted coup.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T06:32:48.976Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017",
    "snippet": "This ResearchGate entry (dated 2025-08-07) references Giglietto's work on coordinated disinformation since 2017, noting a network including Pages known for spreading harmful false stories since 2017, referencing Giglietto et al., 2021. It also mentions coordinated link-sharing behavior (CLSB) before the 2018 and 2019 Italian elections, a topic he has researched extensively.",
    "url": "https://www.researchgate.net/publication/349059207_Coordinated_Hateful_Disinformation_on_Italian_Politics_and_Social_Issues_since_2017",
    "date": "2025-12-30",
    "source": "researchgate.net",
    "description": "This ResearchGate entry references Fabio Giglietto's work on coordinated disinformation campaigns since 2017. It discusses research related to coordinated link-sharing behavior before the 2018 and 2019 Italian elections, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-30T06:32:48.976Z",
    "collectionRun": "2025-12-30"
  },
  {
    "title": "Home | Professor of Internet Studies",
    "snippet": "This is a bio page for Fabio Giglietto, PhD, a Professor of Internet Studies at the University of Urbino Carlo Bo. It highlights his research interests in disinformation, social media analysis, computational social science, and political communication. It mentions his work on coordinated link-sharing behavior during the Italian elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFB4gX-HWFwD7dAR52ds6tmqEUpeNkKzcgJXJnNAqm9IN_bIJkxyykGSsQyjVe3QcYxOB_fm-WPk_GqRFXAKqLJaX8VR_Se-Od6LZIY4fGyOjClrjNRyz111ERG0A==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This is a bio page for Fabio Giglietto, a Professor of Internet Studies at the University of Urbino Carlo Bo, highlighting his research interests in disinformation, social media analysis, and political communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Coordinated Hateful Disinformation on Italian Politics and Social Issues, since 2017 | Request PDF - ResearchGate",
    "snippet": "This ResearchGate entry references Fabio Giglietto's work (Giglietto et al., 2021) on disinformation in the context of COVID-19. It mentions his research on coordinated disinformation campaigns and the use of social media to influence political behavior, particularly concerning Facebook activity before the 2018 and 2019 Italian elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH9Hww06Gcz3pO9Cjro7gI0OJdkKiG6YfGaeA8gY5f_5ycLrZB7s8PV3gl_9k7g6hRO6xACGvKwhzjytA0fH06HuzjnmaTOcFNtlVotBR7d3ZfZVZNmorjgZxpAVM2fpcpysrO8cIg3j_3suFMVRJCDzTFPtOGh0bHUAky156SHfG9F5Dt6BEFyg8M8YZgKvyrnp5Eo7uYJ6ULW_YkwRCl3tF6t13rqn4nreQ_If8djYaH9p34o06O9COJK9AEAHMiOlQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate entry mentions Fabio Giglietto's research on disinformation related to COVID-19 and Italian elections, specifically referencing his 2021 publication. It discusses his work on coordinated disinformation campaigns and the impact of social media on political behavior.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Detection and Characterization of Coordinated Online Behavior: A Survey - arXiv",
    "snippet": "This survey paper cites Fabio Giglietto's work on coordinated online behavior, specifically mentioning his 2023 paper with Marino, Mincigrucci, and Stanziano on detecting and monitoring coordinated social media accounts during the 2022 Italian election, as well as Giglietto et al. [2020a].",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEdVZ26dW1qV3n5iQnSrtDZL1jDebV1ymbK_1jnnWCyui6uE_o5QziQnVIZyeAklqL-1fbQpSZO1wbX5jAbujHhgEeCsqeQt4oArSi6hehtW-ZbvftgthUX2x00yrIA",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This survey paper cites Fabio Giglietto's research on coordinated online behavior, specifically referencing his 2023 paper on the Italian election and a 2020 paper. It demonstrates the influence of his work within the field of social media analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "'Fake news' is the invention of a liar: How false information circulates within the hybrid news system - IRIS",
    "snippet": "This entry references Fabio Giglietto's work on 'fake news' and how false information circulates within the hybrid news system. Co-authors include Laura Iannelli, Augusto Valeriani, and Luca Rossi.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH6L1xaziQpAoAoEY1rV-4-yFJo-ln0AlM5jzOK_extutg23skhcxytRd7O8HfaVmIgs1F859eUGRAGYVsdwrOGXOhVF2tXAxYw43YAlvfnkvAtHyu5tAk62Ohxvu8diORDY79HwQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The entry references Fabio Giglietto's research on 'fake news' and its circulation within the hybrid news system, indicating a third-party mention of his academic work. The co-authors also suggest this is a legitimate research project.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Coordinated Link Sharing Behavior as a Signal to Surface Sources of Problematic Information on Facebook | Request PDF - ResearchGate",
    "snippet": "This ResearchGate entry discusses Fabio Giglietto's work (Giglietto et al. 2020) on coordinated link-sharing behavior (CLSB) as a signal to surface sources of problematic information on Facebook. It highlights how coordinated networks manipulate visibility and media narratives and how CLSB is associated with higher risks of encountering problematic news sources.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHa4FCbbt7yzjzUFpAFUU83FrYlHClhztCsBSlN6Ikj_D2iUerhuomH18H4aoyc2QMFPJGTvKmd2qnLALDK4mAl1lE5ARVzkkunC6-7acdMvoqlon1WJXUxiR7tNM78SlQf3RCIiU4E3kQkL2FCS6gpTiVvbZLiKRV-hzEtAMnzen1I98a6r9n8-8LR-rKJ8lf80hmpqJoBc_tdS0sd0SbLfBJ7U_2ve4vrdFSeJRXs8eEOO3xHHKBTzb54hiW9vGMiOl_SRl6YiaXaD2Ua3TTHNSesiiKT",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This ResearchGate entry references Fabio Giglietto's 2020 work on coordinated link-sharing behavior (CLSB) and its connection to the spread of problematic information on Facebook.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "POLITICAL ADVERTISEMENT AND COORDINATED BEHAVIOR ON SOCIAL MEDIA IN THE LEAD-UP TO THE 2021 GERMAN FEDERAL ELECTIONS - Landesanstalt für Medien NRW",
    "snippet": "This study references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) and coordinated networks on Facebook, specifically citing 'Giglietto, Righetti, Rossi, & Marino, 2020'. It discusses the use of CLSB to spread anti-establishment narratives and disinformation during elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE7ZXixd7XTfU5udkC4ucfE_bym_qeDcx6l1prS6rpkmmpw51CAml_7SfzBtdGk3gLucv59-wegh3x6YCk314MH9rq38gV-O5sJTBtmhxV9COVdqOUxm-Lkg_WrfQLb5_N2GXeMgHvJArgwtZqYJ6Ynj8bRhO3aTmdICrZnhz4WWEWVdu8bkvLJERP2zCTMyWBoYbLZsEPtTq3Fi98RZGFUqdFDy2FYEkZDPMb-CMGkMzCh",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This study on political advertisement and coordinated behavior during the 2021 German Federal Elections references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) and its use in spreading disinformation.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Fabio Giglietto",
    "snippet": "Fabio Giglietto, PhD, is a distinguished Professor of Internet Studies at the Department of Communication Sciences, Humanities, and International Studies at the University of Urbino Carlo Bo. His research focuses on social media analysis, computational social science, and the detection and analysis of disinformation campaigns, particularly in the context of political communication.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQESPK3gn1IwE97Ib4xKFqRUEm0A8xamgiewo2hsXQiaPPWDQNUt2WC7xucH3t1em27p9s8HqZyzmoeFP5PcMTOpHiYukdXLVWi6YwOjlJgMFNWpPcVdBNJBu7UbpA==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content explicitly mentions Fabio Giglietto as a Professor of Internet Studies at the University of Urbino Carlo Bo, detailing his research focus on social media analysis, computational social science, and disinformation campaigns, aligning with his expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Fabio Giglietto",
    "snippet": "Mentions Fabio Giglietto's presentation at the XX ISA World Congress of Sociology: 'Understanding Political Crises in the 2020s - a Sociocybernetics Approach' and 'Unintentional Exposure to Political News on Facebook's Religious Pages during the 2022 Italian Election Campaign.'",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGQ86rJQvqdnOf0_jxL_Zy44mx1QfzOpCq-GiiVgmATM0Wk9fg2dNyvU02jApoFUlLfkuX0tgXIe15btFNRUQfpfzt0ilCiVUD8sZY-O0YDe2aSjrFcj8OUmXL0jg-yagvR7SOBalL4gFJODuP7sSxjL0RI0tRurgMP8zymFL1k",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content mentions Fabio Giglietto's presentation at the XX ISA World Congress of Sociology on topics related to political crises, news exposure on Facebook's religious pages during the 2022 Italian election campaign, aligning with his expertise in social media and political communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Meet the speakers! - EUDTP 2025 - EuroTech Universities Alliance",
    "snippet": "Fabio Giglietto is a speaker at the EU Digital Technologies and Policies (EUDTP) conference in Brussels on May 14 and 15, 2025. He will be discussing implementation challenges and opportunities under the Digital Services Act (DSA).",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFjuV3m4LhZREUUfTXg1dWWHYw9lCPUM4A0XGB8iiVi7dLsCYHJBL7WcE2tW34zNlnzag6dlpf7V_0bmbC0QZUkBkuJUuUd-JRZ6EEcltk2U6B_D0fABAwsJPorw17WIojr_A8HhnRMcmc152DoFQWYR8wS9I2EMrXbwDEW6tbMTibuYRDFWIxVrgF3CRl88CAr8wK-3wXjVpXEWExC9wH-yJ2RuX_OwvqmUxoeA9Zmqq_bufHGw5QyNw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is a speaker at the EuroTech Universities Alliance EU Digital Technologies and Policies conference in Brussels, discussing the Digital Services Act.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Conference Schedule - International Conference on Social Media & Society",
    "snippet": "Fabio Giglietto participated in a panel discussion titled \"Topic Modelling for Research on Social Media Platforms\" at the International Conference on Social Media & Society, July 15, 2024.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEOa3yf2FYDIKlj_A2FC8hfR2jWNX1OhMjY6-aGSJmcsdXadfGQGspDqzTfuuIhkOkJoDel-gLGo-0cEVwOK_vKsm6vun9_ZAupncaij-_p3OqM-ZSzjhOMcHjVMbmLqLto2HscbYH9571VbbSmxoaH7IwpSLcB",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto participated in a panel discussion on topic modelling for social media research at the International Conference on Social Media & Society in July 2024, indicating his expertise in social media analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:47:55.645Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Advancing Research on Disinformation and Digital Manipulation: The University of Urbino at two Key Conferences in Brazil – vera.ai VERification Assisted by Artificial Intelligence",
    "snippet": "This article highlights Fabio Giglietto's presentations and moderation at two conferences in Brazil. He presented research on using large language models to analyze political discourse in hyperpartisan Facebook groups and co-authored a study on how deceptive information operations evolve. He also moderated a roundtable discussion on data access for social media research in the context of the Digital Services Act.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGF_WRkS9j1LA7W0BqQS4A-FsxedPJ3OtN-MEp6r4mANcRc0DCM7LrvL3M9aZSk6nWyDCJtxeabcJb6K7-y4cnhU0Hzl1UtxZnvNo9T6oD4WzPk0DaLYpqfQnQsV29bnbTZ--XxaSHx9jMm3i4wAZ7cJuNxBa9ANItSSA==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The article discusses Fabio Giglietto's presentations and moderation at two conferences in Brazil, where he presented research on using large language models to analyze political discourse and co-authored a study on deceptive information operations. It also mentions his moderation of a roundtable discussion on data access for social media research in the context of the Digital Services Act.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:34:03.598Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Integrating Large Language Models in Political Discourse Studies on Social Media: Challenges of Validating an LLMs-in-the-loop Pipeline | Sociologica",
    "snippet": "Fabio Giglietto is listed as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo, co-authoring a paper on integrating Large Language Models (LLMs) into research workflows for studying political content on social media. The paper discusses a validation protocol for LLM-integrated research, addressing the versatility, granularity, and limitations of LLMs in uncovering narratives. It focuses on challenges in validating a pipeline that classifies political links, clusters them by similarity, and generates descriptive labels, aiming to guide social scientists in employing LLM-based methodologies for political content analysis on social media. Published: 2024-10-30.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFpcc0eW6DUM0ckqlzaLEYSi8MMfMgYVP5PbkmP_oB2Fnopp2DjF--gz5LauKHGShPMQnaS2HaOlbRg7eO6gSEViXneme3dCI4m0haGVZf0hj1-RgnA-ZAns1CBSyJ88YJqY4DKQfoS8lvEK650gmiZ",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as an Associate Professor of Internet Studies at the University of Urbino Carlo Bo, co-authoring a paper on integrating Large Language Models (LLMs) into research workflows for studying political content on social media, published in October 2024.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:34:03.598Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "PROMPT_whitepaper_The State of Social Media Research APIs & Tools in the Digital Service Act Era - Zenodo",
    "snippet": "Fabio Giglietto, along with Massimo Terenzi, authored a white paper from the University of Urbino Carlo Bo, analyzing how the European Union’s Digital Services Act (DSA) is transforming data access for platform research. It draws on existing literature and testing of research APIs/tools from platforms like Meta, YouTube, and TikTok. The paper focuses on Article 40.12, which mandates access to publicly available data, and examines how Very Large Online Platforms (VLOPs) are implementing these requirements, identifying gaps, challenges, and potential solutions. Published: 2024-12-19.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFLGTYv_8mzGuxQbAZgGbcA2uJ6zgNxfnnjxxwwOj4RL7If8AjMZ0M6rw500aZcPQNkVPMH92QE4msCD_PylubOPpwYGIm6ItgfM8CINND50mOGgKy1bn2twOmMQCQ_TDWJDUYb9p86uDMx5RTdpdGu6t6ebNI3aUaLMPCBub6ehp_mSmBmq606qM1iDaDbbXpEkPccqTb1_i40zAjgiHr3zQM2z7AwbBajIIz-_bNvrLSYttbDB566rP9WCJ2IgAfU9lk_n0BX_BxxjRf9q2_9OCBun65IpzOM90wz-NjSGGqO2e_Hc9U_ItF7Ik8mWI5h",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto co-authored a white paper from the University of Urbino Carlo Bo analyzing the impact of the Digital Services Act (DSA) on data access for platform research, focusing on how VLOPs are implementing Article 40.12 regarding publicly available data.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:34:03.598Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Conference Schedule - International Conference on Social Media & Society",
    "snippet": "Fabio Giglietto (University of Urbino Carlo Bo) participated in a panel titled \"Topic Modelling for Research on Social Media Platforms\" at the International Conference on Social Media & Society. The panel aimed to discuss the benefits and limitations of topic models for research on social media data. Date of Conference: 2024-07-15.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQE8O52Q2KRPMPN5sGmfqm_6_EyV1vb9OTqAWRsPmYjc2TD2JKIYuUgkEC6I_OR4zp8gy-cW2mfd6Y3sKBfd7e7GOMZ0x4efxTiSamyUr_IOyqXLct3kPgwhQ48gFXgL6gE2DeCesolvF5kxT4v1ZdJMS3Y_hlaq",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto from the University of Urbino Carlo Bo participated in a panel discussion on topic modeling for social media research at the International Conference on Social Media & Society.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:34:03.598Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Fabio Giglietto",
    "snippet": "This page provides a detailed profile of Fabio Giglietto, highlighting his work as a Professor of Internet Studies at the University of Urbino Carlo Bo, his research on disinformation and social media, and mentions his publications in top-tier journals. It also mentions his work on coordinated link-sharing behavior during the Italian elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFT5BQCSZgRjlBeGa6HaG4vUZCNp384VUJomCedYOagNJJMfpAJiAs3DgtyuimxVBDozacpTkfLPwrJq7apwKpENxM7lcO-B0TtqwOdjO0mYTbmqxD4Z8VM5y6kgw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content appears to be a profile of Fabio Giglietto, Professor of Internet Studies at the University of Urbino Carlo Bo. It highlights his research on disinformation and social media, mentioning his publications and work on Italian elections, suggesting a recent academic profile.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "People - Summer Institute in Computational Social Science",
    "snippet": "Fabio Giglietto is listed as a faculty member/organizer at the Summer Institute in Computational Social Science (SICSS). His affiliation and research interests (digital media, public opinion, democratic processes) are mentioned.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGetM3MFpYDA_QvKXyjdXCA9Ka19Yvq0XorW-JdVKZ6_afmyvf4AukpBNYiwpbDNH5zKLWt6MyvP0O26JWqqB7iCZNyDWztlgWWmuBIcTv7qbLN0whvWLgV",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "Fabio Giglietto is listed as faculty at the Summer Institute in Computational Social Science, which aligns with his expertise in digital media, public opinion, and democratic processes.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Italy at the Polls 2022: The Right Strikes Back 3031292979, 9783031292972 - dokumen.pub",
    "snippet": "Fabio Giglietto is mentioned as teaching Internet Studies at the University of Urbino Carlo Bo and as the lead researcher for the 'Mapping Italian News' program.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG5U8gjYASzp5iYl0PiKscOT_aocB3rDpAfFr-tcvRIFvr79qEAgo7ORNpLYN3qUI0-6lXexxey6LNqboL3L4oQoYVhuTPrls56uW6WeaYkRcARSgNkT6PfdlImTJQVAcqJc_F2X3pMcENXNvD9dwbTVVXWsiztiAN0hAdgD9LPQjLcQu8MROXy9hp_AmBFeenEufnmjrFGVChsKw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This content likely references Fabio Giglietto's work on Italian news and his role at the University of Urbino Carlo Bo, potentially in the context of the 2022 Italian elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "REVISITING KEY CONCEPTS IN DIGITAL MEDIA RESEARCH: INFLUENCE, POPULISM, PARTISANSHIP, POLARISATION",
    "snippet": "This paper cites Fabio Giglietto's work on the Multi-Party Media Partisanship Attention Score (MP-MPAS) and its application to understanding partisan information dynamics in social media.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQH8BtmG9-5kxvWsW7jpYC9lqINCKIHk2iF-yKfAGGuyLKxRDNhRg60T9h3-VrC2GXEIvSMl374O0-G6OtxAh3BeYar_Gq4gv6DVIMeImujexQI7DhPpvh0R-hCSOR0cQXnhQ50q0Zwx5ijbyEPm9qO3NAGu-zuIWJXwojP0L_RC7j1hFFEXeA==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The paper \"REVISITING KEY CONCEPTS IN DIGITAL MEDIA RESEARCH\" cites Fabio Giglietto's work on the Multi-Party Media Partisanship Attention Score (MP-MPAS) in the context of partisan information dynamics on social media.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "A Workflow to Detect, Monitor, and Update Lists of Coordinated Social Media Accounts Across Time - Uniurb",
    "snippet": "This paper references Giglietto's work on Coordinated Link Sharing Behavior (CLSB) and its use in detecting problematic information and coordinated social media actors, specifically in the context of the 2022 Italian general elections.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFor1PjVx2iG6gSpZISQ51FQcsOYA6wSISmKqdXXYl_XkId65spFrGM6XXO5Gox1HVjVQscc64kyLLsO1J5UgA4UUWLA_R7TpVPnXEljfoXN5sI8mqZqApBgqF1_OUbD-9n9zKkkXEyqAFMLyplVwihxR4jxLSSHhzp8uzzbfz4S30Oq6_9DQFJWZkBc8anDFSM8pcUmQx9dfEV4bgZi1hBQoDqDvDGXCq1F8zps_H9c6E5bcXV_64cs0iNQK8ZB_n1__7fJ8CNuEWXSucV-r5S4TYIeKTxOXd9i4p8xBwtVdFDOeTykhcOW6S6J-HQUj1F_MfQjsQiA6zqOw==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This paper from Uniurb references Fabio Giglietto's research on Coordinated Link Sharing Behavior (CLSB) in the context of detecting problematic information during the 2022 Italian general elections.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "Professor of Internet Studies",
    "snippet": "Fabio Giglietto is a Professor of Internet Studies at the Department of Communication Sciences, Humanities, and International Studies at the University of Urbino Carlo Bo. His research focuses on the relationships between social systems, media, and digital technologies, with recent projects focusing on social media analysis, computational social science, and the detection and analysis of disinformation campaigns.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGHcvjEMQuTA8aCc0IlqrG0hHf0-BheCfYQL3Xiy6tvrO3UwA78i0cR-MZoV3FG3RLk4RPI_3pefrRGYJ61QjxNPL-WylhN3ZzXyIQitmj58S9BlqaU6lx6js5NuQ==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "The content explicitly mentions Fabio Giglietto as a Professor of Internet Studies at the University of Urbino Carlo Bo, and describes his research interests in social media analysis, computational social science, and disinformation detection, aligning with his known areas of expertise.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "A Workflow to Detect, Monitor, and Update Lists of Coordinated Social Media Accounts Across Time - Uniurb",
    "snippet": "Fabio Giglietto co-authored a paper on detecting and monitoring coordinated social media accounts, applying a workflow to study the 2022 Italian snap election. The research builds on previous work examining coordinated inauthentic behavior.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHJKp9Ozof7m_5k2NIij7thrkJFrI8SysW-PjWQmSvn3mqFmGJDoPS4M9dGc2H_FkY0dv3F8FoyQnCb7QpYQ28AMXSCqVyXv9a56s4Sy_PRBWmlG6-VIc4BGWWUxFvLq1Osa2uSub6TYynRKnY_-WRXaaaKBhNwtoAqfzHHDX8bhSjjwRxLfbg6VXU8AVxQYOBL6ish21AmO5dqcKjoz-EuHww30gj3u2y4zgNP178rHkGMyCQu7CJMtXGAFgoX_VbwK2V2BgN7-Bf9R7fwh0PrSen_VGiOl_SLzQTQf-SddSFgy8Yw_q-k04thPMx1dQwH0b2cR9Hxh9x3yg==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This article discusses a paper co-authored by Fabio Giglietto on detecting and monitoring coordinated social media accounts, focusing on the 2022 Italian snap election. The research builds upon his expertise in coordinated inauthentic behavior.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "INTERNET STUDIES - Lecturer: Fabio Giglietto - A.Y. 2025/2026 - Credits 8 - Uniurb",
    "snippet": "Fabio Giglietto is the lecturer for the Internet Studies course at the University of Urbino for the academic year 2025/2026. The course covers key concepts of Internet Studies, media manipulation, and research methods, including social media data analysis.",
    "url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGC0hfvRNCL41pZLtdpARrq4tMrNBSCV5GU0Ax-nMmc4ePpnWUq3N-j8V6vNhtDNrHAdQiLdQuy42Lue2pg9A9WmzB7sF3EnmMQEuctWo6Pgb-tca7BU21vBPX1fK9w4A==",
    "date": "2025-12-29",
    "source": "vertexaisearch.cloud.google.com",
    "description": "This web mention refers to Fabio Giglietto as the lecturer for the Internet Studies course at the University of Urbino for the academic year 2025/2026, covering topics such as media manipulation and social media data analysis.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-12-29T16:15:44.968Z",
    "collectionRun": "2025-12-29"
  },
  {
    "title": "L’Europa assolda Urbino contro le fake-news",
    "snippet": "",
    "url": "https://www.ilrestodelcarlino.it/pesaro/cronaca/leuropa-assolda-urbino-contro-le-fake-news-91d8600d?utm_source=openai",
    "date": "2025-10-27",
    "source": "ilrestodelcarlino.it",
    "description": "L’Europa assolda Urbino contro le fake-news",
    "relevanceScore": 0.5,
    "personMatch": "uncertain",
    "collectedAt": "2025-10-27T06:31:21.929Z",
    "collectionRun": "2025-10-27"
  },
  {
    "title": "DMRC Visitor Seminar: Prof. Fabio Giglietto - QUT Digital Media Research Centre",
    "snippet": "",
    "url": "https://research.qut.edu.au/dmrc/2023/06/08/dmrc-visitor-seminar-prof-fabio-giglietto/?utm_source=openai",
    "date": "2025-07-06",
    "source": "research.qut.edu.au",
    "description": "The content is about a seminar featuring Prof. Fabio Giglietto at the QUT Digital Media Research Centre, likely discussing his expertise in social media and digital communication.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-07-06T00:52:48.465Z",
    "collectionRun": "2025-07-06"
  },
  {
    "title": "INTRODUCTION TO DATA ANALYSIS FOR MEDIA STUDIES - Lecturer: Fabio Giglietto - A.Y. 2024/2025 - Credits 5",
    "snippet": "",
    "url": "https://www.uniurb.it/syllabi/267263?utm_source=openai",
    "date": "2025-07-05",
    "source": "uniurb.it",
    "description": "The content is a course syllabus for 'Introduction to Data Analysis for Media Studies' taught by Fabio Giglietto at the University of Urbino Carlo Bo for the academic year 2024/2025.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-07-05T00:44:26.479Z",
    "collectionRun": "2025-07-05"
  },
  {
    "title": "DIGITAL SOCIAL NETWORK ANALYSIS - Lecturer: Fabio Giglietto - A.Y. 2024/2025 - Credits 6",
    "snippet": "",
    "url": "https://www.uniurb.it/syllabi/265964?utm_source=openai",
    "date": "2025-07-05",
    "source": "uniurb.it",
    "description": "The content is a course listing for 'Digital Social Network Analysis' taught by Fabio Giglietto at the University of Urbino Carlo Bo for the academic year 2024/2025.",
    "relevanceScore": 0.9,
    "mentionedByName": true,
    "personMatch": "confirmed",
    "isRecent": true,
    "collectedAt": "2025-07-05T00:44:26.479Z",
    "collectionRun": "2025-07-05"
  },
  {
    "title": "Decoding the News Media Diet of Disinformation Spreaders",
    "snippet": "",
    "url": "https://arxiv.org/abs/2402.02173?utm_source=openai",
    "date": "2025-06-10",
    "source": "arxiv.org",
    "description": "This paper on arXiv discusses the news media consumption patterns of individuals who spread disinformation, a topic closely related to Fabio Giglietto's expertise in disinformation studies.",
    "relevanceScore": 0.9,
    "collectedAt": "2025-06-10T06:45:26.015Z",
    "collectionRun": "2025-06-10"
  }
]