{
  "source": "ORA UNIURB",
  "repository": "https://ora.uniurb.it",
  "oaiEndpoint": "https://ora.uniurb.it/oai/request",
  "collectedAt": "2025-12-31T06:32:18.584Z",
  "author": "Fabio Giglietto",
  "publications": [
    {
      "title": "Manipolazione dei media ed influenza digitale. Sfide, tecnologie e risposte",
      "authors": "Fabio Giglietto; Nicola Righetti; Timothy Graham",
      "authorsList": [
        "Fabio Giglietto",
        "Nicola Righetti",
        "Timothy Graham"
      ],
      "year": 2025,
      "doi": null,
      "handle": "11576/2766471",
      "type": "chapter",
      "abstract": null,
      "publisher": "Feltrinelli Editore",
      "journal": null,
      "pages": null,
      "language": "ita",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2766471",
      "datestamp": "2025-11-22T00:51:48Z",
      "url": "https://ora.uniurb.it/handle/11576/2766471"
    },
    {
      "title": "Viralità",
      "authors": "Fabio Giglietto; Augusto Valeriani",
      "authorsList": [
        "Fabio Giglietto",
        "Augusto Valeriani"
      ],
      "year": 2025,
      "doi": null,
      "handle": "11576/2765591",
      "type": "chapter",
      "abstract": null,
      "publisher": "Carocci",
      "journal": null,
      "pages": null,
      "language": "ita",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2765591",
      "datestamp": "2025-11-30T00:29:06Z",
      "url": "https://ora.uniurb.it/handle/11576/2765591"
    },
    {
      "title": "The power of Alternative Influence Networks (AIN) for spreading Covid-19 problematic information on Facebook during a year of pandemic",
      "authors": "Giada Marino; Fabio Giglietto",
      "authorsList": [
        "Giada Marino",
        "Fabio Giglietto"
      ],
      "year": 2023,
      "doi": "10.1445/106772",
      "handle": "11576/2714451",
      "type": "article",
      "abstract": "Public figures and influencers seem to play an increasingly important role in the contemporary media ecosystem. Their statements circulate quickly, seemingly moving from broadcast to digital media and from the titles of news stories to memes. This paper studies the role played by these dynamics among the Alternative Influence Network (AIN) during the Covid-19 pandemic crisis in Italy by leveraging a dataset of 175,228 Facebook posts created over one year by a list of covid-skeptic accounts. Findings contribute to shed some light on the role played by the AIN on news circulation in the contemporary hybrid media ecosystem and inter-media agenda setting. What is more, findings suggest that hybridity also takes place through remediation, where media production includes how these claims are consumed and circulated.",
      "publisher": null,
      "journal": "PROBLEMI DELL'INFORMAZIONE",
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2714451",
      "datestamp": "2024-10-31T00:02:06Z",
      "url": "https://ora.uniurb.it/handle/11576/2714451"
    },
    {
      "title": "Cracking Open the European Newsfeed",
      "authors": "Rossi, Luca; Giglietto, Fabio; Marino, Giada",
      "authorsList": [
        "Rossi, Luca",
        "Giglietto, Fabio",
        "Marino, Giada"
      ],
      "year": 2023,
      "doi": "10.51685/jqd.2023.020",
      "handle": "11576/2726579",
      "type": "article",
      "abstract": "This  paper  contributes  to  the  ongoing  effort  to  describe  and  quantify  the quality of information that is shared on large social media platforms. We  do  this  by  complementing  existing  research  that  provided  the  first quantitative  assessment  of  the  quality  of  the  information  circulating  on Facebook among US users. Leveraging an updated version of the same data source —Meta’s URL Shares Dataset —and  replicating  much  of  the methodology,  we  quantify  the  trustworthy  and  untrustworthy  links  to external websites that have been shared on Facebook in the period between 2019 and 2022 in three  major European countries (Germany,  France,  and Italy).  We  observe  a  clear  decline  in  the  number  of  URLs  present  in  the dataset  and  an  increase  in  the  URLs  from  untrustworthy  domains  as  a percentage  of  the  total  URLs  shared  in  a  year.  This  increase  seems  to  be higher in electoral years (in Germany and in Italy) but itdoes not translate into an increase of Views received from untrustworthy sources.",
      "publisher": null,
      "journal": "JOURNAL OF QUANTITATIVE DESCRIPTION: DIGITAL MEDIA",
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2726579",
      "datestamp": "2024-03-19T02:16:50Z",
      "url": "https://ora.uniurb.it/handle/11576/2726579"
    },
    {
      "title": "A Workflow to Detect, Monitor, and Update Lists of Coordinated Social Media Accounts Across Time: The Case of the 2022 Italian Election",
      "authors": "Fabio Giglietto; Giada Marino; Roberto Mincigrucci; Anna Stanziano",
      "authorsList": [
        "Fabio Giglietto",
        "Giada Marino",
        "Roberto Mincigrucci",
        "Anna Stanziano"
      ],
      "year": 2023,
      "doi": "10.1177/20563051231196866",
      "handle": "11576/2721991",
      "type": "article",
      "abstract": "Information operations that target public opinion often exploit breaking news, crises, and elections by using coordinated social media actors to disseminate problematic content. These events often reveal the relationships between actors, prompting the creation of lists of malicious actors and news sources. However, relying on outdated lists may underestimate the prevalence and impact of such operations. This article presents a novel workflow to detect, monitor, and update lists of coordinated social media actors during and beyond peak activity periods. Using this approach, known problematic actors are constantly monitored, allowing the detection of new actors and the update of the monitored pool. The workflow was applied to the 2022 Italian snap election, leveraging previous research on coordinated inauthentic behavior during the 2018 and 2019 Italian elections. The initial list of 435 coordinated accounts was monitored, surfacing 1,022 overly shared or commented political posts, 272 coordinated links, and detecting 66 political and 554 generic coordinated accounts not previously listed. Three case studies were identified: one politically motivated, one click-economy driven, and one religiously motivated operation. The article discusses the implications of this approach, its limitations, and potential future work.",
      "publisher": null,
      "journal": "SOCIAL MEDIA + SOCIETY",
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2721991",
      "datestamp": "2025-06-13T00:16:40Z",
      "url": "https://ora.uniurb.it/handle/11576/2721991"
    },
    {
      "title": "Hyperpartisan Networks on Facebook. The Case of the Five Star Movement Network During the 2022 Italian Election",
      "authors": "Anna Stanziano; Fabio Giglietto",
      "authorsList": [
        "Anna Stanziano",
        "Fabio Giglietto"
      ],
      "year": 2023,
      "doi": "10.3270/108997",
      "handle": "11576/2740791",
      "type": "article",
      "abstract": "This paper aims to shed light on networks consisting of subjects that share similar opinions and worldviews. This is not a new phenomenon, but undoubtedly social media, thanks to the possibility of finding affinities with subjects who have shared interests, even if geographically distant, has facilitated the collaboration among networks of like-minded individuals. Several studies have shown that the tendency of people to interact with other people with similar values and points of view is widespread among populist networks, so, following this assumption, this work focuses on a specific network: that of the unofficial Facebook pages and groups close to the Five Star Movement. In this work, we looked at the activities of the unofficial Facebook pages and groups close to the 5SM and explored the main topics discussed and the dynamics of the discussion within the network during the last Italian general election. In particular, we focused on how Facebook pages and groups used Facebook native or external sources of information in generating content. This study, although still partly descriptive, helps to understand the information ecosystem of the 5SM network on Facebook and also offers useful insights into the role played on social media by partisan communities, with particular reference to the populist ones",
      "publisher": null,
      "journal": "COMUNICAZIONE POLITICA",
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2740791",
      "datestamp": "2025-04-21T08:27:33Z",
      "url": "https://ora.uniurb.it/handle/11576/2740791"
    },
    {
      "title": "THE ‘SEASIDE CAMPAIGN’ AS SEEN FROM THE POINT OF VIEW OF FACEBOOK AND INSTAGRAM",
      "authors": "G. Boccia Artieri; F. Giglietto; A. Stanziano",
      "authorsList": [
        "G. Boccia Artieri",
        "F. Giglietto",
        "A. Stanziano"
      ],
      "year": 2023,
      "doi": null,
      "handle": "11576/2718711",
      "type": "chapter",
      "abstract": "This chapter outlines the most relevant topics discussed during the campaign on two Italian mainstream social media. The study analyzes posts collected through CrowdTangle mentioning a set of political keywords published on Facebook Pages/groups and Instagram accounts between 21 July, when Draghi resigned as Prime Minister, and 25 September 2022, the day of the election. A breakout algorithm detector is used to identify peaks in daily engagement, and for each peak, the main topics were identified using LDA (Latent Dirichlet Allocation). The chapter provides insight into the trends and topics that were most likely to drive engagement on these platforms during the campaign period. The results of the study may be useful for understanding the role of social media in political communication and for identifying the most effective strategies for reaching and engaging with voters through these channels.",
      "publisher": "Palgramve Macmillan",
      "journal": null,
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2718711",
      "datestamp": "2023-07-04T10:37:06Z",
      "url": "https://ora.uniurb.it/handle/11576/2718711"
    },
    {
      "title": "Unexpected consequences of a simple threshold: the effect of the 100 public shares on Meta’s URL Shares Dataset",
      "authors": "Fabio Giglietto; Luca Rossi; Nicola Righetti",
      "authorsList": [
        "Fabio Giglietto",
        "Luca Rossi",
        "Nicola Righetti"
      ],
      "year": 2022,
      "doi": "10.31235/osf.io/2p7ws",
      "handle": "11576/2721992",
      "type": "other",
      "abstract": null,
      "publisher": null,
      "journal": null,
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2721992",
      "datestamp": "2023-09-11T23:08:06Z",
      "url": "https://ora.uniurb.it/handle/11576/2721992"
    },
    {
      "title": "POLITISCHE WERBUNG UND KOORDINIERTES VERHALTEN IN SOZIALEN MEDIEN IM VORFELD DER BUNDESTAGSWAHL 2021",
      "authors": "Nicola Righetti; Fabio Giglietto; Azade Esther Kakavand; Aytalina Kulichkina; Giada Marino; Massimo Terenzi",
      "authorsList": [
        "Nicola Righetti",
        "Fabio Giglietto",
        "Azade Esther Kakavand",
        "Aytalina Kulichkina",
        "Giada Marino",
        "Massimo Terenzi"
      ],
      "year": 2022,
      "doi": null,
      "handle": "11576/2733993",
      "type": "other",
      "abstract": "In dieser Studie analysieren wir die organische und bezahlte Social-Media-Kommunikation politischer Kandidieren- der, Parteien und anderen Social-Media-Nutzerinnen und Nutzern im Vorfeld der deutschen Bundestagswahl 2021. Wir dokumentieren die Investitionen der wichtigsten Parteien in Facebook-Werbung, ihre Targeting-Strategien und das Engagement, das sie organisch erreicht haben, sowie die Aktivität koordinierter Netzwerke von Facebook-Seiten und -Gruppen, die sich mit der Wahl befassen.\r\nWie schon im Jahr 2019 (Hegelich & Serrano, 2019) erreichte die AfD ein außergewöhnlich hohes Engagement auf Facebook. Aber nicht die CDU, sondern Die Grünen führten die Rangliste der Facebook-Werbeinvestitionen im Jahr 2021 an. Dennoch wurden beide bei der Gesamtzahl der Anzeigenaufrufe von der FDP überholt, die insgesamt weni- ger ausgab, aber eine höhere Anzahl von Anzeigen schaltete.\r\nBei der Betrachtung von Microtargeting zeigen unsere Ergebnisse, dass der Inhalt einiger Anzeigen ausschließlich auf Frauen oder junge Generationen ausgerichtet war. Sie machten jedoch nur einen geringen Anteil an der Gesamt- zahl der von Parteien und Kandidierenden geschalteten Anzeigen aus.\r\nDes Weiteren fanden wir große koordinierte Netzwerke auf Facebook (Giglietto, Righetti, Rossi, & Marino, 2020), die Anti-Establishment-Narrative sowie Botschaften gegen die Corona Schutzmaßnahmen und gegen die COVID-19- Politik im Allgemeinen verbreiteten. In diesen Netzwerken waren harsche Kommentare gegen die Gegnerinnen und Gegner und ein breites Spektrum an Quellen, die Desinformationen (NewsGuard, 2021) während der Wahlen verbreiteten, üblich.\r\nBei der Betrachtung der Ergebnisse muss beachtet werden, dass die hier durchgeführten Analysen aufgrund von Ein- schränkungen beim Datenzugang schnell an Grenzen gestoßen sind. Insbesondere das Fehlen von Facebook-Daten über die Aktivitäten einzelner Nutzerinnen und Nutzer verhindert die Untersuchung des möglichen Einsatzes von Bots, die in schneller Abfolge Inhalte in mehreren öffentlichen Gruppen posten und die Interaktionsmetriken aufblähen. Das Fehlen von Daten über Facebook-Kommentare verhindert die Analyse koordinierter Strategien, die darauf abzielen, unter dem Radar von Faktenprüferinnen und Faktenprüfern und Reglementierung durch die Plattform zu bleiben. Der Mangel an genaueren Daten über Werbung hat uns auch daran gehindert, neben den allgemeinen Fällen in Bezug auf Geschlecht und Alter auch Microtargeting-Strategien zu untersuchen.",
      "publisher": null,
      "journal": null,
      "pages": null,
      "language": "ger",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2733993",
      "datestamp": "2024-03-27T00:20:48Z",
      "url": "https://ora.uniurb.it/handle/11576/2733993"
    },
    {
      "title": "POLITICAL ADVERTISEMENT AND COORDINATED BEHAVIOR ON SOCIAL MEDIA IN THE LEAD-UP TO THE 2021 GERMAN FEDERAL ELECTIONS",
      "authors": "Righetti N.; Giglietto F.; Kakavand A. E.; Kulichkina A.; Marino G.; Terenzi M.",
      "authorsList": [
        "Righetti N.",
        "Giglietto F.",
        "Kakavand A. E.",
        "Kulichkina A.",
        "Marino G.",
        "Terenzi M."
      ],
      "year": 2022,
      "doi": null,
      "handle": "11576/2733992",
      "type": "other",
      "abstract": "In this study, we analyze organic and paid social media communication from political candidates, parties, and other social media users, in the lead-up to the 2021 German federal election. We document the investment in Facebook advertising of the main parties and their targeting strategies, the engagement they reached organically, and the activity of coordinated networks of Facebook pages and groups dealing with the election.\r\n\r\nAs in 2019 (Hegelich & Serrano, 2019), the AfD reached an exceptionally high engagement on Facebook, but Die Grünen, instead of CDU, led the standings of the Facebook advertisement investment in 2021. Nonetheless, they were both outrun in the overall number of ad impressions by the FDP, who strategically spent less on a higher number of advertisements.\r\nConsidering the area of microtargeting, our findings show that the content of some advertisements was exclusively targeted to women or young generations. They, however, represented just a modest part of the total number of advertisements run by parties and candidates.\r\nWe also found large coordinated networks on Facebook (Giglietto, Righetti, Rossi, & Marino, 2020) spreading anti-establishment narratives, as well as anti-lockdown and anti-COVID19 policies messages. In these networks, harsh comments against opponents and a wide range of sources that shared disinformation (NewsGuard, 2021) during the elections were common.\r\nThe analyses herein conducted quickly ran into limitations in data access. In particular, the lack of Facebook data on the activity of individual users prevented exploring the possible use of bots to quickly cross-post content in public groups and inflate engagement metrics. The lack of data on Facebook comments prevented the analysis of coordi- nated strategies aimed at staying under the radar of fact-checkers and platforms censoring. The lack of fine-grained data on advertising also prevented us from investigating microtargeting strategies besides general cases related to gender and age.",
      "publisher": null,
      "journal": null,
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2733992",
      "datestamp": "2024-03-28T00:18:13Z",
      "url": "https://ora.uniurb.it/handle/11576/2733992"
    },
    {
      "title": "Detecting Coordinated Link Sharing During The Italian Coronavirus Outbreak",
      "authors": "Fabio Giglietto; Nicola Righetti; Giada Marino",
      "authorsList": [
        "Fabio Giglietto",
        "Nicola Righetti",
        "Giada Marino"
      ],
      "year": 2020,
      "doi": "10.5210/spir.v2020i0.11219",
      "handle": "11576/2735343",
      "type": "conference",
      "abstract": "Social media, as many scholars have shown, can be used to influence political behavior through coordinated disinformation campaigns in which participants pretend to be ordinary citizens. With a specific reference to Facebook, a recent study has spotlighted patterns of coordinated activity aimed at fueling online circulation of specific news stories before the 2018 and 2019 Italian elections, an activity called by the authors “Coordinated Link Sharing Behavior” (CLSB). More precisely, CLSB refers to the coordinated shares of the same news articles in a very short time by networks of entities composed by Facebook pages, groups and verified public profiles. The uncertainty related to the coronavirus outbreak is a unique chance for malicious actors to leverage the anxiety of online publics to reach their goals, filling the information void with problematic content. Considering the association between coordination, media manipulation, and problematic information, the entities involved in coordinated online activities represent a privileged perspective on these phenomena. Thus, against the backdrop of the literature and the already conducted studies, this proposal will discuss Coordinated Link Sharing Behavior in the context of the coronavirus outbreak informational void, analyzing network mutations over time and the content strategies used to exploit the ambiguity associated with the topic.",
      "publisher": null,
      "journal": null,
      "pages": null,
      "language": "eng",
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2735343",
      "datestamp": "2024-04-22T23:38:36Z",
      "url": "https://ora.uniurb.it/handle/11576/2735343"
    },
    {
      "title": "Adapting to Mitigation Efforts: Evolving Strategies of Coordinated Link Sharing on Facebook",
      "authors": "Giglietto, Fabio; Terenzi, Massimo; Marino, Giada; Righetti, Nicola; Rossi, Luca",
      "authorsList": [
        "Giglietto, Fabio",
        "Terenzi, Massimo",
        "Marino, Giada",
        "Righetti, Nicola",
        "Rossi, Luca"
      ],
      "year": 2020,
      "doi": "10.2139/ssrn.3775469",
      "handle": "11576/2703873",
      "type": "other",
      "abstract": null,
      "publisher": null,
      "journal": null,
      "pages": null,
      "language": null,
      "oaiIdentifier": "oai:ora.uniurb.it:11576/2703873",
      "datestamp": "2023-06-13T07:13:48Z",
      "url": "https://ora.uniurb.it/handle/11576/2703873"
    }
  ],
  "stats": {
    "total": 12,
    "byType": {
      "chapter": 3,
      "article": 4,
      "other": 4,
      "conference": 1
    },
    "byYear": {
      "2020": 2,
      "2022": 3,
      "2023": 5,
      "2025": 2
    }
  }
}